import { 存档 } from "../管理器/存档管理器";
import { 计算数值 } from "../方法函数/属性计算";

export interface 竞技场名气配置类型 {
	名气等级: number,
	所需名气: number,
	名气名称: string,
	出场费: number,
	瓶颈: number,
	晋级系数: number,
}

export interface 竞技场敌人配置类型 {
	名称: string,
	概率: number,
	奖金: number,
	加名气: number,
	属性系数: number,
	阶段: number,
}

const 竞技场名气档位 = [
	{ 名气等级: 1, 所需名气: -100, 名气名称: "籍籍无名", get 出场费(){ return Math.floor(2 * 存档.其他.名气) }, 瓶颈: 30, 晋级系数: 3},
	{ 名气等级: 2, 所需名气: 30, 名气名称: "崭露头角", get 出场费(){ return Math.floor(50 + 2.4 * 存档.其他.名气)}, 瓶颈: 60, 晋级系数: 6},
	{ 名气等级: 3, 所需名气: 60, 名气名称: "略有耳闻", get 出场费(){ return Math.floor(100 + 8.4 * 存档.其他.名气)}, 瓶颈: 120, 晋级系数: 9 },
	{ 名气等级: 4, 所需名气: 120, 名气名称: "小有名气", get 出场费(){ return Math.floor(150 + 12.8 * 存档.其他.名气)}, 瓶颈: 180, 晋级系数: 14},
	{ 名气等级: 5, 所需名气: 180, 名气名称: "声名鹊起", get 出场费(){ return Math.floor(160 + 17 *  存档.其他.名气) }, 瓶颈: 300, 晋级系数: 20},
	{ 名气等级: 6, 所需名气: 300, 名气名称: "名噪一时", get 出场费(){ return Math.floor(170 + 22.8 * 存档.其他.名气)}, 瓶颈: 300000, 晋级系数: 2000 },
];

export const 瓶颈档位 = 竞技场名气档位.map(x => x.瓶颈)

export function 获取竞技场名气配置(): 竞技场名气配置类型 {
	const 名气 = 存档.其他.名气
	const 档位 = 竞技场名气档位.slice().reverse().find(item => 名气 >= item.所需名气) || 竞技场名气档位[0];
	return {
		名气等级: 档位.名气等级,
		所需名气: 档位.所需名气,
		名气名称: 档位.名气名称,
		出场费: 档位.出场费,
		瓶颈: 档位.瓶颈,
		晋级系数: 档位.瓶颈,
	};
}

export function 获取竞技场常规赛敌人配置(): 竞技场敌人配置类型 {
	const 名气 = 存档.其他.名气 ;
	const 名气配置 = 获取竞技场名气配置();
	const 敌人段位系数 = Math.max(1, Math.floor(名气 / 50) + 1);
	const 拳击手组: 竞技场敌人配置类型[] = [
		{
			名称: "身形单薄的拳手",
			概率: 20,
			奖金: 100 * 名气配置.名气等级,
			加名气: 0.5,
			属性系数: 0.7 * 敌人段位系数,
			阶段: 敌人段位系数,
		},
		{
			名称: "沉稳干练的拳手",
			概率: 20,
			奖金: 100 * 名气配置.名气等级,
			加名气: 1,
			属性系数: 1.0 * 敌人段位系数,
			阶段: 敌人段位系数,
		},
		{
			名称: "身材魁梧的拳手",
			概率: 10,
			奖金: 150 * 名气配置.名气等级,
			加名气: 1.5,
			属性系数: 1.5 * 敌人段位系数,
			阶段: 敌人段位系数,
		},
		{
			名称: "凶神恶煞的拳手",
			概率: 10,
			奖金: 200 * 名气配置.名气等级,
			加名气: 2,
			属性系数: 2 * 敌人段位系数,
			阶段: 敌人段位系数,
		}
	];
	const 随机敌人 = 拳击手组[Math.floor(Math.random() * 拳击手组.length)];
	存档.临时数据.竞技场常规赛 = 随机敌人
	return 随机敌人;
}
