import { error, warn } from "cc";
import type { 对局类型 } from "../场景脚本/战斗";
import type { 计算容器类型 } from "../方法函数/属性计算";
import type { 等级计算容器类型 } from "../方法函数/等级计算";
import type { 概率类型 } from "../方法函数/公共函数";
import type { 食物项目类型 } from "../默认内容/食物表";
import type { 商品定义类型 } from "../默认内容/商品表";
import type { 制作类型 } from "../默认内容/制作表";
import type { 事件项目类型 } from "../默认内容/事件表";

export type 钩子函数类型 = (...参数: any[]) => any;
export type 计算钩子类型 = (计算容器: 计算容器类型) => void;
export type 等级计算钩子类型 = (计算名称: string, 计算容器: 等级计算容器类型) => void;
export type 战斗钩子类型 = (对局: 对局类型) => string | void;

export interface 收集材料上下文类型 {
	物品表: 概率类型[],
	结果文本: string[],
}

export interface 通用效果字段类型 {
	[时机: string]: 钩子函数类型 | undefined,

	新建游戏?: () => void,
	主页更新?: () => void,
	前进前?: () => void,
	前进后?: () => void,
	探索前?: () => void,
	探索后?: () => void,
	读书?: () => void,

	获取挑战列表?: (挑战组: string[]) => void,
	激活天赋?: (名称: string) => void,
	完成成就?: (名称: string) => void,
	睡觉结算?: (结果文本: string[]) => void,
	收集材料?: (上下文: 收集材料上下文类型) => void | boolean,
	计算地区敌人表?: (敌人表: 概率类型[]) => void,
	计算地区事件表?: (事件表: 概率类型[]) => void,
	计算地区物品表?: (上下文: 收集材料上下文类型) => void,

	进食前?: (食物: 食物项目类型) => void,
	进食后?: (食物: 食物项目类型) => void,
	购买后?: (商品: 商品定义类型) => void,
	出售后?: (商品: 商品定义类型) => void,
	制作后?: (制作: 制作类型) => void,
	触发事件?: (事件: 事件项目类型) => void,
	事件结束?: (事件: 事件项目类型) => void,

	战斗初始化?: 战斗钩子类型,
	攻击前?: 战斗钩子类型,
	攻击时?: 战斗钩子类型,
	攻击后?: 战斗钩子类型,
	被攻击前?: 战斗钩子类型,
	被攻击时?: 战斗钩子类型,
	被攻击后?: 战斗钩子类型,
	战斗胜利?: 战斗钩子类型,
	战斗失败?: 战斗钩子类型,
	逃跑成功?: 战斗钩子类型,
	逃跑失败?: 战斗钩子类型,
	敌人逃跑成功?: 战斗钩子类型,

	计算获取经验?: 计算钩子类型,
	计算额外天赋概率?: 计算钩子类型,
	计算最大攻击?: 计算钩子类型,
	计算最大防御?: 计算钩子类型,
	计算最大生命?: 计算钩子类型,
	计算最大精力?: 计算钩子类型,
	计算最大饥饿?: 计算钩子类型,
	计算最大逃跑?: 计算钩子类型,
	计算最大压制?: 计算钩子类型,
	计算前进探索消耗精力?: 计算钩子类型,
	计算前进探索消耗饥饿?: 计算钩子类型,
	计算偷钱成功率?: 计算钩子类型,
	计算赌博成功率?: 计算钩子类型,
	计算暴躁概率?: 计算钩子类型,
	计算转运概率?: 计算钩子类型,
	计算复活机会?: 计算钩子类型,
	计算恢复量?: 计算钩子类型,
	计算格挡率?: 计算钩子类型,
	计算暴击率?: 计算钩子类型,
	计算投资开门概率?: 计算钩子类型,
	计算投资挽回次数?: 计算钩子类型,
	计算藏品掉落概率?: 计算钩子类型,
	计算藏品生效数量?: 计算钩子类型,
	计算网吧胜率上限?: 计算钩子类型,
	计算网吧游戏时长上限?: 计算钩子类型,
	计算网吧开门概率?: 计算钩子类型,
	计算竞技场出场费?: 计算钩子类型,

	计算天赋等级?: 等级计算钩子类型,
	计算技能等级?: 等级计算钩子类型,
	计算特质等级?: 等级计算钩子类型,
	计算套餐等级?: 等级计算钩子类型,
}

// 使用发布订阅模式 绑定游戏中关键时机
export let 钩子函数对象: Record<string, Function[]> = {};

export function 注册钩子(时机: string, 函数: Function) {
	if (!钩子函数对象[时机]) {
		钩子函数对象[时机] = [];
	}
	const 目标数组 = 钩子函数对象[时机];

	if (目标数组.includes(函数)) {
		warn(`执行钩子[${时机}]已注册`);
		return () => { };
	}

	目标数组.push(函数);
	const 函数索引 = 目标数组.length - 1;
	const 消除函数 = () => {
		if (!钩子函数对象[时机] || !目标数组.length) return;
		if (函数索引 < 0 || 函数索引 >= 目标数组.length) return;
		if (目标数组[函数索引] !== 函数) return;
		目标数组.splice(函数索引, 1);
		if (目标数组.length === 0) {
			delete 钩子函数对象[时机];
		}
	};

	return 消除函数;
}

export function 执行钩子(时机: string, 参数列表: any[] = []) {
	const 结果: any[] = [];
	const 钩子数组 = 钩子函数对象[时机];

	if (钩子数组 && 钩子数组.length > 0) {
		钩子数组.forEach((钩子函数, 索引) => {
			try {
				const 执行结果 = 钩子函数(...参数列表);
				if (执行结果 !== undefined) {
					结果.push(执行结果);
				}
			} catch (e) {
				error(`执行钩子[${时机}]第${索引 + 1}个函数出错:`, e);
				warn(钩子函数)
			}
		});
	}
	return 结果;
}
