import { _decorator, Color, Component, Node, Button, director, Label } from 'cc';
import { 创建普通文字, 播放文本 } from '../方法函数/动画效果';
import { 默认特质表 } from '../默认内容/特质表';
import { 默认天赋表 } from '../默认内容/天赋表';
import { 默认藏品表 } from '../默认内容/藏品表';
import { 默认技能表 } from '../默认内容/技能表';
import { 计算天赋等级, 计算技能等级, 计算特质等级 } from '../方法函数/等级计算';
import { 玩家 } from '../管理器/玩家管理器';
import { 计算数值 } from '../方法函数/属性计算';
import { 保存设置, 设置 } from '../管理器/设置管理器';
const { ccclass, property } = _decorator;

@ccclass('图鉴')
export class 图鉴 extends Component {
  @property(Node) 分类节点: Node = null;
  @property(Node) 内容: Node = null;
  @property(Node) 标签: Node = null;
  @property(Node) 返回按钮: Node = null;

  当前分类 = '天赋';
  分类列表 = ['天赋', '特质', '技能', '藏品'];

  start() {
    this.返回按钮.on(
      Button.EventType.CLICK,
      () => {
        director.loadScene('成就');
      },
      this,
    );

    this.初始化分类标签();
    this.刷新内容列表();
  }

  初始化分类标签() {
    this.分类列表.forEach((分类名) => {
      const 标签节点 = this.分类节点.getChildByName(分类名);
      if (标签节点) {
        标签节点.on(
          Node.EventType.TOUCH_END,
          () => {
            if (this.当前分类 !== 分类名) {
              this.当前分类 = 分类名;
              this.刷新内容列表();
              this.更新分类标签状态();
            }
          },
          this,
        );
      } else {
      }
    });
    this.更新分类标签状态();
  }

  更新分类标签状态() {
    this.分类列表.forEach((分类名) => {
      const 标签节点 = this.分类节点.getChildByName(分类名);
      if (标签节点) {
        标签节点.getComponent(Label).color = 分类名 === this.当前分类 ? Color.WHITE : Color.GRAY;
      }
    });
  }

  刷新内容列表() {
    switch (this.当前分类) {
      case '天赋':
        this.渲染天赋列表();
        break;
      case '特质':
        this.渲染特质列表();
        break;
      case '技能':
        this.渲染技能列表();
        break;
      case '藏品':
        this.渲染藏品列表();
        break;
    }
  }

  渲染天赋列表() {
    this.内容.removeAllChildren();
    const 基础天赋点 = 10;
    const 额外天赋点 = 3;
    const 锁定上限 = 3;

    const 占用普通难度天赋点 = 设置.锁定天赋.reduce((sum, name) => {
      const 天赋 = 默认天赋表.find((t) => t.名称 === name);
      if (天赋) {
        const 花费 = 天赋.负面
          ? 1
          : 天赋.品质 === '普通'
            ? 1
            : 天赋.品质 === '稀有'
              ? 2
              : 天赋.品质 === '史诗'
                ? 3
                : 天赋.品质 === '传说'
                  ? 4
                  : 1;
        return sum + 花费;
      }
      return sum;
    }, 0);
    const 占用试炼难度天赋点 = 设置.锁定天赋.reduce((sum, name) => {
      const 天赋 = 默认天赋表.find((t) => t.名称 === name);
      if (天赋) {
        const 花费 = 天赋.负面
          ? 2
          : 天赋.品质 === '普通'
            ? 2
            : 天赋.品质 === '稀有'
              ? 3
              : 天赋.品质 === '史诗'
                ? 4
                : 天赋.品质 === '传说'
                  ? 5
                  : 1;
        return sum + 花费;
      }
      return sum;
    }, 0);
    const 占用真实难度天赋点 = 设置.锁定天赋.reduce((sum, name) => {
      const 天赋 = 默认天赋表.find((t) => t.名称 === name);
      if (天赋) {
        const 花费 = 天赋.负面
          ? 3
          : 天赋.品质 === '普通'
            ? 3
            : 天赋.品质 === '稀有'
              ? 4
              : 天赋.品质 === '史诗'
                ? 5
                : 天赋.品质 === '传说'
                  ? 6
                  : 1;
        return sum + 花费;
      }
      return sum;
    }, 0);
    const 占用残酷难度天赋点 = 设置.锁定天赋.reduce((sum, name) => {
      const 天赋 = 默认天赋表.find((t) => t.名称 === name);
      if (天赋) {
        const 花费 = 天赋.负面
          ? 4
          : 天赋.品质 === '普通'
            ? 4
            : 天赋.品质 === '稀有'
              ? 5
              : 天赋.品质 === '史诗'
                ? 6
                : 天赋.品质 === '传说'
                  ? 7
                  : 1;
        return sum + 花费;
      }
      return sum;
    }, 0);
    const 占用绝境难度天赋点 = 设置.锁定天赋.reduce((sum, name) => {
      const 天赋 = 默认天赋表.find((t) => t.名称 === name);
      if (天赋) {
        const 花费 = 天赋.负面
          ? 5
          : 天赋.品质 === '普通'
            ? 5
            : 天赋.品质 === '稀有'
              ? 6
              : 天赋.品质 === '史诗'
                ? 7
                : 天赋.品质 === '传说'
                  ? 8
                  : 1;
        return sum + 花费;
      }
      return sum;
    }, 0);

    let 当前锁定天赋名称 = '';
    设置.锁定天赋.forEach((name) => {
      const 天赋 = 默认天赋表.find((t) => t.名称 === name);
      if (天赋) {
        let title = '';
        if (天赋.隐藏) {
          title += '隐藏·';
        }
        title += 天赋.品质;

        当前锁定天赋名称 += `【${天赋.名称}(${title})】，`;
      }
    });
    创建普通文字(
      this.内容,
      `======天赋自选说明======
1.当前有${基础天赋点}个基础天赋点，${额外天赋点}个额外天赋点
9.你当前已选择天赋：
${当前锁定天赋名称 || '无'}（${设置.锁定天赋.length}/${锁定上限}）
10.普通难度：占用${占用普通难度天赋点}点天赋点，还剩${基础天赋点 + 额外天赋点 - 占用普通难度天赋点}点天赋点可用，${基础天赋点 + 额外天赋点 - 占用普通难度天赋点 > 0 ? '可以' : '不可'}进入游戏
11.试炼难度：占用${占用试炼难度天赋点}点天赋点，还剩${基础天赋点 + 额外天赋点 - 占用试炼难度天赋点}点天赋点可用，${基础天赋点 + 额外天赋点 - 占用试炼难度天赋点 > 0 ? '可以' : '不可'}进入游戏
12.真实难度：占用${占用真实难度天赋点}点天赋点，还剩${基础天赋点 + 额外天赋点 - 占用真实难度天赋点}点天赋点可用，${基础天赋点 + 额外天赋点 - 占用真实难度天赋点 > 0 ? '可以' : '不可'}进入游戏
13.残酷难度：占用${占用残酷难度天赋点}点天赋点，还剩${基础天赋点 + 额外天赋点 - 占用残酷难度天赋点}点天赋点可用，${基础天赋点 + 额外天赋点 - 占用残酷难度天赋点 > 0 ? '可以' : '不可'}进入游戏
14.绝境难度：占用${占用绝境难度天赋点}点天赋点，还剩${基础天赋点 + 额外天赋点 - 占用绝境难度天赋点}点天赋点可用，${基础天赋点 + 额外天赋点 - 占用绝境难度天赋点 > 0 ? '可以' : '不可'}进入游戏
==================`,
      Color.GRAY,
    );

    创建普通文字(this.内容, `点击清空选中的天赋`, Color.GRAY, () => {
      设置.锁定天赋 = [];
      保存设置();
      this.渲染天赋列表();
    });

    默认天赋表.forEach((天赋) => {
      const 等级 = 计算天赋等级(天赋.名称, 天赋.隐藏 ? 0 : 1);
      const 已锁定 = 设置.锁定天赋.includes(天赋.名称);
      if (!天赋.隐藏 || (天赋.隐藏 && 等级 > 0)) {
        let title = '';
        if (天赋.隐藏) {
          title += '隐藏·';
        }
        title += 天赋.品质;
        创建普通文字(
          this.内容,
          `【${天赋.名称}(${title})】${已锁定 ? '【已锁定】' : ''}\n${天赋.说明}`,
          等级 > 0 ? 天赋.颜色 : null,
          () => {
            if (等级 == 0) return;
            if (!设置.锁定天赋.includes(天赋.名称)) {
              if (设置.锁定天赋.length + 1 > 锁定上限) return;

              设置.锁定天赋.push(天赋.名称);
            } else {
              设置.锁定天赋 = 设置.锁定天赋.filter((i) => i !== 天赋.名称);
            }
            保存设置();
            this.渲染天赋列表();
          },
          [
            {
              匹配: '【已锁定】',
              颜色: Color.GREEN,
            },
          ],
        );
      }
    });

    创建普通文字(
      this.内容,
      `======天赋自选说明======
1.天赋花费点数：负面1，普通1，稀有2，史诗3，传说4
2.不同难度每个天赋额外花费：试炼1，真实2，残酷3，绝境4
3.新建游戏所选的难度对应的天赋点数不能超过当前所有的天赋点数
4.每次进入游戏不消耗基础天赋点，所选天赋占用点数超出基础天赋点的部分会消耗额外天赋点
5.通过完成成就等途径可以获得基础天赋点数
6.通过通关游戏可以获得累计的额外天赋点数
==================`,
      Color.GRAY,
    );
  }

  渲染特质列表() {
    this.内容.removeAllChildren();
    const 开局特质数量 = 计算数值('开局特质数量', 1);
    创建普通文字(
      this.内容,
      `点击可以选择下局生效的特质(你已选择${设置.生效特质.length}/${开局特质数量})`,
    );
    默认特质表.forEach((特质) => {
      const 等级 = 计算特质等级(特质.名称);
      const 已选择 = 设置.生效特质.includes(特质.名称);
      创建普通文字(
        this.内容,
        `【${特质.名称}】LV${等级}${已选择 ? '【已选择】' : ''}\n${特质.说明}`,
        等级 > 0 ? Color.YELLOW : null,
        () => {
          if (等级 == 0) return;
          if (!设置.生效特质.includes(特质.名称)) {
            const 开局特质数量 = 计算数值('开局特质数量', 1);
            if (设置.生效特质.length + 1 > 开局特质数量) return;

            设置.生效特质.push(特质.名称);
            // 播放文本(this.标签, `已选择【${特质.名称}】将再下局游戏生效！`);
          } else {
            设置.生效特质 = 设置.生效特质.filter((i) => i !== 特质.名称);
            // 播放文本(this.标签, `已取消选择【${特质.名称}】将再下局游戏生效！`);
          }
          保存设置();
          this.渲染特质列表();
        },
        [
          {
            匹配: '【已选择】',
            颜色: Color.GREEN,
          },
        ],
      );
    });
  }

  渲染技能列表() {
    this.内容.removeAllChildren();
    默认技能表.forEach((技能) => {
      const 等级 = 计算技能等级(技能.名称);
      创建普通文字(
        this.内容,
        `【${技能.名称}】LV${等级}\n${技能.描述}`,
        等级 > 0 ? Color.BLUE : null,
      );
    });
  }

  渲染藏品列表() {
    this.内容.removeAllChildren();
    默认藏品表.forEach((藏品) => {
      const 数量 = 玩家.client_info?.collections?.[藏品.名称] || 0;
      创建普通文字(
        this.内容,
        `【${藏品.名称}】已拥有${数量}\n${藏品.描述}`,
        数量 > 0 ? Color.GREEN : null,
      );
    });
  }
}
