import { 存档 } from "../管理器/存档管理器";
import { 计算容器, 计算数值, 计算最大生命, 计算最大防御 } from "../方法函数/属性计算";
import { 抽取物品 } from "../方法函数/公共函数";
import { 对局类型 } from "../场景脚本/战斗";

type 制作定义类型 = {
	名称: string,
	显示名称?: string | (() => string);
	描述: string | (() => string);
	说明: string | (() => string);
	条件?: boolean | (() => boolean);
	制作: string | (() => string | void);
	效果?: Record<string, (a: any) => void>;
	显示: boolean | (() => boolean);
}

export const 默认制作表: 制作定义类型[] = [
	{
		名称: "熟肉",
		显示名称: () => `熟肉（已拥有${存档.物品.熟肉})`,
		描述: () => `※需【生肉】${存档.物品.生肉}/1【木材】${存档.物品.木材}/1`,
		说明: () => `※获得【熟肉】（已拥有${存档.物品.熟肉}）`,
		条件: () => 存档.物品.生肉 >= 1 && 存档.物品.木材 >= 1,
		制作: () => {
			if (存档.物品.生肉 < 1 || 存档.物品.木材 < 1) {
				return "材料不足！";
			}
			存档.物品.生肉 -= 1;
			存档.物品.木材 -= 1;
			存档.物品.熟肉 += 1;
			return "获得【熟肉】*1";
		},
		显示: true
	},
	{
		名称: "伤药",
		显示名称: () => `伤药（已拥有${存档.物品.伤药})`,
		描述: () => `※需【艾草】${存档.物品.艾草}/2`,
		说明: () => `※获得【伤药】（拥有${存档.物品.伤药}）`,
		条件: () => 存档.物品.艾草 >= 2,
		制作: () => {
			if (存档.物品.艾草 < 2) {
				return "材料不足！";
			}
			存档.物品.艾草 -= 2;
			存档.物品.伤药 += 1;
			return "获得【伤药】*1";
		},
		显示: true
	},
	{
		名称: "帐篷",
		显示名称: () => `帐篷（LV${存档.物品.帐篷}`,
		描述: () => `※需【木材】${存档.物品.木材}/${1 + 存档.物品.帐篷}【亚麻】${存档.物品.亚麻}/${4 + 2 * 存档.物品.帐篷}`,
		说明: () => `※精力上限增加${10 * 存档.物品.帐篷}点`,
		条件: () => 存档.物品.木材 >= 1 + 存档.物品.帐篷 && 存档.物品.亚麻 >= 4 + 2 * 存档.物品.帐篷,
		制作: () => {
			const 木材数量 = 1 + 存档.物品.帐篷;
			const 亚麻数量 = 4 + 2 * 存档.物品.帐篷;
			if (存档.物品.木材 < 木材数量 || 存档.物品.亚麻 < 亚麻数量) {
				return "材料不足！";
			}
			存档.物品.木材 -= 木材数量;
			存档.物品.亚麻 -= 亚麻数量;
			存档.物品.帐篷 += 1;
			return "精力上限+10！";
		},
		效果: {
			计算最大精力: (计算容器) => {
				计算容器.固定加成 += 10 * 存档.物品.帐篷
			}
		},
		显示: true
	},
	{
		名称: "木棍",
		显示名称: () => `木棍（LV${存档.物品.木棍}`,
		描述: () => `※需【木材】${存档.物品.木材}/${4 + 2 * 存档.物品.木棍}`,
		说明: () => `※增加${10 * 存档.物品.木棍}点攻击。【暴击】${2 * 存档.物品.木棍}%几率触发暴击`,
		条件: () => 存档.物品.木材 >= 4 + 2 * 存档.物品.木棍,
		制作: () => {
			const 木材数量 = 4 + 2 * 存档.物品.木棍;
			if (存档.物品.木材 < 木材数量) {
				return "材料不足！";
			}
			存档.物品.木材 -= 木材数量;
			存档.物品.木棍 += 1;
			return "攻击+10！暴击率+2！";
		},
		效果: {
			计算最大攻击: (计算容器: 计算容器) => {
				计算容器.固定加成 += 10 * 存档.物品.木棍
			},
			计算暴击率: (计算容器: 计算容器) =>{
				计算容器.固定加成 += 2 * 存档.物品.木棍
			},

			战斗初始化: (对局: 对局类型) => {
				对局.其他.必定暴击 = false
			},
			// 暴击
			攻击前: (对局: 对局类型) => {
				if(对局.主角回合){
					const 暴击率 = 计算数值("暴击率", 0)
					if (Math.random() * 100 < 暴击率 || 对局.其他.必定暴击) {
						对局.其他.必定暴击 = false
						const 暴击强度 = 计算数值("暴击率", 1.3)
	
						对局.伤害.独立乘区 *= 暴击强度
						对局.结果文本.push(`【「暴击」伤害增加${(暴击强度 * 100).toFixed(1)}%！（${暴击率.toFixed(1)}%触发）】`)
					}
				}
			},
		},
		显示: true
	},
	{
		名称: "麻布衣",
		显示名称: () => `麻布衣（LV${存档.物品.麻布衣}`,
		描述: () => `※需【亚麻】${存档.物品.亚麻}/${4 + 2 * 存档.物品.麻布衣}`,
		说明: () => `※增加${50 * 存档.物品.麻布衣}点生命上限。${Math.min(2 * 存档.物品.麻布衣, 60)}%几率触发【格挡】`,
		条件: () => 存档.物品.亚麻 >= 4 + 2 * 存档.物品.麻布衣,
		制作: () => {
			const c = 4 + 2 * 存档.物品.麻布衣;
			if (存档.物品.亚麻 < c) {
				return "材料不足！";
			}
			存档.物品.亚麻 -= c;
			存档.物品.麻布衣 += 1;
			return "生命上限+50！";
		},
		效果: {
			计算最大生命: (计算容器) => {
				计算容器.固定加成 += 50 * 存档.物品.麻布衣
			},
			计算格挡率: (计算容器) => {
				计算容器.固定加成 = Math.min(2 * 存档.物品.麻布衣, 60)
			},
			// 格挡
			攻击时: (对局: 对局类型) => {
				if(对局.敌人回合){
					const 格挡率 = 计算数值("格挡率", 0)
					if (Math.random() * 100 < 格挡率) {
						对局.伤害.计算结果 = 0
						对局.结果文本.push(`【「格挡」触发（${格挡率.toFixed(1)}%触发）】`)
					}
				}
			},
		},
		显示: true
	},
	{
		名称: "驱蚊工具",
		显示名称: () => `驱蚊工具（LV${存档.物品.驱蚊工具}`,
		描述: () => `※需【艾草】${存档.物品.艾草}/${8 + 2 * 存档.物品.驱蚊工具}`,
		说明: () => `※睡觉时恢复${30 * 存档.物品.驱蚊工具}点生命值`,
		条件: () => 存档.物品.艾草 >= 8 + 2 * 存档.物品.驱蚊工具,
		制作: () => {
			const c = 8 + 2 * 存档.物品.驱蚊工具;
			if (存档.物品.艾草 < c) {
				return "材料不足！";
			}
			存档.物品.艾草 -= c;
			存档.物品.驱蚊工具 += 1;
			return "讨厌的蚊子减少啦~";
		},
		效果: {
			计算睡觉回复生命: (计算容器: 计算容器) => {
				计算容器.固定加成 += 30 * 存档.物品.驱蚊工具
			}
		},
		显示: true
	},
	{
		名称: "陷阱",
		显示名称: () => `陷阱（LV${存档.物品.陷阱}`,
		描述: () => `※需【木材】${存档.物品.木材}/${4 + 2 * 存档.物品.陷阱}`,
		说明: "※每天30%几率随机获得一种素材，升级提升获得数量",
		条件: () => 存档.物品.木材 >= 4 + 2 * 存档.物品.陷阱,
		制作: () => {
			const c = 4 + 2 * 存档.物品.陷阱;
			if (存档.物品.木材 < c) {
				return "材料不足！";
			}
			存档.物品.木材 -= c;
			存档.物品.陷阱 += 1;
			return "升级成功！";
		},
		效果: {
			睡觉结算: (结果文本) => {
				if (存档.物品.陷阱 > 0) {
					const items1 = ["果子", "木材", "生肉", "亚麻", "艾草"]
					const items2 = ["易拉罐", "50ml啤酒", "烟头", "熟肉", "伤药"]
					const items3 = ["黑曜石", "火狐皮", "晓月手链", "滑稽裤", "护身符"]
					const items4 = ["香烟", "木棍", "啤酒", "麻布衣", "驱蚊工具"]
					const items5 = ["匕首", "皮衣", "板砖", "小裤裤", "女装", "幸运石", "放大镜"]
					const items6 = ["黑刀", "红夹克", "白色粉末", "晓风披肩"]

					// 每五级一个层次
					const 陷阱 = 存档.物品.陷阱;
					let result = '【陷阱】获得'
					if (陷阱 >= 1 && Math.random() * 100 < 30) {
						const num = Math.max(1, 陷阱)
						const item = items1[Math.floor(Math.random() * items1.length)]
						存档.物品[item] += num
						result += `「${item}」*${num}`
					}
					if (陷阱 >= 5 && Math.random() * 100 < 25) {
						const num = Math.max(1, Math.floor(陷阱 / 2))
						const item = items2[Math.floor(Math.random() * items2.length)]
						存档.物品[item] += num
						result += `「${item}」*${num}`
					}
					if (陷阱 >= 10 && Math.random() * 100 < 20) {
						const num = Math.max(1, Math.floor(陷阱 / 4))
						const item = items3[Math.floor(Math.random() * items3.length)]
						存档.物品[item] += num
						result += `「${item}」*${num}`
					}
					if (陷阱 >= 15 && Math.random() * 100 < 15) {
						const num = Math.max(1, Math.floor(陷阱 / 8))
						const item = items4[Math.floor(Math.random() * items4.length)]
						存档.物品[item] += num
						result += `「${item}」*${num}`
					}
					if (陷阱 >= 20 && Math.random() * 100 < 10) {
						const num = Math.max(1, Math.floor(陷阱 / 16))
						const item = items5[Math.floor(Math.random() * items5.length)]
						存档.物品[item] += num
						result += `「${item}」*${num}`
					}
					if (陷阱 >= 25 && Math.random() * 100 < 5) {
						const num = Math.max(1, Math.floor(陷阱 / 32))
						const item = items6[Math.floor(Math.random() * items6.length)]
						存档.物品[item] += num
						result += `「${item}」*${num}`
					}
					if (result !== "【陷阱】获得") {
						结果文本.push(result)
					}
				}
			}
		},
		显示: true
	},
	{
		名称: "香烟",
		显示名称: () => `香烟（已拥有${存档.物品.香烟})`,
		描述: () => `※需【烟草】${存档.物品.烟草}/4 或者【烟头】${存档.物品.烟头}/8`,
		说明: "※获得【香烟】。游戏中重要的“软货币”，也可自己使用",
		条件: () => 存档.物品.烟草 >= 4 || 存档.物品.烟头 >= 8,
		制作: () => {
			const c = 存档.物品.烟草;
			const o = 存档.物品.烟头;
			if (c < 4 && o < 8) {
				return "材料不足！";
			}
			if (c >= 4) {
				存档.物品.烟草 -= 4;
			} else if (o >= 8) {
				存档.物品.烟头 -= 8;
			}
			存档.物品.香烟 += 1;
			return "获得【香烟】*1！";
		},
		效果: {
			睡觉结算: (结果文本) => {
				if (Math.random() * 100 < 存档.烟瘾率) {
					存档.其他.烟瘾触发次数 += 1;
					存档.状态.烟瘾 = true
					结果文本.push('【烟瘾】发作！')
				} else {
					存档.状态.烟瘾 = false
				}
			}
		},
		显示: true
	},
	{
		名称: "啤酒",
		显示名称: () => `香烟（已拥有${存档.物品.啤酒})`,
		描述: () => `※需【50ml啤酒】${存档.物品["50ml啤酒"]}/5`,
		说明: "※获得一罐【啤酒】！",
		条件: () => 存档.物品["50ml啤酒"] >= 5,
		制作: () => {
			if (存档.物品["50ml啤酒"] < 5) {
				return "材料不足！";
			}
			存档.物品["50ml啤酒"] -= 5;
			存档.物品.啤酒 += 1;
			return "获得【啤酒】*1！";
		},
		显示: true
	},
	{
		名称: "匕首",
		显示名称: () => `匕首（LV${存档.物品.匕首}`,
		描述: () => `※可通过购买，或者打怪掉落提高等级。可使用${存档.经验}/${((存档.物品.匕首 + 1) * 100)}经验升级`,
		条件: () => 存档.经验 >= (存档.物品.匕首 + 1) * 100,
		说明: () => `※增加${20 * 存档.物品.匕首}点攻击。【嗜血】攻击时，${2 * 存档.物品.匕首}%概率恢复伤害21%的生命`,
		制作: () => {
			const 经验 = (存档.物品.匕首 + 1) * 100
			if (存档.经验 < 经验) {
				return "经验不足！"
			}
			存档.经验 -= 经验
			存档.物品.匕首++
			return `匕首升级成功！消耗${经验}经验！`
		},
		效果: {
			计算最大攻击: (计算容器) => {
				计算容器.固定加成 += 20 * 存档.物品.匕首
			},
			计算嗜血率: (计算容器) => {
				计算容器.固定加成 += 2 * 存档.物品.匕首
			},
			// 嗜血
			攻击时: (对局: 对局类型) => {
				if(对局.主角回合){
					const 嗜血率 = 计算数值("嗜血率")
					if (Math.random() * 100 < 嗜血率) {
						const 嗜血强度 = 计算数值("嗜血强度", 0.21)

						const 回复量 = Math.floor(对局.伤害.计算结果 * 嗜血强度);
						存档.生命 += 回复量
						对局.结果文本.push(`【「嗜血」恢复${回复量}点生命（${嗜血率.toFixed(1)}%触发）】`)
					}
				}
			}
		},
		显示: true
	},
	{
		名称: "皮衣",
		显示名称: () => `皮衣（LV${存档.物品.皮衣}`,
		描述: () => `※可通过购买，或者打怪掉落提高等级。可使用${存档.经验}/${((存档.物品.皮衣 + 1) * 100)}经验升级`,
		条件: () => 存档.经验 >= (存档.物品.皮衣 + 1) * 100,
		说明: () => `※增加${10 * 存档.物品.皮衣}点防御。【反弹】受击时，${2 * 存档.物品.皮衣}%几率减免「100%*自身防御」点伤害，并且将伤害反弹给对方`,
		制作: () => {
			const 经验 = (存档.物品.皮衣 + 1) * 100
			if (存档.经验 < 经验) {
				return "经验不足！"
			}
			存档.经验 -= 经验
			存档.物品.皮衣++
			return `皮衣升级成功！消耗${经验}经验！`
		},
		效果: {
			计算最大防御: (计算容器) => {
				计算容器.固定加成 += 10 * 存档.物品.皮衣
			},
			计算反弹率: (计算容器) => {
				计算容器.固定加成 += 2 *  存档.物品.皮衣
			},
			// 反弹率
			攻击后 : (对局: 对局类型) => {
				if(对局.敌人回合){
					const 反弹率 = 计算数值("反弹率")
					if (Math.random() * 100 < 反弹率) {
						const 反弹强度 = 计算数值("反弹强度", 1)
						const 反弹伤害 = Math.max(计算最大防御() * 反弹强度, 0);
	
						对局.伤害.计算结果 -= 反弹伤害;
						if (对局.伤害.计算结果 < 0) {
							对局.伤害.计算结果 = 0;
						}
	
						对局.受击方.生命 -= 反弹伤害;
						对局.结果文本.push(`【「反弹」${反弹伤害}点伤害反弹给${对局.受击方.名称}（${反弹率.toFixed(1)}%触发）】`)
					}
				}
			}
		},
		显示: true
	},
	{
		名称: "黑刀",
		显示名称: () => `黑刀（LV${存档.物品.黑刀}`,
		描述: () => `※需【黑曜石】${存档.物品.黑曜石}/${10 + 2 * 存档.物品.黑刀}`,
		说明: () => `※增加${30 * 存档.物品.黑刀}点攻击。【割裂】每次攻击伤害提高${4 * 存档.物品.黑刀}%，最多叠加20次`,
		条件: () => 存档.物品.黑曜石 >= 10 + 2 * 存档.物品.黑刀,
		制作: () => {
			const c = 10 + 2 * 存档.物品.黑刀;
			if (存档.物品.黑曜石 < c) {
				return "材料不足！";
			}
			存档.物品.黑曜石 -= c;
			存档.物品.黑刀 += 1;
			return "获得【黑刀】*1！";
		},
		效果: {
			计算最大攻击: (计算容器) => {
				计算容器.固定加成 += 20 * 存档.物品.黑刀
			},
			计算割裂强度: (计算容器) => {
				计算容器.固定加成 += (4 * 存档.物品.黑刀) / 100
			},

			// 割裂
			攻击时: (对局: 对局类型) => {
				if(对局.主角回合){
					const 割裂最大层数 = 计算数值("割裂最大层数")

					if (!对局.其他.黑刀触发次数) {
						对局.其他.黑刀触发次数 = 0
					}
					对局.其他.黑刀触发次数++
					if (对局.其他.黑刀触发次数 > 割裂最大层数) {
						对局.其他.黑刀触发次数 = 割裂最大层数
					}

					对局.方法 = "割裂";
					const 割裂强度 = 计算数值("割裂强度")
					const 伤害加成 = Math.floor(割裂强度 * 对局.其他.黑刀触发次数);
					对局.伤害.加法乘率 += 伤害加成
					对局.结果文本.push(`【「割裂」伤害加成${(伤害加成 * 100).toFixed(1)}%（${对局.其他.黑刀触发次数}层黑刀）】`)
				}
			}
		},
		显示: true
	},
	{
		名称: "红夹克",
		显示名称: () => `红夹克（LV${存档.物品.红夹克}`,
		描述: () => `※需【火狐皮】${存档.物品.火狐皮}/${10 + 2 * 存档.物品.红夹克}`,
		说明: () => `※增加${150 * 存档.物品.红夹克}点生命上限，${15 * 存档.物品.红夹克}点防御。【火狐之灵】受击时，${2 * 存档.物品.红夹克}%概率提高20%防御（最多叠加20次），并且恢复自身5%的生命`,
		条件: () => 存档.物品.火狐皮 >= 10 + 2 * 存档.物品.红夹克,
		制作: () => {
			const c = 10 + 2 * 存档.物品.红夹克;
			if (存档.物品.火狐皮 < c) {
				return "材料不足！";
			}
			存档.物品.火狐皮 -= c;
			存档.物品.红夹克 += 1;
			return "获得【红夹克】*1！";
		},
		效果: {
			计算最大生命: (计算容器) => {
				计算容器.固定加成 += 150 * 存档.物品.红夹克
			},
			计算最大防御: (计算容器) => {
				计算容器.固定加成 += 15 * 存档.物品.红夹克
			},
			计算火狐之灵率: (计算容器) => {
				计算容器.固定加成 += 2 * 存档.物品.红夹克
			},

			// 火狐之灵
			攻击后: (对局: 对局类型) => {
				if(对局.敌人回合){
					const 火狐之灵率 = 计算数值("火狐之灵率")
					const 火狐之灵恢复率 = 计算数值("火狐之灵恢复率", 0.05)
					const 火狐之灵防御提高率 = 计算数值("火狐之灵防御提高率", 0.2)

					if (Math.random() * 100 < 火狐之灵率) {
						const 火狐之灵最大层数 = 计算数值("火狐之灵最大层数", 20)
						if (!对局.其他.红夹克使用次数) {
							对局.其他.红夹克使用次数 = 0
						}
						对局.其他.红夹克使用次数++
						if (对局.其他.红夹克使用次数 > 火狐之灵最大层数) {
							对局.其他.红夹克使用次数 = 火狐之灵最大层数
						}
						const 生命恢复 = Math.floor(计算最大生命() * 火狐之灵恢复率);
						存档.生命 += 生命恢复;
	
						const 防御加成率 = 对局.受击方.防御 * 火狐之灵防御提高率 * 对局.其他.红夹克使用次数
						对局.受击方.防御 +=  Math.floor(对局.受击方.防御 * 防御加成率)
	
						对局.结果文本.push(`【「火狐之灵」生命恢复${生命恢复}，防御加成${防御加成率.toFixed(1)}（${火狐之灵率}%触发）】`)
					}
				}
			}
		},
		显示: true
	},

	{
		名称: "┑(=^ω^=)┑",
		显示名称: () => `┑(=^ω^=)┑（LV${存档.物品["┑(=^ω^=)┑"]}`,
		描述: "※获得方法未知",
		说明: "※每天自动获得「0.1*LV」元",
		制作: "喵~",
		效果: {
			睡觉结算: (结果文本) => {
				if (存档.物品["┑(=^ω^=)┑"] > 0) {
					存档.金钱 += 存档.物品["┑(=^ω^=)┑"]
					结果文本.push(`【┑(=^ω^=)┑】获得${(存档.物品["┑(=^ω^=)┑"] / 10).toFixed(1)}元`)
				}
			}
		},
		显示: () => 存档.物品["┑(=^ω^=)┑"] > 0,
	},
	{
		名称: "幸运石",
		显示名称: () => `幸运石（LV${存档.物品.幸运石}`,
		描述: "※收集类道具",
		说明: () => `※增加${存档.物品.幸运石}%的额外掉落奖励`,
		制作: "666",
		效果: {
			战斗胜利: ({ 物品表, 结果文本 }) => {
				if (Math.random() * 100 < 存档.物品.幸运石) {
					const 掉落物 = 抽取物品(物品表.掉落物, true);
					结果文本.push(`【幸运石：${掉落物}】`);
				}
			}
		},
		显示: () => 存档.物品.幸运石 > 0,
	},
	{
		名称: "晓月手链",
		显示名称: () => `晓月手链（LV${存档.物品.晓月手链}`,
		描述: "※收集类道具",
		说明: () => `※如果前进/探索时未发现道具，则有${5 * 存档.物品.晓月手链}%概率（LV*5%）再一次获得奖励`,
		制作: "晓月手链触发时，必定获得奖励，且可以与「非酋逆袭」特性同时触发",
		效果: {
			收集材料: ({ 物品表, 结果文本 }) => {
				if (结果文本[0] === '什么也没发现！') {
					if (Math.random() * 100 < 5 * 存档.物品.晓月手链) {
						let 掉落物 = 抽取物品(物品表, true);
						结果文本.push(`【晓月手链：发现${掉落物}】`)
					}
				}
			}
		},
		显示: () => 存档.物品.晓月手链 > 0,
	},
	{
		名称: "晓风披肩",
		显示名称: () => `晓风披肩（LV${存档.物品.晓风披肩}`,
		描述: "※用于增加自信。",
		说明: "※每级增加1%全战斗属性（攻防血）。【帅呆】每级减少敌方2%防御！【拉风】每级减少敌方5%逃跑率！",
		制作: "听说穿上这件披肩的人，最后都被打死了...",
		效果: {
			计算最大攻击: (计算容器) => {
				计算容器.百分比加成 += 存档.物品.晓风披肩 / 100
			},
			计算最大生命: (计算容器) => {
				计算容器.百分比加成 += 存档.物品.晓风披肩 / 100
			},
			计算最大防御: (计算容器) => {
				计算容器.百分比加成 += 存档.物品.晓风披肩 / 100
			},
			计算帅呆率: (计算容器) => {
				计算容器.百分比加成 += 2 * 存档.物品.晓风披肩 / 100
			},
			计算拉风率: (计算容器) => {
				计算容器.百分比加成 += 5 * 存档.物品.晓风披肩 / 100
			},

			// 拉风
			战斗初始化: (对局: 对局类型) => {
				const 帅呆率 = 计算数值("帅呆率")
				if(帅呆率){
					对局.受击方.防御 -= Math.floor(对局.受击方.防御 * 帅呆率)
				}

				const 拉风率 = 计算数值("拉风率")
				if(拉风率){
					对局.受击方.逃跑 -= Math.floor(对局.受击方.逃跑 * 拉风率)
				}
			}
		},
		显示: () => 存档.物品.晓风披肩 > 0,
	},
	{
		名称: "放大镜",
		显示名称: () => `放大镜（LV${存档.物品.放大镜}`,
		描述: "※收集类道具",
		说明: () => `※前进/探索时，${存档.物品.放大镜}%几率额外获得一次奖励！`,
		制作: "(O_o)",
		效果: {
			收集材料: ({ 物品表, 结果文本 }) => {
				if (Math.random() * 100 < 存档.物品.放大镜) {
					let 掉落物 = 抽取物品(物品表, true);
					结果文本.push(`【放大镜：${掉落物}】`)
				}
			}
		},
		显示: () => 存档.物品.放大镜 > 0,
	},
	{
		名称: "装避鞋",
		显示名称: () => `装避鞋（LV${存档.物品.装避鞋}`,
		描述: "※收集类道具",
		说明: `※逃跑技术增加速度+1！（你目前逃跑技术为${存档.逃跑}）`,
		制作: "装了比就跑，真特么刺激",
		效果: {
			逃跑成功: (对局: 对局类型) => {
				存档.逃跑 += 存档.物品.装避鞋 + 1
				对局.结果文本.push(`逃跑技术增加${存档.物品.装避鞋 + 1}, 当前逃跑技术为${存档.逃跑}`)
			}
		},
		显示: () => 存档.物品.装避鞋 > 0,
	},
	{
		名称: "枪",
		显示名称: () => `枪（LV${存档.物品.枪}`,
		描述: () => `※白色粉末（拥有${存档.物品.白色粉末}）兑换，可能会招来麻烦！`,
		说明: `※造成「枪等级+1」倍伤害，每次消耗1颗子弹（已有${存档.物品.子弹}）。点击战斗界面右下角文字可以打开/关闭枪效果！`,
		制作: () => {
			if (存档.物品.枪 <= 0) {
				return "你还没有枪！";
			}
			return "点击战斗界面右下角（逃跑率右边）【开/关】才会生效哦~";
		},
		效果: {
			战斗初始化: (对局) => {
				对局.其他.枪开关 = false
			},
			攻击时: (对局: 对局类型) => {
				if (存档.物品.枪 > 0) {
					const 子弹消耗 = 计算数值("子弹消耗", 1)
					if (对局.其他.枪开关 && 存档.物品.子弹 >= 子弹消耗) {
						对局.方法 = '枪击'
						存档.物品.子弹 -= 子弹消耗
						存档.使用次数.子弹 += 子弹消耗
						对局.伤害.基础加成 *= 存档.物品.枪 + 1
						对局.结果文本.push(`【「枪击」攻击加成${存档.物品.枪 * 100}%，射出${子弹消耗}发子弹！】\n`)
					}
				}
			}
		},
		显示: () => 存档.物品.枪 > 0,
	},
	{
		名称: "板砖",
		显示名称: () => `板砖（LV${存档.物品.板砖}`,
		描述: "※收集类道具",
		说明: "※每级增加5点攻击！",
		制作: "听说集齐21块可以召唤城管哦~",
		效果: {
			计算最大攻击: (计算容器) => {
				计算容器.固定加成 += 5 * 存档.物品.板砖
			},
			睡觉结算: () => {
				if (存档.物品.板砖 >= 21) {
					if (!存档.当前敌人 && Math.random() * 100 < 30) {
						存档.当前敌人 = "城管104小分队"
					}
				}
			}
		},
		显示: () => 存档.物品.板砖 > 0,
	},
	{
		名称: "小裤裤",
		显示名称: () => `小裤裤（LV${存档.物品.小裤裤}`,
		描述: "※收集类道具",
		说明: "※每级增加5点防御！",
		制作: "有股淡淡的清香呢~(ಡωಡ)~",
		效果: {
			计算最大防御: (计算容器) => {
				计算容器.固定加成 += 5 * 存档.物品.小裤裤
			},
		},
		显示: () => 存档.物品.小裤裤 > 0,
	},
	{
		名称: "女装",
		显示名称: () => `女装（LV${存档.物品.女装}`,
		描述: "※收集类道具",
		说明: () => {
			if (存档.物品.女装 < 18) {
				return "※每级增加25点生命！"
			}
			if (!存档.状态.女人) {
				return "※已收集18件女装，点击切换为女人！"
			}
			return "※点击切换回男人！"
		},
		制作: () => {
			if (存档.物品.女装 < 18) {
				return "听说集齐18件可以变成女人哦~"
			}
			if (!存档.状态.女人) {
				存档.状态.女人 = true
				return `成功变身女人！暴击率+20%，防御-10% 闪避 +10%！`;
			}
			存档.状态.女人 = false
			return "已切换为男人。"
		},
		效果: {
			计算最大生命: (计算容器) => {
				计算容器.固定加成 += 25 * 存档.物品.女装
			},

			// 女人
			计算最大防御: (计算容器) => {
				if (存档.状态.女人) {
					计算容器.百分比加成 -= 0.1
				}
			},
			计算暴击率: (计算容器) => {
				if (存档.状态.女人) {
					计算容器.固定加成 += 0.2
				}
			},
			计算格挡率: (计算容器) => {
				if (存档.状态.女人) {
					计算容器.固定加成 += 0.1
				}
			}
		},
		显示: () => 存档.物品.女装 > 0,
	},
	{
		名称: "创可贴",
		显示名称: () => `创可贴（LV${存档.物品.创可贴}`,
		描述: "※收集类道具",
		说明: "※每级提高2点前进/探索时生命回复量！",
		制作: "“老鼠药~蟑螂药~臭脚克星...”",
		效果: {
			计算恢复量: (计算容器) => {
				计算容器.固定加成 += 2 * 存档.物品.创可贴
			},
		},
		显示: () => 存档.物品.创可贴 > 0,
	},
	{
		名称: "滑稽裤",
		显示名称: () => `滑稽裤（LV${存档.物品.滑稽裤}`,
		描述: "※收集类道具",
		说明: "※每级增加2%逃跑几率！",
		制作: () => {
			const e = Math.random() * 100;
			if (e < 30) {
				return "(→_→) (↑_↑) (←_←) (↓_↓)";
			} else if (e < 60) {
				return "(→_→) (←_←)(→_→)(←_←)";
			} else {
				return "(↑_↑) (→_→) (↑_↑) (←_←)";
			}
		},
		效果: {
			计算最大逃跑: (计算容器) => {
				计算容器.固定加成 += 2 * 存档.物品.滑稽裤
			},
		},
		显示: () => 存档.物品.滑稽裤 > 0,
	},
	{
		名称: "护身符",
		显示名称: () => `护身符（LV${存档.物品.护身符}`,
		描述: "※收集类道具",
		说明: () => `※战败后，保留${(Math.floor(1 + 50 * 存档.物品.护身符 + 0.03 * 计算最大生命() * 存档.物品.护身符))}点生命！`,
		制作: "上边似乎画着一个性感的二次元妹子~",
		效果: {
			战斗失败: (对局: 对局类型) => {
				if (存档.物品.护身符) {
					const 保留生命 = Math.floor(1 + 50 * 存档.物品.护身符 + 0.03 * 计算最大生命() * 存档.物品.护身符)
					if (存档.生命 < 保留生命) {
						存档.生命 = 保留生命
						对局.结果文本.push(`【护身符：保留${存档.生命}点生命】`)
					}
				}
			},
		},
		显示: () => 存档.物品.护身符 > 0,
	},
	{
		名称: "蚊子尸体",
		显示名称: () => `蚊子尸体（已拥有${存档.物品.蚊子尸体})`,
		描述: "※收集类道具。",
		说明: () => `※每回合吸血${5 * 存档.物品.蚊子尸体}吸血。`,
		制作: "来自神秘蚊子古老神秘的力量~",
		效果: {
			攻击后: (对局: 对局类型) => {
				if(对局.主角回合){
					const 吸血量 = 5 * 存档.物品.蚊子尸体
					对局.受击方.生命 -= 吸血量
					对局.攻击方.生命 += 吸血量;
					对局.结果文本.push(`【${对局.受击方.名称}被吸取${吸血量}点生命，你恢复${吸血量}点生命！`);
				}
			},
		},
		显示: () => 存档.物品.蚊子尸体 > 0,
	},
	{
		名称: "西装",
		显示名称: () => `西装（LV${存档.物品.西装}`,
		描述: () => `※收集类道具`,
		说明: () => `※每级增加${8 * 存档.物品.西装}点攻击，${5 * 存档.物品.西装}点防御。【商务谈判】战斗胜利后额外获得${(存档.物品.西装 / 10).toFixed(1)}元！`,
		制作: "商务精英必备，用于提升谈判与战斗能力~",
		效果: {
			计算最大攻击: (计算容器) => {
				计算容器.固定加成 += 8 * 存档.物品.西装;
			},
			计算最大防御: (计算容器) => {
				计算容器.固定加成 += 5 * 存档.物品.西装;
			},
			战斗胜利: (对局: 对局类型) => {
				if (存档.物品.西装 > 0) {
					存档.金钱 += 存档.物品.西装;
					对局.结果文本.push(`【商务谈判： 获得${(存档.物品.西装 / 10).toFixed(1)}元！】`);
				}
			}
		},
		显示: () => 存档.物品.西装 > 0,
	},
];

