import { 存档 } from '../管理器/存档管理器';
import { 默认食材表 } from '../公共方法/食品店表';
import { 已完成成就 } from './成就表';

interface 商品上下文类型 {
  购买成功: (结果: string) => void;
  提示: (提示: string) => void;
}

export interface 商品定义类型 {
  名称: string;
  显示名称: string;
  描述: string;
  条件: boolean;
  选项一文本?: string;
  选项二文本?: string;
  选项一效果?: (商品上下文: 商品上下文类型) => void;
  选项二效果?: (商品上下文: 商品上下文类型) => void;
  显示: boolean;
}

const 原版商品表: 商品定义类型[] = [
  {
    名称: '木材*10',
    get 显示名称() {
      const count = 存档.物品.木材;
      return count === 0 ? '木材*10' : `木材*10（拥有${count}）`;
    },
    描述: '购买/出售：1元/0.5元',
    get 条件() {
      return 存档.金钱 >= 10;
    },
    选项一文本: '购  买',
    选项二文本: '出  售',
    选项一效果: ({ 提示, 购买成功 }) => {
      if (存档.金钱 < 10) {
        提示('钱不够！');
        return;
      }
      存档.金钱 -= 10;
      存档.物品.木材 += 10;
      存档.积分 += 10;
      购买成功('获得【木材】*10！积分*10！');
    },
    选项二效果: ({ 提示, 购买成功 }) => {
      if (存档.物品.木材 < 10) {
        提示('道具不足！');
        return;
      }
      存档.金钱 += 5;
      存档.物品.木材 -= 10;
      购买成功('失去【木材】*10，获得0.5元！');
    },
    显示: true,
  },
  {
    名称: '亚麻*10',
    get 显示名称() {
      const count = 存档.物品.亚麻;
      return count === 0 ? '亚麻*10' : `亚麻*10（拥有${count}）`;
    },
    描述: '购买/出售：1元/0.5元',
    get 条件() {
      return 存档.金钱 >= 10;
    },
    选项一文本: '购  买',
    选项二文本: '出  售',
    选项一效果: ({ 提示, 购买成功 }) => {
      if (存档.金钱 < 10) {
        提示('钱不够！');
        return;
      }
      存档.金钱 -= 10;
      存档.物品.亚麻 += 10;
      存档.积分 += 10;
      购买成功('获得【亚麻】*10！积分*10！');
    },
    选项二效果: ({ 提示, 购买成功 }) => {
      if (存档.物品.亚麻 < 10) {
        提示('道具不足！');
        return;
      }
      存档.金钱 += 5;
      存档.物品.亚麻 -= 10;
      购买成功('失去【亚麻】*10，获得0.5元！');
    },
    显示: true,
  },
  {
    名称: '果子*5',
    get 显示名称() {
      const count = 存档.物品.果子;
      return count === 0 ? '果子*5' : `果子*5（拥有${count}）`;
    },
    描述: '购买/出售：0.5元/0.2元',
    get 条件() {
      return 存档.金钱 >= 5;
    },
    选项一文本: '购  买',
    选项二文本: '出  售',
    选项一效果: ({ 提示, 购买成功 }) => {
      if (存档.金钱 < 5) {
        提示('钱不够！');
        return;
      }
      存档.金钱 -= 5;
      存档.物品.果子 += 5;
      存档.积分 += 5;
      购买成功('获得【果子】*5！积分*5！');
    },
    选项二效果: ({ 提示, 购买成功 }) => {
      if (存档.物品.果子 < 5) {
        提示('道具不足！');
        return;
      }
      存档.金钱 += 2;
      存档.物品.果子 -= 5;
      购买成功('失去【果子】*5，获得0.2元！');
    },
    显示: true,
  },
  {
    名称: '易拉罐',
    get 显示名称() {
      const count = 存档.物品.易拉罐;
      return count === 0 ? '易拉罐' : `易拉罐（拥有${count}）`;
    },
    描述: '售价：每只1毛~',
    get 条件() {
      return 存档.物品.易拉罐 > 0;
    },
    选项二文本: '出  售',
    选项二效果: ({ 提示, 购买成功 }) => {
      const c = 存档.物品.易拉罐;
      if (c <= 0) {
        提示('道具不足！');
        return;
      }
      存档.金钱 += c;
      存档.物品.易拉罐 -= c;
      存档.积分 += c;
      购买成功(`失去【易拉罐】*${c}，获得${c}毛钱，积分+${c}`);
    },
    显示: true,
  },
  {
    名称: '生肉*2',
    get 显示名称() {
      const count = 存档.物品.生肉;
      return count === 0 ? '生肉*2' : `生肉*2（拥有${count}）`;
    },
    描述: '购买/出售：0.4元/0.2元',
    get 条件() {
      return 存档.金钱 >= 4;
    },
    选项一文本: '购  买',
    选项二文本: '出  售',
    选项一效果: ({ 提示, 购买成功 }) => {
      if (存档.金钱 < 4) {
        提示('钱不够！');
        return;
      }
      存档.金钱 -= 4;
      存档.物品.生肉 += 2;
      存档.积分 += 4;
      购买成功('获得【生肉】*2！积分*4！');
    },
    选项二效果: ({ 提示, 购买成功 }) => {
      if (存档.物品.生肉 < 2) {
        提示('道具不足！');
        return;
      }
      存档.金钱 += 2;
      存档.物品.生肉 -= 2;
      购买成功('失去【生肉】*2，获得0.2元！');
    },
    显示: true,
  },
  {
    名称: '艾草*4',
    get 显示名称() {
      const count = 存档.物品.艾草;
      return count === 0 ? '艾草*4' : `艾草*4（拥有${count}）`;
    },
    描述: '购买/出售：0.4元/0.2元',
    get 条件() {
      return 存档.金钱 >= 4;
    },
    选项一文本: '购  买',
    选项二文本: '出  售',
    选项一效果: ({ 提示, 购买成功 }) => {
      if (存档.金钱 < 4) {
        提示('钱不够！');
        return;
      }
      存档.金钱 -= 4;
      存档.物品.艾草 += 4;
      存档.积分 += 4;
      购买成功('获得【艾草】*4！积分*4！');
    },
    选项二效果: ({ 提示, 购买成功 }) => {
      if (存档.物品.艾草 < 4) {
        提示('道具不足！');
        return;
      }
      存档.金钱 += 2;
      存档.物品.艾草 -= 4;
      购买成功('失去【艾草】*4，获得0.2元！');
    },
    显示: true,
  },
  {
    名称: '匕首',
    get 显示名称() {
      const level = 存档.物品.匕首;
      return level === 0 ? '匕首' : `匕首LV${level}`;
    },
    get 描述() {
      return `价格：${((32 + 3 * 存档.物品.匕首) / 10).toFixed(1)}元`;
    },
    get 条件() {
      return 存档.金钱 >= 32 + 3 * 存档.物品.匕首;
    },
    选项一文本: '购  买',
    选项一效果: ({ 提示, 购买成功 }) => {
      const c = 32 + 3 * 存档.物品.匕首;
      if (存档.金钱 < c) {
        提示('钱不够！');
        return;
      }
      存档.金钱 -= c;
      存档.物品.匕首 += 1;
      存档.积分 += c;
      购买成功(`匕首等级提高1级！积分*${c}！`);
    },
    显示: true,
  },
  {
    名称: '皮衣',
    get 显示名称() {
      const level = 存档.物品.皮衣;
      return level === 0 ? '皮衣' : `皮衣LV${level}`;
    },
    get 描述() {
      return `价格：${((20 + 2 * 存档.物品.皮衣) / 10).toFixed(1)}元`;
    },
    get 条件() {
      return 存档.金钱 >= 20 + 2 * 存档.物品.皮衣;
    },
    选项一文本: '购  买',
    选项一效果: ({ 提示, 购买成功 }) => {
      const r = 20 + 2 * 存档.物品.皮衣;
      if (存档.金钱 < r) {
        提示('钱不够！');
        return;
      }
      存档.金钱 -= r;
      存档.物品.皮衣 += 1;
      存档.积分 += r;
      购买成功(`皮衣等级提高1级！积分*${r}！`);
    },
    显示: true,
  },
  {
    名称: '火狐皮',
    get 显示名称() {
      const count = 存档.物品.火狐皮;
      return count === 0 ? '火狐皮' : `火狐皮（拥有${count}张）`;
    },
    描述: `价格：10元`,
    get 条件() {
      return 存档.金钱 >= 100;
    },
    选项一文本: '购  买',
    选项一效果: ({ 提示, 购买成功 }) => {
      if (存档.金钱 < 100) {
        提示('钱不够！');
        return;
      }
      存档.金钱 -= 100;
      存档.物品.火狐皮 += 1;
      存档.积分 += 100;
      购买成功(`获得火狐皮*1！积分*100！`);
    },
    显示: false,
  },
  {
    名称: '黑曜石',
    get 显示名称() {
      const count = 存档.物品.黑曜石;
      return count === 0 ? '黑曜石' : `黑曜石（拥有${count}）`;
    },
    描述: `价格：3元`,
    get 条件() {
      return 存档.金钱 >= 30;
    },
    选项一文本: '购  买',
    选项一效果: ({ 提示, 购买成功 }) => {
      if (存档.金钱 < 30) {
        提示('钱不够！');
        return;
      }
      存档.金钱 -= 30;
      存档.物品.黑曜石 += 1;
      存档.积分 += 30;
      购买成功(`获得黑曜石*1！积分*30！`);
    },
    显示: false,
  },
  {
    名称: '抽奖',
    显示名称: '抽奖',
    描述: '价格：100积分，随机获得一份奖励！十连抽送一抽！',
    get 条件() {
      return 存档.积分 >= 100;
    },
    选项一文本: '抽  奖',
    选项二文本: '十  连',
    选项一效果: ({ 提示, 购买成功 }) => {
      if (存档.积分 < 100) {
        提示('积分不够！');
        return;
      }
      存档.积分 -= 100;
      const rewards = [
        { rate: 60, action: () => (存档.金钱 += 10), text: '1元钱！' },
        { rate: 10, action: () => (存档.物品.创可贴 += 1), text: '【创可贴】*1！' },
        { rate: 5, action: () => (存档.物品.小裤裤 += 1), text: '【小裤裤】*1！' },
        { rate: 5, action: () => (存档.物品.板砖 += 1), text: '【板砖】*1！' },
        { rate: 5, action: () => (存档.物品.幸运石 += 1), text: '【幸运石】*1！' },
        { rate: 5, action: () => (存档.物品.晓月手链 += 1), text: '【晓月手链】*1！' },
        { rate: 9, action: () => (存档.物品.滑稽裤 += 1), text: '【滑稽裤】*1！' },
        { rate: 1, action: () => 存档.物品['┑(=^ω^=)┑']++, text: '【┑(=^ω^=)┑】*1！' },
      ];

      let rand = Math.random() * 100;

      for (const reward of rewards) {
        if (rand < reward.rate) {
          reward.action();
          购买成功(`恭喜获得，${reward.text}`);
          return;
        }
        rand -= reward.rate;
      }
    },
    选项二效果: ({ 提示, 购买成功 }) => {
      function 单抽() {
        const rewards = [
          { rate: 60, action: () => (存档.金钱 += 10), key: '1元钱', text: '1元钱！' },
          {
            rate: 10,
            action: () => (存档.物品.创可贴 += 1),
            key: '创可贴',
            text: '【创可贴】*1！',
          },
          { rate: 5, action: () => (存档.物品.小裤裤 += 1), key: '小裤裤', text: '【小裤裤】*1！' },
          { rate: 5, action: () => (存档.物品.板砖 += 1), key: '板砖', text: '【板砖】*1！' },
          { rate: 5, action: () => (存档.物品.幸运石 += 1), key: '幸运石', text: '【幸运石】*1！' },
          {
            rate: 5,
            action: () => (存档.物品.晓月手链 += 1),
            key: '晓月手链',
            text: '【晓月手链】*1！',
          },
          { rate: 9, action: () => (存档.物品.滑稽裤 += 1), key: '滑稽裤', text: '【滑稽裤】*1！' },
          {
            rate: 1,
            action: () => 存档.物品['┑(=^ω^=)┑']++,
            key: '┑(=^ω^=)┑',
            text: '【┑(=^ω^=)┑】*1！',
          },
        ];

        let rand = Math.random() * 100;

        for (const reward of rewards) {
          if (rand < reward.rate) {
            reward.action();
            return reward.key;
          }
          rand -= reward.rate;
        }
      }

      if (存档.积分 < 1000) {
        提示('积分不够进行十连抽！');
        return;
      }

      存档.积分 -= 1000;

      const resultCount = {};

      for (let i = 0; i < 11; i++) {
        const reward = 单抽();
        resultCount[reward] = (resultCount[reward] || 0) + 1;
      }

      let resultText = '恭喜获得，';

      for (const key in resultCount) {
        resultText += `【${key}】*${resultCount[key]}！`;
      }
      购买成功(resultText);
    },
    显示: true,
  },
];

const 新增商品表: 商品定义类型[] = [
  {
    名称: '太阳能电饭煲',
    显示名称: '太阳能电饭煲',
    描述: '购买：18元/个，让做饭更加方便',
    get 条件() {
      return 存档.金钱 >= 180 && 存档.物品.电饭煲 === 0;
    },
    选项一文本: '购  买',
    选项一效果: ({ 提示, 购买成功 }) => {
      if (存档.物品.太阳能电饭煲 > 0) {
        提示('你已经有一个太阳能电饭煲了！');
        return;
      }
      if (存档.金钱 < 180) {
        提示('钱不够！');
        return;
      }
      存档.金钱 -= 180;
      存档.物品.太阳能电饭煲 += 1;
      存档.积分 += 180;
      购买成功('获得【太阳能电饭煲】*1！积分*180！');
    },
    get 显示() {
      return 存档.物品.太阳能电饭煲 === 0;
    },
  },
  {
    名称: '十八手自行车',
    显示名称: '十八手自行车',
    描述: '购买：300元/辆，让出行更加方便',
    get 条件() {
      return 存档.金钱 >= 3000 && 存档.物品.十八手自行车 === 0;
    },
    选项一文本: '购  买',
    选项一效果: ({ 提示, 购买成功 }) => {
      if (存档.物品.十八手自行车 > 0) {
        提示('你已经有一个十八手自行车了！');
        return;
      }
      if (存档.金钱 < 3000) {
        提示('钱不够！');
        return;
      }
      存档.金钱 -= 3000;
      存档.物品.十八手自行车 += 1;
      存档.积分 += 3000;
      购买成功('获得【十八手自行车】*1！积分*3000！请进入制作页面查看');
    },
    get 显示() {
      return 存档.物品.十八手自行车 === 0;
    },
  },
  {
    名称: '钓鱼竿',
    显示名称: '钓鱼竿',
    get 描述() {
      return 已完成成就('大鱼传说')
        ? '购买：3元/根，【大鱼传说：已打五折】'
        : '购买：6元/根，让钓鱼更加方便';
    },
    get 条件() {
      return 已完成成就('大鱼传说')
        ? 存档.金钱 >= 30 && 存档.物品.钓鱼竿 === 0
        : 存档.金钱 >= 60 && 存档.物品.钓鱼竿 === 0;
    },
    选项一文本: '购  买',
    选项一效果: ({ 提示, 购买成功 }) => {
      if (存档.物品.钓鱼竿 > 0) {
        提示('你已经有一个钓鱼竿了！');
        return;
      }

      const 价格 = 已完成成就('大鱼传说') ? 30 : 60;

      if (存档.金钱 < 价格) {
        提示('钱不够！');
        return;
      }
      存档.金钱 -= 价格;
      存档.物品.钓鱼竿 += 1;
      存档.积分 += 价格;
      购买成功(`获得【钓鱼竿】*1！积分*${价格}！请进入制作页面查看`);
    },
    get 显示() {
      return 存档.物品.钓鱼竿 === 0;
    },
  },
];

export const 默认商品表: 商品定义类型[] = [...原版商品表, ...新增商品表];

console.log(`【商品】共计${默认商品表.length}条`);
