import { 概率类型, 深克隆 } from "../方法函数/公共函数";
import { 存档 } from "../管理器/存档管理器";

interface 地区定义类型 {
	名称: string,
	条件: boolean,
	物品: 概率类型[],
	事件: 概率类型[],
	敌人: 概率类型[],
}

const 公共事件: 概率类型[] = [
	{ 名称: "女流氓", 概率: 10 },
	{ 名称: "收药", 概率: 10 },
	{ 名称: "追贼", 概率: 5 },
	{ 名称: "偷钱", 概率: 10 },
	{ 名称: "垃圾箱", 概率: 10 },
	{ 名称: "扶老奶奶", 概率: 15 },
	{ 名称: "休息", 概率: 10 },
	{ 名称: "电疗", 概率: 10 },
	{ 名称: "换烟", 概率: 10 },
	{ 名称: "捡钱", 概率: 10 },
];

export const 默认地区表: 地区定义类型[] = [
	{
		名称: "荒野",
		get 条件() { return 存档.距离 < 100 },
		物品: [
			{ 名称: "果子", 概率: 20, 数量: 2 },
			{ 名称: "木材", 概率: 30, 数量: 2 },
			{ 名称: "亚麻", 概率: 30, 数量: 2 },
			{ 名称: "艾草", 概率: 20, 数量: 2 },
			{ 名称: "烟草", 概率: 7, 数量: 2 },
			{ 名称: "黑曜石", 概率: 2, 数量: 1 },
		],

		get 事件() {
			if (Math.random() * 100 < 60) {
				return 公共事件
			}
			return [
				{ 名称: "撞车", 概率: 25 },
				{ 名称: "选路", 概率: 25 },
				{ 名称: "抢糖", 概率: 25 },
				{ 名称: "恶狗", 概率: 45 },

				{ 名称: "野果丛", 概率: 2 },
				{ 名称: "树先生", 概率: 1 },
			]
		},
		敌人: [
			{ 名称: "小蚊", 概率: 20 },
			{ 名称: "小小兔", 概率: 15 },
			{ 名称: "小小蛇", 概率: 20 },
			{ 名称: "小青（精英）", 概率: 10 },
			{ 名称: "蚊.媛", 概率: 5 },
			{ 名称: "泰坦巨蟒（特殊）", 概率: 10 },
			{ 名称: "草带男孩（中二病）", 概率: 15 },
		],
	},
	{
		名称: "县城",
		get 条件() { return 存档.距离 === 100 },
		物品: [
			{ 名称: "易拉罐", 概率: 75, 数量: 1 },
			{ 名称: "金钱", 概率: 22, 数量: 1 },
			{ 名称: "50ml啤酒", 概率: 15, 数量: 1 },
			{ 名称: "烟头", 概率: 16, 数量: 1 },
		],

		敌人: [
			{ 名称: "葬爱.蚊乐队", 概率: 25 },
			{ 名称: "小混混", 概率: 20 },
			{ 名称: "丐帮304代弟子", 概率: 20 },
			{ 名称: "恶霸（精英）", 概率: 10 },
			{ 名称: "麻城女警", 概率: 10 },
			{ 名称: "煤老板", 概率: 7 },
			{ 名称: "草带男孩（中二病）", 概率: 7 },
			{ 名称: "城管104小分队", 概率: 1 },
		],
		get 事件() {
			if (Math.random() * 100 < 30) {
				return 公共事件
			}
			return [
				{ 名称: "捡五毛钱", 概率: 10 },
				{ 名称: "押宝", 概率: 10 },
				{ 名称: "甩卖", 概率: 20 },
				{ 名称: "搬砖", 概率: 40 },
				{ 名称: "服务生", 概率: 10 },
				{ 名称: "卖刀", 概率: 2 },

				{ 名称: "乞讨者", 概率: 0.1 },
				// { 名称: "水果摊", 概率: 1 },
			]
		},
	},
	{
		名称: "山脉",
		get 条件() { return 存档.距离 > 100 && 存档.距离 < 300 },
		物品: [
			{ 名称: "果子", 概率: 15, 数量: 2 },
			{ 名称: "木材", 概率: 35, 数量: 2 },
			{ 名称: "亚麻", 概率: 35, 数量: 2 },
			{ 名称: "艾草", 概率: 15, 数量: 2 },
			{ 名称: "烟草", 概率: 5, 数量: 2 },
			{ 名称: "黑曜石", 概率: 2, 数量: 1 },
		],

		敌人: [
			{ 名称: "皮皮猴", 概率: 25 },
			{ 名称: "野猪", 概率: 15 },
			{ 名称: "药贩", 概率: 10 },
			{ 名称: "流浪剑客", 概率: 10 },
			{ 名称: "黑熊（精英）", 概率: 10 },
			{ 名称: "果树", 概率: 10 },
			{ 名称: "火狐（稀有）", 概率: 8 },
			{ 名称: "山岭巨人（稀有）", 概率: 5 },
			{ 名称: "草带男孩（中二病）", 概率: 5 },
			{ 名称: "鸭先知", 概率: 1 },
			// { 名称: "哥布林厨师长（精英）", 概率: 1 },
		],
		get 事件() {
			if (Math.random() * 100 < 50) {
				return 公共事件
			}
			return [
				{ 名称: "商店", 概率: 15 },
				{ 名称: "喂狗", 概率: 10 },
				{ 名称: "险路", 概率: 10 },
				{ 名称: "套圈", 概率: 15 },
				{ 名称: "挨砍", 概率: 15 },
				{ 名称: "红白事", 概率: 15 },
				{ 名称: "挖宝", 概率: 20 },
				{ 名称: "算天赋", 概率: 2 },
			]
		},
	},
	{
		名称: "省城",
		get 条件() { return 存档.距离 >= 300 },
		get 物品() {
			if (存档.当前地点 === '山洞') {
				const 山洞进度 = typeof 存档.其他?.山洞进度 === 'number' ? 存档.其他.山洞进度 : 0;

				const 数量 = Math.min(Math.floor(山洞进度 / 100 + 1), 4)
				return [
					{ 名称: "漂亮石头", 概率: 60, 数量 },
					{ 名称: "漂亮石头", 概率: 20, 数量 },
					{ 名称: "黑曜石", 概率: 8, 数量: 1 },
				]
			}
			if (存档.当前地点 === '郊外') {
				return [
					{ 名称: "果子", 概率: 16, 数量: 2 },
					{ 名称: "木材", 概率: 25, 数量: 2 },
					{ 名称: "亚麻", 概率: 25, 数量: 2 },
					{ 名称: "艾草", 概率: 19, 数量: 1 },
					{ 名称: "烟草", 概率: 6, 数量: 1 },
				]
			}

			if (存档.当前地点 === '市中心') {
				return [
					{ 名称: "易拉罐", 概率: 97, 数量: 2 },
					{ 名称: "易拉罐", 概率: 20, 数量: 1 },
					{ 名称: "金钱", 概率: 25, 数量: 3 },
					{ 名称: "烟头", 概率: 15, 数量: 1 },
				]
			}
			return [
				{ 名称: "易拉罐", 概率: 75, 数量: 1 },
				{ 名称: "金钱", 概率: 25, 数量: 1 },
				{ 名称: "50ml啤酒", 概率: 20, 数量: 1 },
				{ 名称: "金钱", 概率: 10, 数量: 1 },
			]
		},
		get 敌人() {
			if (存档.当前地点 === '山洞') {
				const 山洞进度 = typeof 存档.其他?.山洞进度 === 'number' ? 存档.其他.山洞进度 : 0;

				const 进度 = Math.floor(山洞进度 / 50)
				const 山洞敌人 = ["吸血蝙蝠", "彩色蜘蛛", "黑头剑蛇", "变异的巨型猫", "变异的流浪狗", "变异的巨蜥", "被割掉舌头的人", "看守的士兵", "军官", "科学家", "？？？？"]

				const 敌人名称 = 山洞敌人[Math.min(进度, 山洞敌人.length - 1)];
				return [{ 名称: 敌人名称, 概率: 100 }]
			}
			if (存档.当前地点 === '郊外') {
				return [
					{ 名称: "金环蛇", 概率: 30 },
					{ 名称: "铃女", 概率: 20 },
					{ 名称: "流浪大叔", 概率: 20 },
					{ 名称: "古树", 概率: 10 },
					{ 名称: "受伤的火狐", 概率: 15 },
					{ 名称: "草带男孩（中二病）", 概率: 5 },
					{ 名称: "再生虫（稀有）", 概率: 2 },
				]
			}
			if (存档.当前地点 === '市中心') {
				return [
					{ 名称: "喵妹", 概率: 20 },
					{ 名称: "高级金融分析师", 概率: 20 },
					{ 名称: "胖虎", 概率: 20 },
					{ 名称: "龙啸天", 概率: 15 },
					{ 名称: "排球少女", 概率: 25 },
				]
			}

			return [
				{ 名称: "熊孩子", 概率: 20 },
				{ 名称: "阿宾", 概率: 20 },
				{ 名称: "卖片老板", 概率: 20 },
				{ 名称: "阿龙", 概率: 10 },
				{ 名称: "大龄站街妹", 概率: 15 },
				{ 名称: "走私团伙", 概率: 10 },
				{ 名称: "草带男孩（中二病）", 概率: 5 },
			]
		},
		get 事件() {
			if (存档.当前地点 === '山洞') {
				return [
					{ 名称: "山洞1", 概率: 25 },
					{ 名称: "山洞2", 概率: 15 },
					{ 名称: "山洞3", 概率: 10 },
					{ 名称: "山洞4", 概率: 10 },
					{ 名称: "山洞5", 概率: 10 },
					{ 名称: "山洞6", 概率: 10 },
					{ 名称: "山洞7", 概率: 10 },

					{ 名称: "算卦", 概率: 1}
				]
			}

			if (存档.当前地点 === '郊外') {
				return [
					{ 名称: "深挖", 概率: 20 },
					{ 名称: "飞刀", 概率: 20 },
					{ 名称: "狼群", 概率: 20 },
					{ 名称: "采集", 概率: 20 },
					{ 名称: "抽签", 概率: 20 },

					{ 名称: "池塘", 概率: 1 },
				]
			}

			if (存档.当前地点 === '市中心') {
				return [
					{ 名称: "送水泥", 概率: 20 },
					{ 名称: "求助妹", 概率: 20 },
					{ 名称: "套圈2", 概率: 20 },
					{ 名称: "大楼", 概率: 15 },
					{ 名称: "娱乐场", 概率: 5 },

					{ 名称: "扶老奶奶过马路", 概率: 1 },
				]
			}

			if (Math.random() * 100 < 50) {
				return 公共事件
			}
			return [
				{ 名称: "卖秘籍", 概率: 10 },
				{ 名称: "黑市", 概率: 15 },
				{ 名称: "贴广告", 概率: 30 },
				{ 名称: "烤红薯", 概率: 20 },
				{ 名称: "捡罐子", 概率: 25 },

				// { 名称: "街头艺人", 概率: 1 },
				{ 名称: "二手书摊", 概率: 1 },
				{ 名称: "彩票摊", 概率: 1 },
			]
		}
	}
];

export function 获取当前地区() {
	const 地区 = 默认地区表.find((地区) => 地区.条件)
	if(!地区) {
		return null
	}
	return 深克隆(地区)
}

export function 获取地区名称() {
	const 地区 = 默认地区表.find((地区) => 地区.条件)
	return 地区?.名称 || "未知地区"
}