import { 对局类型 } from "../场景脚本/战斗";
import { 计算容器, 计算最大生命, 计算最大防御 } from "../方法函数/属性计算"
import { 存档 } from "../管理器/存档管理器"
import { 设置 } from "../管理器/设置管理器";
import { 获取地区名称 } from "./地区表";

export interface 天赋项目类型 {
    名称: string,
    品质: string,
    颜色?: string,
    条件?: boolean | (() => boolean),
    说明: string | (() => string),
    效果?: Record<string, (a: any, b: any) => void>,
    类型?: string,
}

export const 默认天赋表: 天赋项目类型[] = [
    {
        名称: "抗揍",
        说明: "提升防御属性",
        品质: "普通",
        颜色: "#00FF00",
        效果: {
            计算属性_防御: (计算容器) => {
                计算容器.固定加成 += 8;
            }
        },
        类型: "天赋",
    },
    {
        名称: "零花钱",
        说明: "激活时增加金钱",
        品质: "普通",
        效果: {
            激活: () => {
                存档.金钱 + 16;
            }
        },
        类型: "天赋",
    },
    {
        名称: "免疫力强",
        说明: "提升健康并过滤负面天赋",
        品质: "普通",
        效果: {
            更新主页: () => {
                const 普通负面天赋 = 默认天赋表.filter((天赋) => 天赋.类型 === '负面' && 天赋.品质 !== '传说')
                普通负面天赋.forEach((天赋) => {
                    const 天赋名称 = 天赋.名称
                    if (存档.天赋[天赋名称]) {
                        存档.天赋[天赋名称] = false
                    }
                })
            },
            激活: () => {
                存档.健康 += 10;
            }
        },
        类型: "天赋",
    },
    {
        名称: "火力旺",
        说明: "提升最大生命",
        品质: "普通",
        效果: {
            计算最大生命: (计算容器) => {
                计算容器.固定加成 += 100;
            },
        },
        类型: "天赋",
    },
    {
        名称: "溜得快",
        说明: "提升逃跑属性",
        品质: "普通",
        效果: {
            计算最大逃跑: (计算容器) => {
                计算容器.固定加成 += 15;
            }
        }
    },
    {
        名称: "嗜血",
        说明: "提升嗜血率",
        品质: "普通",
        效果: {
            计算嗜血率: (计算容器) => {
                计算容器.固定加成 += 12
            },
        },
        类型: "天赋",
    },
    {
        名称: "强壮",
        说明: "提升攻击、最大生命和当前生命属性",
        品质: "普通",
        效果: {
            计算最大攻击: (计算容器) => {
                计算容器.固定加成 += 15;
            },
            计算最大生命: (计算容器) => {
                计算容器.固定加成 += 50;
            },
        },
        类型: "天赋",
    },

    {
        名称: "赌徒潜质",
        说明: "提升赌博成功率，特定地区增加押宝事件",
        品质: "稀有",
        效果: {
            计算赌博成功率: (计算容器) => {
                计算容器.固定加成 += 30;
            },
            计算地区事件表: (地区事件表) => {
                if (获取地区名称() === '县城' || 获取地区名称() === '省城') {
                    地区事件表.push({ 名称: '押宝', 概率: 10 });
                }
            }
        },
        类型: "天赋",
    },
    {
        名称: "暗杀直觉",
        说明: "战斗中提升暴击率和暴击强度",
        品质: "稀有",
        效果: {
            计算暴击率: (计算容器) => {
                计算容器.暴击率 += 20;
            },
            计算暴击强度: (计算容器) => {
                计算容器.暴击强度 += 25
            }
        },
        类型: "天赋",
    },
    {
        名称: "精力旺盛",
        说明: "提升最大精力属性",
        品质: "稀有",
        效果: {
            计算最大经理: (计算容器) => {
                计算容器.固定加成 += 20;
            }
        },
        类型: "天赋",
    },
    {
        名称: "大善人",
        说明: "修改老奶奶摸钱概率（待完善）",
        品质: "稀有",
        效果: {
            计算老奶奶摸钱概率: (计算容器) => {
                计算容器.固定加成 = 0;
                // todo 特殊事件加成
            }
        },
        类型: "天赋",
    },
    {
        名称: "冷血",
        说明: "提升偷钱数量和成功率（待完善负罪相关效果）",
        品质: "稀有",
        效果: {
            计算偷钱数额: (计算容器: 计算容器) => {
                计算容器.初始值 = 7;
            },
            计算偷钱成功率: (计算容器) => {
                计算容器.初始值 = 75;
            }
            // todo 做坏事负罪-80%
        },
        类型: "天赋",
    },
    {
        品质: "稀有",
        名称: "传家宝",
        说明: "开局携带物品（待实现）",
        效果: {},//todo
        类型: "天赋",
    },
    {
        名称: "家传把式",
        说明: "提升格挡率和防御属性",
        品质: "稀有",
        效果: {
            计算格挡率: (计算容器) => {
                计算容器.固定加成 += 20;
            },
            计算最大防御: (计算容器) => {
                计算容器.固定加成 += 10;
            }
        },
        类型: "天赋",
    },
    {
        名称: "烟鬼",
        说明: "降低健康，提升吸烟相关效果",
        品质: "稀有",
        效果: {
            激活: () => {
                存档.健康 -= 5;
            },
            计算吸烟增加烟瘾: (计算容器) => {
                计算容器.固定加成++;
            },
            计算吸烟恢复健康: (计算容器) => {
                计算容器.固定加成 += 存档.精力;
            }
        },
        类型: "天赋",
    },
    {
        名称: "酒鬼",
        说明: "开局获得啤酒，喝酒触发暴躁状态并修改精力恢复",
        品质: "稀有",
        效果: {
            激活: () => {
                存档.物品.啤酒 += 3;
            },
            使用食物后: (食物) => {
                if (食物.名称 === '啤酒') {
                    存档.状态.暴躁 = true;
                }
            },
            计算喝酒恢复精力: (计算容器: 计算容器) => {
                计算容器.百分比加成 += 0.2
            }
        },
        类型: "天赋",
    },
    {
        名称: "反弹体质",
        说明: "战斗中提升反弹率",
        品质: "稀有",
        效果: {
            计算反弹率: (计算容器) => {
                计算容器.固定加成 += 20
            }
        },
        类型: "天赋",
    },
    {
        名称: "家有薄财",
        说明: "睡觉结算时获得少量金钱",
        品质: "稀有",
        效果: {
            睡觉结算: (结果文本) => {
                存档.金钱 += 5;
                结果文本.push('【家有薄财：获得0.5元】');
            }
        },
        类型: "天赋",
    },


    {
        名称: "澎湃之血",
        说明: "提升最大精力，攻击属性随最大生命提升",
        品质: "传说",
        效果: {
            计算最大精力: (计算容器) => {
                计算容器.固定加成 += 10;
            },
            计算最大攻击: (计算容器) => {
                const 生命 = 计算最大生命()
                计算容器.固定加成 += Math.floor(生命 * 0.15);
            }
        },
        类型: "天赋",
    },
    {
        名称: "求生大师",
        说明: "减少探索精力消耗，提升探索生命恢复",
        品质: "传说",
        效果: {
            计算前进探索消耗精力: (计算容器) => {
                计算容器.固定加成 -= 2;
            },
            计算恢复量: (计算容器) => {
                计算容器.固定加成 += 16;
            }
        },
        类型: "天赋",
    },
    {
        名称: "天选打工人",
        说明: "打工必定成功、收益翻倍、获得精力（待实现）",
        效果: {},
        品质: "传说",
        类型: "天赋",
    },
    {
        名称: "夺宝达人",
        说明: "击败boss必定掉落宝物（待实现）",
        效果: {},
        品质: "传说",
        类型: "天赋",
    },
    {
        名称: "持枪者",
        说明: "激活时获得枪和子弹",
        效果: {
            激活: () => {
                存档.物品.枪++;
                存档.物品.子弹 += 5;
            }
        },
        品质: "传说",
        类型: "天赋",
    },
    {
        名称: "拾荒者",
        说明: "荒野探索必定收获，调整探索事件权重，激活获得熟肉",
        效果: {
            收集前: () => {
                // 荒野和山脉探索必定收获（待实现）
            },
            计算前进探索探索事件权重: (计算容器) => {
                if (获取地区名称() == '荒野') {
                    计算容器.百分比加成 = 0;
                }
            },
            计算前进探索探索战斗权重: (计算容器) => {
                if (获取地区名称() == '荒野') {
                    计算容器.百分比加成 = 0;
                }
            },
            激活: () => {
                存档.物品.熟肉 += 10;
            }
        },
        品质: "传说",
        类型: "天赋",
    },
    {
        名称: "私房钱",
        说明: "激活时获得大量金钱",
        效果: {
            激活: () => {
                存档.金钱 += 50;
            }
        },
        品质: "传说",
        类型: "天赋",
    },
    {
        名称: "粉碎",
        说明: "提升攻击属性，攻击无视格挡（待实现无视格挡）",
        效果: {
            计算最大攻击: (计算容器) => {
                计算容器.固定加成 += 28;
            }
        },
        品质: "传说",
        类型: "天赋",
    },
    {
        名称: "极影",
        说明: "提升逃跑和闪避率",
        效果: {
            计算最大逃跑: (计算容器) => {
                计算容器.固定加成 += 50;
            },
            计算闪避率: (计算容器) => {
                计算容器.固定加成 += 20;
            }
        },
        品质: "传说",
        类型: "天赋",
    },
    {
        名称: "震荡",
        说明: "攻击属性随防御属性提升",
        效果: {
            计算最大攻击: (计算容器) => {
                const 防御 = 计算最大防御()
                计算容器.固定加成 += 防御;
            }
        },
        品质: "传说",
        类型: "天赋",
    },
    {
        名称: "超量恢复",
        说明: "提升饥饿和最大精力属性，战斗恢复可超量（待实现）",
        效果: {
            计算最大饥饿: (计算容器) => {
                计算容器.固定加成 += 100;
            },
            计算最大精力: (计算容器) => {
                计算容器.固定加成 += 20;
            }
        },
        品质: "传说",
        类型: "天赋",
    },
    {
        名称: "生命共鸣",
        品质: "传说",
        说明: "最大生命随健康属性提升（不超过70%，待实现限制）",
        效果: {
            计算最大生命_修正: (计算容器) => {
                // 不超过 70%（待实现）todo
                计算容器.固定加成 += 存档.健康 * 7;
            }
        }
    },
    {
        名称: "善守者",
        说明: "提升防御百分比，调整架势，受击回血反弹（待实现）",
        效果: {
            激活: () => {
                存档.架势.猥琐 = true;
                存档.架势.平衡 = true;
            },
            计算最大防御: (计算容器) => {
                计算容器.百分比加成 += 0.5;
            }
            // 受击时 额外+10 回血系数 +1 反弹伤害 100%（待实现）
        },
        品质: "传说",
        类型: "天赋",
    },
    {
        名称: "斩杀",
        说明: "提升攻击属性，低血量敌人直接斩杀",
        效果: {
            计算最大攻击: (计算容器) => {
                计算容器.百分比加成 += 0.25;
            },
            攻击后: (对局: 对局类型) => {
                if (对局.主角回合) {
                    if (对局.受击方.生命 < 对局.受击方.最大生命 * 0.18) {
                        对局.受击方.生命 = -999;
                        对局.结果文本.push('【斩杀！！！】');
                    }
                }
            }
        },
        品质: "传说",
        类型: "天赋",
    },
    {
        名称: "商店之友",
        说明: "解锁商店按钮，激活获得金钱",
        效果: {
            更新面板: () => {
                存档.按钮.商店 = true;
            },
            激活: () => {
                存档.金钱 += 40;
            }
        },
        品质: "传说",
        类型: "天赋",
    },
    {
        名称: "仁者",
        说明: "攻击随罪恶/好人卡提升，好事三倍回报（待实现）",
        效果: {
            计算最大攻击: (计算容器) => {
                if (存档.罪恶 < 0) {
                    计算容器.固定加成 += Math.floor(存档.罪恶 * 0.75);
                }
                if (存档.物品.好人卡) {
                    计算容器.百分比加成 += 0.02 * 存档.物品.好人卡;
                }
            }
            // 好事三倍回报、老奶奶概率增加（待实现）
        },
        品质: "传说",
        类型: "天赋",
    },
    {
        名称: "枪魂",
        说明: "获得枪和子弹，睡觉有概率获得子弹（待实现空气弹）",
        效果: {
            攻击前: () => {
                // 空气弹（待实现）
            },
            激活: () => {
                存档.物品.枪 += 1;
                存档.物品.子弹 += 10;
            },
            睡觉结算: (结果文本) => {
                if (Math.random() * 100 < 50) {
                    存档.物品.子弹 += 1;
                    结果文本.push('【枪运：获得子弹*1】');
                }
            }
        },
        品质: "传说",
        类型: "天赋",
    },
    // 负面天赋
    {
        名称: "骨质疏松",
        说明: "降低防御属性",
        效果: {
            计算最大防御: (计算容器) => {
                计算容器.固定加成 -= 8;
            }
        },
        品质: "普通",
        类型: "负面",
    },
    {
        名称: "跑得慢",
        说明: "降低逃跑属性",
        效果: {
            计算最大逃跑: (计算容器) => {
                计算容器.固定加成 -= 20;
            }
        },
        品质: "普通",
        类型: "天赋",
    },
    {
        名称: "身体虚弱",
        说明: "降低最大生命、当前生命和健康属性",
        效果: {
            计算最大生命: (计算容器) => {
                计算容器.固定加成 -= 10;
            },
            激活: (计算容器) => {
                计算容器.固定加成 -= 10;
            }
        },
        品质: "普通",
        类型: "负面",
    },
    {
        名称: "精神脆弱",
        说明: "提升罪恶属性",
        效果: {
            激活: (计算容器) => {
                计算容器.固定加成 += 10;
            }
        },
        品质: "普通",
        类型: "负面",
    },
    {
        名称: "吸烟不耐受",
        说明: "降低吸烟恢复精力的效果",
        效果: {
            计算吸烟恢复精力: (计算容器) => {
                计算容器.百分比加成 = 0.5;
            }
        },
        品质: "普通",
        类型: "负面",
    },
    {
        名称: "酒精不耐受",
        说明: "无法饮酒",
        效果: {
            使用物品: (食物) => {
                食物.使用 = () => {
                    return `酒精不耐受，不能喝酒！`;
                };
            }
        },
        品质: "普通",
        类型: "负面",
    },
    {
        名称: "弱不禁风",
        说明: "降低攻击、防御、生命属性，影响敌人逃跑（字段名笔误）",
        效果: {
            计算最大攻击: (计算容器) => {
                计算容器.固定加成 -= 5;
            },
            计算最大防御: (计算容器) => {
                计算容器.固定加成 -= 5;
            },
            计算最大生命: (计算容器) => {
                计算容器.固定加成 -= 5;
            },

            战斗初始化: (敌人) => { // 注：字段名笔误，建议改为 战斗初始化后
                敌人.逃跑 -= 30;
            }
        },
        品质: "普通",
        类型: "负面",
    },
    {
        名称: "四肢乏力",
        说明: "降低攻击属性",
        效果: {
            计算最大攻击: (计算容器) => {
                计算容器.固定加成 -= 10;
            }
        },
        品质: "普通",
        类型: "负面",
    },
    {
        名称: "出门忘记带钱",
        说明: "新建游戏时金钱清零",
        效果: {
            激活: () => {
                存档.金钱 = 0;
            }
        },
        品质: "普通",
        类型: "负面",
    },

    // 特质
    {
        名称: "不易疲劳",
        类型: "特质",
        品质: "普通",
        说明: `你不易疲劳，精力上限增加${设置.特质["不易疲劳"] * 10}`,
        效果: {
            计算属性_最大精力: (计算容器) => {
                计算容器.固定加成 += 10
            }
        }
    },
    {
        名称: "硬汉",
        类型: "特质",
        品质: "普通",
        说明: `你的意志和体魄让你的生命力异常顽强，战斗中当生命燃尽时，你的生命值强制锁定为1！（单场战斗触发一次，每天最多触发${设置.特质["硬汉"]}次，进入已触发${存档.其他.进入触发硬汉次数}/${设置.特质["硬汉"]}}次）`,
        效果: {
            战斗初始化后: (对局) => {
                对局.其他.已触发硬汉 = false
            },
            被攻击后: (对局) => {
                if (存档.生命 < 0 && 存档.其他.当日硬汉次数 < 1 && !对局.其他.已触发硬汉) {
                    存档.生命 = 1
                    存档.其他.当日硬汉次数++
                    对局.其他.已触发硬汉 = true
                    对局.结果文本(`【硬汉：锁定1点生命（今日已触发${存档.其他.当日硬汉次数}/1次）】`)
                }
            }
        }
    },
    {
        名称: "易吸收体质",
        类型: "特质",
        品质: "普通",
        说明: `你能更好的地吸收果子中的营养！吃果子恢复健康的概率额外增加${设置.特质["易吸收体质"] * 3}%`,
        效果: {
            计算_吃果子恢复健康概率: (计算容器) => {
                计算容器.百分比加成 += 0.03
            }
        }
    },

    {
        名称: "县城钉子户",
        类型: "特质",
        品质: "普通",
        说明: `你对县城莫名地熟悉，即使逗留更多的时间也不会被发现！县城最大停留天数增加${设置.特质["县城钉子户"] * 2}，位于县城时，额外造成${10 + 设置.特质["县城钉子户"] * 5}%的基础伤害！`,
        效果: {
            计算_停留县城天数: (计算容器) => {
                计算容器.固定加成 += 3
            },
            攻击前: (对局) => {
                if (获取地区名称() === '县城') {
                    对局.伤害 += Math.floor(0.1 * 对局.伤害)
                    对局.结果文本.push('【地头蛇：位于县城增加10%伤害！】')
                }
            }
        }
    },

    {
        名称: "赌徒",
        品质: "普通",
        类型: "特质",
        get 说明() {
            return `你是一个赌徒，你可以在赌博时获得额外的奖励！（赌博上限增加${设置.特质["赌徒"] * 30}，赌博成功率增加${设置.特质["赌徒"] * 2}%）`
        },
        效果: {
            计算_赌博上限: (计算容器) => {
                计算容器.固定加成 += 30
            },
            计算_赌博成功率: (计算容器) => {
                计算容器.固定加成 += 2
            },
            触发事件: (事件) => {
                if (事件.名称 == '押宝') {
                    事件.文本.push(`（当前成功率：47%）`)
                }
            },
        }
    },
    {
        名称: "熬夜者",
        类型: "特质",
        品质: "普通",
        说明: `你是一个熬夜者，你可以在战斗中额外增加20点精力！（每100点生命值，额外增加1点精力）`,
        效果: {
            计算属性_最大精力: (计算容器) => {
                计算容器.固定加成 += 20
            },
            激活: () => {
                存档.健康 -= 8
            },
            计算_吸烟消耗健康: (计算容器) => {
                const 翻倍数 = Math.floor(存档.使用次数["香烟"] / 6)
                if (翻倍数 >= 1) {
                    计算容器.固定加成 = 计算容器.固定加成 ** 翻倍数;
                }
            }
        }
    },
    {
        名称: "臂力惊人",
        类型: "特质",
        品质: "普通",
        说明: `你有一个异常强大的臂力，攻击时额外增加${0 + 设置.特质["臂力惊人"] * 5}%的基础伤害！`,
        效果: {
            计算属性_攻击: (计算容器) => {
                计算容器.固定加成 += 10
            },
        }
    },
    {
        名称: "蚊子杀手",
        类型: "特质",
        品质: "普通",
        说明: `你是天生的蚊子克星！清晨遭遇蚊子的概率提升${设置.特质["蚊子杀手"] * 5}%，对战时蚊子的逃跑概率大幅增加${设置.特质["蚊子杀手"] * 10}%！`,
        效果: {
            睡觉结算: () => {
                if (!存档.当前敌人) {
                    if (!设置.特质["蚊子杀手"]) {
                        return
                    }
                    const 特质等级 = 20 + 设置.特质["蚊子杀手"] * 20
                    if (Math.random() * 100 < 特质等级) {
                        const 蚊子系列 = ["蚊小满", "大毛蚊", "密斯特蚊", "阿蚊", "徐蚊强", "莫斯奇托蚊", "蚊女王"];
                        if (蚊子系列[存档.其他.蚊子系列消灭数]) {
                            存档.当前敌人 = 蚊子系列[存档.其他.蚊子系列消灭数]
                        }
                    }
                }
            },
            战斗初始阿: (敌人, 对局) => {
                if (敌人.名称.inclueds("蚊")) {
                    if (!设置.特质["蚊子杀手"]) {
                        return
                    }
                    对局.逃跑修正 += 20 + 设置.特质["蚊子杀手"] * 10
                }
            }
        }
    },
]
