import { 对局类型 } from "../场景脚本/战斗";
import { 抽取物品 } from "../方法函数/公共函数";
import { 计算容器类型, 计算最大生命, 计算最大精力, 计算最大防御, 计算最大饥饿 } from "../方法函数/属性计算"
import { 存档 } from "../管理器/存档管理器"
import { 设置 } from "../管理器/设置管理器";
import { 获取地区名称 } from "./地区表";

export interface 天赋项目类型 {
    名称: string,
    说明: string,
    品质: string,
    条件?: boolean,
    效果?: Record<string, (a: any, b: any) => void>,
    负面?: boolean,
}

export const 默认天赋表: 天赋项目类型[] = [
    {
        名称: "威猛",
        说明: "攻击力+15，生命值+50",
        品质: "普通",
        负面: false,
        效果: {
            计算最大攻击: (计算容器: 计算容器类型) => {
                if (存档.天赋.威猛) {
                    计算容器.固定加成 += 15;
                }
            },
            计算最大生命: (计算容器: 计算容器类型) => {
                if (存档.天赋.威猛) {
                    计算容器.固定加成 += 50;
                }
            }
        }
    },
    {
        名称: "坚韧",
        说明: "防御力+8",
        品质: "普通",
        负面: false,
        效果: {
            计算最大防御: (计算容器: 计算容器类型) => {
                if (存档.天赋.坚韧) {
                    计算容器.固定加成 += 8;
                }
            }
        }
    },
    {
        名称: "生机",
        说明: "最大生命+100",
        品质: "普通",
        负面: false,
        效果: {
            计算最大生命: (计算容器: 计算容器类型) => {
                if (存档.天赋.生机) {
                    计算容器.固定加成 += 100;
                }
            }
        }
    },
    {
        名称: "资粮",
        说明: "获得2元",
        品质: "普通",
        负面: false,
        效果: {
            激活天赋: (名称) => {
                if (名称 === "资粮") {
                    存档.金钱 += 20;
                }
            }
        }
    },
    {
        名称: "免疫",
        说明: "传说级以下的负面天赋无效，健康+10",
        品质: "普通",
        负面: false,
        效果: {
            更新主页: () => {
                if (存档.天赋.免疫) {
                    const 普通负面天赋 = 默认天赋表.filter((天赋) => 天赋.负面 && 天赋.品质 !== '传说')
                    普通负面天赋.forEach((天赋) => {
                        const 天赋名称 = 天赋.名称
                        if (存档.天赋[天赋名称]) {
                            存档.天赋[天赋名称] = false
                        }
                    })
                }
            },
            激活天赋: (名称) => {
                if (名称 === "免疫") {
                    存档.健康 += 10;
                }
            }
        }
    },
    {
        名称: "迅捷",
        说明: "逃跑率+15%",
        品质: "普通",
        负面: false,
        效果: {
            计算最大逃跑: (计算容器: 计算容器类型) => {
                if (存档.天赋.迅捷) {
                    计算容器.固定加成 += 15;
                }
            }
        }
    },
    {
        名称: "嗜血",
        说明: "嗜血率+12%，嗜血效果翻倍",
        品质: "普通",
        负面: false,
        效果: {
            计算嗜血率: (计算容器: 计算容器类型) => {
                if (存档.天赋.嗜血) {
                    计算容器.固定加成 += 12
                }
            },
            计算嗜血强度: (计算容器: 计算容器类型) => {
                if (存档.天赋.嗜血) {
                    计算容器.百分比加成 += 0.5
                }
            },
        }
    },

    {
        名称: "孤注一掷",
        说明: "赌博成功率+30%，县城和省城的地区额外增加押宝事件",
        品质: "稀有",
        效果: {
            计算赌博成功率: (计算容器: 计算容器类型) => {
                if (存档.天赋.孤注一掷) {
                    计算容器.固定加成 += 30;
                }
            },
            计算地区事件表: (地区事件表) => {
                if (存档.天赋.孤注一掷 && (获取地区名称() === '县城' || 获取地区名称() === '省城')) {
                    地区事件表.push({ 名称: '押宝', 概率: 5 });
                }
            }
        },
    },
    {
        名称: "伏击",
        说明: "暴击率+20%，暴击强度+25%",
        品质: "稀有",
        效果: {
            计算暴击率: (计算容器: 计算容器类型) => {
                if (存档.天赋.伏击) {
                    计算容器.固定加成 += 20;
                }
            },
            计算暴击强度: (计算容器: 计算容器类型) => {
                if (存档.天赋.伏击) {
                    计算容器.固定加成 += 25
                }
            }
        },
    },
    {
        名称: "精力旺盛",
        说明: "最大精力+20",
        品质: "稀有",
        效果: {
            计算最大精力: (计算容器: 计算容器类型) => {
                if (存档.天赋.精力旺盛) {
                    计算容器.固定加成 += 20;
                }
            }
        },
    },
    {
        名称: "冷血",
        说明: "偷钱增加负罪感降低80%，偷钱成功率+12%",
        品质: "稀有",
        效果: {
            计算偷钱成功率: (计算容器: 计算容器类型) => {
                if (存档.天赋.冷血) {
                    计算容器.固定加成 += 12
                }
            },
            计算偷钱增加罪恶: (计算容器: 计算容器类型) => {
                if (存档.天赋.冷血) {
                    计算容器.百分比加成 -= 80;
                }
            }
        },
    },
    {
        名称: "祖传黑刀",
        品质: "稀有",
        说明: `获得黑刀*1`,
        效果: {
            激活天赋: (名称) => {
                if (名称 === "祖传黑刀") {
                    存档.物品.黑刀 += 1
                }
            }
        },
    },
    {
        名称: "格挡术",
        说明: "格挡率+20%，防御力+10%",
        品质: "稀有",
        效果: {
            计算格挡率: (计算容器: 计算容器类型) => {
                if (存档.天赋.格挡术) {
                    计算容器.固定加成 += 20;
                }
            },
            计算最大防御: (计算容器: 计算容器类型) => {
                if (存档.天赋.格挡术) {
                    计算容器.百分比加成 += 0.1;
                }
            }
        },
    },
    {
        名称: "烟鬼",
        说明: "每天重复吸烟没有衰减。",
        品质: "稀有",
        效果: {
            进食后: (食物) => {
                if(存档.天赋.烟鬼){
                    if(食物.名称 === '香烟' || 食物.名称 === '精致香烟'){
                        存档.精力 = 计算最大精力()
                        存档.生命 = 计算最大生命()
                        存档.饥饿 = 计算最大饥饿()
                    }
                }
            }
        },
    },
    {
        名称: "酒鬼",
        说明: "啤酒+3，喝酒必定暴躁，暴躁效果翻倍，喝酒按比例恢复精力",
        品质: "稀有",
        效果: {
            激活天赋: (名称) => {
                if (名称 === "酒鬼") {
                    存档.物品.啤酒 += 3;
                }
            },
            进食后: (食物) => {
                if (存档.天赋.酒鬼 && 食物.名称 === '啤酒') {
                    存档.状态.暴躁 = true;
                }
            },
            计算喝酒恢复精力: (计算容器: 计算容器类型) => {
                if (存档.天赋.酒鬼) {
                    const 最大精力 = 计算最大精力()
                    计算容器.初始值 = Math.floor(最大精力 * 0.2);
                }
            }
        },
    },
    {
        名称: "反弹术",
        说明: "反弹率+20%",
        品质: "稀有",
        效果: {
            计算反弹率: (计算容器: 计算容器类型) => {
                if (存档.天赋.反弹术) {
                    计算容器.固定加成 += 20;
                }
            }
        },
    },
    {
        名称: "意外之财",
        说明: "每天获得0.5元",
        品质: "稀有",
        效果: {
            睡觉结算: (结果文本) => {
                if (存档.天赋.意外之财) {
                    存档.金钱 += 5;
                    结果文本.push('「意外之财：获得0.5元」');
                }
            }
        },
    },

    {
        名称: "奔涌之血",
        说明: "「血力」你的血液充斥着澎湃的力量。攻击力增加最大生命值的15%，最大精力增加10点",
        品质: "传说",
        效果: {
            计算最大精力: (计算容器: 计算容器类型) => {
                if (存档.天赋.奔涌之血) {
                    计算容器.固定加成 += 10;
                }
            },
            计算最大攻击: (计算容器: 计算容器类型) => {
                if (存档.天赋.奔涌之血) {
                    const 生命 = 计算最大生命()
                    计算容器.固定加成 += Math.floor(生命 * 0.15);
                }
            }
        },
    },
    {
        名称: "求生达人",
        说明: "「生存」小时候爱看贝爷荒野求生，熟知各种野外生存常识。前进探索消耗精力减少2点，恢复量增加16点",
        品质: "传说",
        效果: {
            计算前进探索消耗精力: (计算容器: 计算容器类型) => {
                if (存档.天赋.求生达人) {
                    计算容器.固定加成 -= 2;
                }
            },
            计算恢复量: (计算容器: 计算容器类型) => {
                if (存档.天赋.求生达人) {
                    计算容器.固定加成 += 16;
                }
            }
        },
    },
    {
        名称: "职场天选",
        说明: "「职运」老板再来一份工！所有打工事件必定成功，打工收益翻倍，每次打工恢复30精力",
        品质: "传说",
        效果: {
            计算打工成功率: (计算容器: 计算容器类型) => {
                if (存档.天赋.职场天选) {
                    计算容器.初始值 = 100;
                }
            },
            计算打工收益: (计算容器: 计算容器类型) => {
                if (存档.天赋.职场天选) {
                    计算容器.独立乘区 *= 2;
                }
            },
            触发事件后: (事件) => {
                if (存档.天赋.职场天选) {
                    const 名称 = ['搬砖', '服务生', '贴广告', '送水泥']
                    if(名称.includes(事件.名称)){
                        存档.精力 += 30
                    }
                }
            }
        },
    },
    {
        名称: "持枪入门",
        说明: "「手枪」开局获得制式手枪，初始弹药 5 发",
        品质: "传说",
        效果: {
            激活天赋: (名称) => {
                if (名称 === "持枪入门") {
                    存档.物品.枪++;
                    存档.物品.子弹 += 5;
                }
            }
        },
    },
    {
        名称: "荒野拾荒",
        说明: "「探获」捡破烂也能捡出一片天。荒野和山脉探索必定收获，荒野探索没有事件和战斗，获得10熟肉",
        品质: "传说",
        效果: {
            收集前: ({ 物品表, 结果文本 }) => {
                if (存档.天赋.荒野拾荒) {
                    if (获取地区名称() == '荒野' ||获取地区名称() == '山脉' ) {
                        if (结果文本[0] === '什么也没发现！') {
                            let 掉落物 = 抽取物品(物品表, true);
                            结果文本.push(`「荒野拾荒：发现${掉落物}」`)
                        }
                    }
                }
            },
            计算前进探索探索事件权重: (计算容器: 计算容器类型) => {
                if (存档.天赋.荒野拾荒) {
                    if (获取地区名称() == '荒野') {
                        计算容器.百分比加成 = 0;
                    }
                }
            },
            计算前进探索探索战斗权重: (计算容器: 计算容器类型) => {
                if (存档.天赋.荒野拾荒) {
                    if (获取地区名称() == '荒野') {
                        计算容器.百分比加成 = 0;
                    }
                }
            },
            激活天赋: (名称) => {
                if (名称 === "荒野拾荒") {
                    存档.物品.熟肉 += 10;
                }
            }
        },
    },
    {
        名称: "家财万贯",
        说明: "「私财」开局自带 50 元私房钱",
        品质: "传说",
        效果: {
            激活天赋: (名称) => {
                if (名称 === "家财万贯") {
                    存档.金钱 += 500;
                }
            }
        },
    },
    {
        名称: "疾影无踪",
        说明: "「极影」逃跑率+50%，闪避率+20%",
        品质: "传说",
        效果: {
            计算最大逃跑: (计算容器: 计算容器类型) => {
                if (存档.天赋.疾影无踪) {
                    计算容器.固定加成 += 50;
                }
            },
            计算闪避率: (计算容器: 计算容器类型) => {
                if (存档.天赋.疾影无踪) {
                    计算容器.固定加成 += 20;
                }
            }
        },
    },
    {
        名称: "攻防一体",
        说明: "「破势」攻击时的伤害附加自身相等的防御力",
        品质: "传说",
        效果: {
            攻击时: (对局: 对局类型) => {
                if (存档.天赋.攻防一体) {
                    对局.伤害.基础加成 += 对局.主角.防御;
                    对局.结果文本.push('「攻防一体：附加防御力' + 对局.主角.防御 + '点伤害」');
                }
            }
        },
    },
    {
        名称: "超量恢复",
        说明: "「超量」 身体自带过量恢复机制！战斗时生命值可以超量恢复，最大饥饿增加100点，最大精力增加20点",
        效果: {
            攻击后: (对局: 对局类型) => {
                if (!存档.天赋.超量恢复) {
                    if(对局.主角.生命 > 对局.主角.最大生命){
                        对局.主角.生命 = 对局.主角.最大生命
                    }
                }
            },
            被攻击后: (对局: 对局类型) => {
                if (!存档.天赋.超量恢复) {
                    if(对局.主角.生命 > 对局.主角.最大生命){
                        对局.主角.生命 = 对局.主角.最大生命
                    }
                }
            },

            计算最大饥饿: (计算容器: 计算容器类型) => {
                if (存档.天赋.超量恢复) {
                    计算容器.固定加成 += 100;
                }
            },
            计算最大精力: (计算容器: 计算容器类型) => {
                if (存档.天赋.超量恢复) {
                    计算容器.固定加成 += 20;
                }
            }
        },
        品质: "传说",
    },
    {
        名称: "生命同调",
        说明: "「共生」你的体魄和生命力产生了神秘的共鸣！每点健康带来额外7点基础生命值，最大提升量不超过初始最大生命值的70%",
        品质: "传说",
        效果: {
            计算最大生命_修正: (计算容器: 计算容器类型) => {
                const 回复量 = 存档.健康 * 7
                const 最大提升量 = Math.floor(计算容器.初始值 * 0.7)
                计算容器.固定加成 += Math.min(回复量, 最大提升量);
            }
        }
    },
    {
        名称: "稳守天成",
        说明: "「铁壁」长期挨打让你掌握了极限防守的技巧！防御力增加50%，直接掌握平衡和猥琐两种架势！",
        品质: "传说",
        效果: {
            激活天赋: (名称) => {
                if (名称 === "稳守天成") {
                    存档.架势.猥琐 = true;
                    存档.架势.平衡 = true;
                }
            },
            计算最大防御: (计算容器: 计算容器类型) => {
                if (存档.天赋.稳守天成) {
                    计算容器.百分比加成 += 0.5;
                }
            }
        },
    },
    {
        名称: "绝命裁决",
        说明: "「处决」你能准确洞察敌人的弱点！当敌人生命值低于18%时，攻击必定击杀敌人，攻击力增加25%",
        品质: "传说",
        效果: {
            计算最大攻击: (计算容器: 计算容器类型) => {
                if (存档.天赋.绝命裁决) {
                    计算容器.百分比加成 += 25;
                }
            },
            攻击后: (对局: 对局类型) => {
                if (存档.天赋.绝命裁决 && 对局.敌人.生命 < 对局.敌人.最大生命 * 0.18) {
                    对局.敌人.生命 = -9999;
                    对局.结果文本.push('「绝命裁决」');
                }
            }
        },
    },
    {
        名称: "市井通衢",
        说明: "「商契」商店永久开放，开局额外获得 4 元启动资金",
        品质: "传说",
        效果: {
            更新面板: () => {
                if (存档.天赋.市井通衢) {
                    存档.按钮.商店 = true;
                }
            },
            激活天赋: (名称) => {
                if (名称 === "市井通衢") {
                    存档.金钱 += 40;
                }
            }
        },
    },
    {
        名称: "正义之力",
        说明: "「德报」正义即力量！你的负罪小于0时，增加0.75倍的攻击力，每获得一个好人卡，额外增加2%基础伤害，增加老奶奶概率事件",
        品质: "传说",
        效果: {
            计算最大攻击: (计算容器: 计算容器类型) => {
                if (存档.天赋.正义之力) {
                    if (存档.罪恶 < 0) {
                        计算容器.固定加成 += Math.floor(存档.罪恶 * 0.75);
                    }
                    if (存档.物品.好人卡) {
                        计算容器.百分比加成 += 存档.物品.好人卡 * 2 / 100;
                    }
                }
            },
            计算地区事件概率: (事件表) => {
                事件表.push({名称: "扶老奶奶", 概率: 5})
            }
        },
    },
    {
        名称: "枪弹专家",
        说明: "「枪道」获得1把枪和10发子弹，睡觉时有50%概率获得1发子弹，枪击时，基础攻击力增加40%，不使用枪击时，基础伤害增加（枪等级*15%）",
        品质: "传说",
        效果: {
            激活天赋: (名称) => {
                if (名称 === "枪弹专家") {
                    存档.物品.枪 += 1;
                    存档.物品.子弹 += 10;
                }
            },
            睡觉结算: (结果文本) => {
                if (存档.天赋.枪弹专家 && Math.random() * 100 < 50) {
                    存档.物品.子弹 += 1;
                    结果文本.push('「枪运：获得子弹*1」');
                }
            },
            攻击前: (对局: 对局类型) => {
                if (存档.天赋.枪弹专家) {
                    if (对局.主角.其他.枪开关) {
                        对局.攻击.加法乘率 += 40;
                        对局.结果文本.push('「要害打击：基础攻击增加40%」');
                    }
                }
            },
            攻击时: (对局: 对局类型) => {
                if (存档.天赋.枪弹专家) {
                    if (!对局.主角.其他.枪开关) {
                        const 枪等级 = 存档.物品.枪;
                        对局.攻击.加法乘率 += 枪等级 * 15;
                        对局.结果文本.push(`「空气弹：不使用枪击时基础伤害增加${枪等级 * 15}%」`);
                    }
                }
            }
        },
    },

    // 负面天赋
    {
        名称: "骨质疏松",
        说明: "防御力-8",
        品质: "普通",
        效果: {
            计算最大防御: (计算容器: 计算容器类型) => {
                if (存档.天赋.骨质疏松) {
                    计算容器.固定加成 -= 8;
                }
            }
        },
        负面: true
    },
    {
        名称: "脱身乏术",
        说明: "逃跑率-20%",
        品质: "普通",
        效果: {
            计算最大逃跑: (计算容器: 计算容器类型) => {
                if (存档.天赋.脱身乏术) {
                    计算容器.固定加成 -= 20;
                }
            }
        },
        负面: true
    },
    {
        名称: "心灵脆弱",
        说明: "增加10罪恶",
        效果: {
            激活天赋: (名称) => {
                if (名称 === '心灵脆弱') {
                    存档.罪恶 += 10;
                }
            }
        },
        品质: "普通",
        负面: true
    },
    {
        名称: "尼古丁过敏",
        说明: "吸烟精力恢复效果减半",
        效果: {
            计算吸烟恢复精力: (计算容器: 计算容器类型) => {
                if (存档.天赋.尼古丁过敏) {
                    计算容器.独立乘区 *= 0.5;
                }
            } // todo
        },
        品质: "普通",
        负面: true
    },
    {
        名称: "酒精过敏",
        说明: "酒精过敏，不能喝酒",
        效果: {
            使用物品: (食物) => {
                if (存档.天赋.酒精过敏 && (食物.名称 === '啤酒')) {
                    食物.使用 = ({ 提示 }) => 提示(`酒精过敏，不能喝酒！`)
                }
            }
        },
        品质: "普通",
        负面: true
    },

    {
        名称: "四肢乏力",
        说明: "攻击力-10",
        效果: {
            计算最大攻击: (计算容器: 计算容器类型) => {
                if (存档.天赋.四肢乏力) {
                    计算容器.固定加成 -= 10;
                }
            }
        },
        品质: "普通",
        负面: true
    },
    {
        名称: "身无分文",
        说明: "出门没有钱",
        效果: {
            激活天赋: (名称) => {
                if (名称 === '身无分文') {
                    存档.金钱 = 0;
                }
            }
        },
        品质: "普通",
        负面: true
    },
    {
        名称: "身体虚弱",
        品质: "稀有",
        说明: "最大生命值-10，健康-10",
        效果: {
            计算最大生命: (计算容器: 计算容器类型) => {
                if (存档.天赋.身体虚弱) {
                    计算容器.固定加成 -= 10;
                }
            },
            激活天赋: (名称) => {
                if (名称 === '身体虚弱') {
                    存档.健康 -= 10;
                }
            }
        },
        负面: true
    },
    {
        名称: "弱不禁风",
        品质: "稀有",
        说明: "最大攻击、防御、生命值-5，敌人逃跑率-30%",
        效果: {
            计算最大攻击: (计算容器: 计算容器类型) => {
                if (存档.天赋.弱不禁风) {
                    计算容器.固定加成 -= 5;
                }
            },
            计算最大防御: (计算容器: 计算容器类型) => {
                if (存档.天赋.弱不禁风) {
                    计算容器.固定加成 -= 5;
                }
            },
            计算最大生命: (计算容器: 计算容器类型) => {
                if (存档.天赋.弱不禁风) {
                    计算容器.固定加成 -= 5;
                }
            },
            战斗初始化: (对局) => {
                if (存档.天赋.弱不禁风) {
                    对局.敌人.逃跑 -= 30;
                }
            }
        },
        负面: true
    },

    {
        名称: "粗鄙",
        说明: "伙伴初始好感-20",
        效果: {
            激活天赋: (名称) => {
                if (名称 === '粗鄙') {
                    存档.伙伴.晓月好感 -= 20
                    存档.伙伴.碧瑶好感 -= 20
                    存档.伙伴.小兰好感 -= 20
                }
            }
        },
        品质: "传说",
        负面: true
    },
    {
        名称: "讷言",
        说明: "聊天消耗精力+3",
        效果:  {
            计算聊天消耗精力: (计算容器: 计算容器类型) => {
                if (存档.天赋.讷言) {
                    计算容器.固定加成 += 5
                }
            }
        },
        品质: "传说",
        负面: true
    },
    {
        名称: "文盲",
        说明: "读书消耗精力+5",
        效果:  {
            计算读书消耗精力: (计算容器: 计算容器类型) => {
                if (存档.天赋.文盲) {
                    计算容器.固定加成 += 5
                }
            }
        },
        品质: "传说",
        负面: true
    }
]
