import { 对局类型 } from "../场景脚本/战斗";
import { 抽取物品 } from "../方法函数/公共函数";
import { 计算容器类型, 计算最大生命, 计算最大精力, 计算最大防御 } from "../方法函数/属性计算"
import { 存档 } from "../管理器/存档管理器"
import { 设置 } from "../管理器/设置管理器";
import { 获取地区名称 } from "./地区表";

export interface 天赋项目类型 {
    名称: string,
    说明: string,
    品质: string,
    条件?: boolean,
    效果?: Record<string, (a: any, b: any) => void>,
    负面?: boolean,
}

export const 默认天赋表: 天赋项目类型[] = [
    // 普通天赋
    {
        名称: "抗揍",
        说明: "防御力+8",
        品质: "普通",
        效果: {
            计算最大防御: (计算容器: 计算容器类型) => {
                if (存档.天赋.抗揍) {
                    计算容器.固定加成 += 8;
                }
            }
        },
        条件: true,
        负面: false,
    },
    {
        名称: "零花钱",
        说明: "获得1.6元",
        品质: "普通",
        效果: {
            激活天赋: (名称) => {
                if (名称 === "零花钱") {
                    存档.金钱 += 16;
                }
            }
        },
        负面: false,
    },
    {
        名称: "免疫力强",
        说明: "传说级以下的负面天赋无效，健康+10",
        品质: "普通",
        效果: {
            更新主页: () => {
                if (存档.天赋.免疫力强) {
                    const 普通负面天赋 = 默认天赋表.filter((天赋) => 天赋.负面 && 天赋.品质 !== '传说')
                    普通负面天赋.forEach((天赋) => {
                        const 天赋名称 = 天赋.名称
                        if (存档.天赋[天赋名称]) {
                            存档.天赋[天赋名称] = false
                        }
                    })
                }
            },
            激活天赋: (名称) => {
                if (名称 === "免疫力强") {
                    存档.健康 += 10;
                }
            }
        },
    },
    {
        名称: "火力旺",
        说明: "最大生命+100",
        品质: "普通",
        效果: {
            计算最大生命: (计算容器: 计算容器类型) => {
                if (存档.天赋.火力旺) {
                    计算容器.固定加成 += 100;
                }
            },
        },
    },
    {
        名称: "溜得快",
        说明: "逃跑率+15%",
        品质: "普通",
        效果: {
            计算最大逃跑: (计算容器: 计算容器类型) => {
                if (存档.天赋.溜得快) {
                    计算容器.固定加成 += 15;
                }
            }
        }
    },
    {
        名称: "嗜血",
        说明: "嗜血率+12%",
        品质: "普通",
        效果: {
            计算嗜血率: (计算容器: 计算容器类型) => {
                if (存档.天赋.嗜血) {
                    计算容器.固定加成 += 12
                }
            },
        },
    },
    {
        名称: "强壮",
        说明: "攻击力+15，生命值+50",
        品质: "普通",
        效果: {
            计算最大攻击: (计算容器: 计算容器类型) => {
                if (存档.天赋.强壮) {
                    计算容器.固定加成 += 15;
                }
            },
            计算最大生命: (计算容器: 计算容器类型) => {
                if (存档.天赋.强壮) {
                    计算容器.固定加成 += 50;
                }
            },
        },
    },

    {
        名称: "赌徒潜质",
        说明: "从小买方便面集卡没集齐过，但依然坚信下一次一定能翻盘！赌博成功率+30%，县城和省城的地区事件表中额外增加押宝事件",
        品质: "稀有",
        效果: {
            计算赌博成功率: (计算容器: 计算容器类型) => {
                if (存档.天赋.赌徒潜质) {
                    计算容器.固定加成 += 30;
                }
            },
            计算地区事件表: (地区事件表) => {
                if (存档.天赋.赌徒潜质 && (获取地区名称() === '县城' || 获取地区名称() === '省城')) {
                    地区事件表.push({ 名称: '押宝', 概率: 10 });
                }
            }
        },
    },
    {
        名称: "暗杀直觉",
        说明: "你对偷袭有深刻的理解！暴击率+20%，暴击强度+25%",
        品质: "稀有",
        效果: {
            计算暴击率: (计算容器: 计算容器类型) => {
                if (存档.天赋.暗杀直觉) {
                    计算容器.固定加成 += 20;
                }
            },
            计算暴击强度: (计算容器: 计算容器类型) => {
                if (存档.天赋.暗杀直觉) {
                    计算容器.固定加成 += 25
                }
            }
        },
    },
    {
        名称: "精力旺盛",
        说明: "你的精力超乎常人！最大精力+20点",
        品质: "稀有",
        效果: {
            计算最大精力: (计算容器: 计算容器类型) => {
                if (存档.天赋.精力旺盛) {
                    计算容器.固定加成 += 20;
                }
            }
        },
    },
    {
        名称: "冷血",
        说明: "你擅长偷钱！偷钱增加负罪感降低80%，偷钱数固定0.7元！",
        品质: "稀有",
        效果: {
            计算偷钱数: (计算容器: 计算容器类型) => {
                if (存档.天赋.冷血) {
                    计算容器.初始值 = 7;
                }
            },
            计算偷钱增加罪恶: (计算容器: 计算容器类型) => {
                if (存档.天赋.冷血) {
                    计算容器.百分比加成 -= 80;
                }
            }
        },
    },
    {
        名称: "传家宝",
        品质: "稀有",
        get 说明() {
            let 说明 = `出门前顺手带上了家传的宝贝！获得`
            return 存档.其他.传家宝物品 ? 说明 + 存档.其他.传家宝物品 : 说明 + "随机若干物品（进入面板查看）";
        },
        效果: {
            激活天赋: (名称) => {
                if (名称 === "传家宝") {
                    const 家传宝物列表 = [
                        { 名称: '红夹克', 数量: 1, 概率: 20 },
                        { 名称: '黑刀', 数量: 1, 概率: 20 },
                        { 名称: '皮衣', 数量: 1, 概率: 20 },
                        { 名称: '匕首', 数量: 1, 概率: 20 },
                        { 名称: '晓风披肩', 数量: 1, 概率: 20 },
                        { 名称: '放大镜', 数量: 10, 概率: 20 },
                        { 名称: '幸运石', 数量: 10, 概率: 20 }
                    ]
                    存档.其他.传家宝物品 = 抽取物品(家传宝物列表, true)
                }
            }
        },
    },
    {
        名称: "家传把式",
        说明: "爷爷的爷爷传下来的防身术，核心要领就四个字：抱头蹲防！格挡率+20%，防御力+10%",
        品质: "稀有",
        效果: {
            计算格挡率: (计算容器: 计算容器类型) => {
                if (存档.天赋.家传把式) {
                    计算容器.固定加成 += 20;
                }
            },
            计算最大防御: (计算容器: 计算容器类型) => {
                if (存档.天赋.家传把式) {
                    计算容器.百分比加成 += 0.1;
                }
            }
        },
    },
    {
        名称: "烟鬼",
        说明: "我命由我不由天（咳嗽），健康-5，吸烟后额外增加1烟瘾，吸烟没有每日衰减。",
        品质: "稀有",
        效果: {
            激活天赋: (名称) => {
                if (名称 === "烟鬼") {
                    存档.健康 -= 5;
                }
            },
            计算吸烟增加烟瘾: (计算容器: 计算容器类型) => {
                if (存档.天赋.烟鬼) {
                    计算容器.固定加成++;
                }
            },
            计算吸烟回复率: (计算容器: 计算容器类型) => {
                if (存档.天赋.烟鬼) {
                    计算容器.固定加成 += 存档.精力;
                }
            } // todo
        },
    },
    {
        名称: "酒鬼",
        说明: "啤酒+3，喝酒必定暴躁，暴躁效果翻倍，喝酒按比例恢复精力",
        品质: "稀有",
        效果: {
            激活天赋: (名称) => {
                if (名称 === "酒鬼") {
                    存档.物品.啤酒 += 3;
                }
            },
            使用食物后: (食物) => {
                if (存档.天赋.酒鬼 && 食物.名称 === '啤酒') {
                    存档.状态.暴躁 = true;
                }
            },
            计算喝酒恢复精力: (计算容器: 计算容器类型) => {
                if (存档.天赋.酒鬼) {
                    const 最大精力 = 计算最大精力()
                    计算容器.初始值 = Math.floor(最大精力 * 0.2);
                }
            }
        },
    },
    {
        名称: "反弹体质",
        说明: "反弹率+20%",
        品质: "稀有",
        效果: {
            计算反弹率: (计算容器: 计算容器类型) => {
                if (存档.天赋.反弹体质) {
                    计算容器.固定加成 += 20;
                }
            }
        },
    },
    {
        名称: "家有薄财",
        说明: "可能是梦游时打的工？每天获得0.5元",
        品质: "稀有",
        效果: {
            睡觉结算: (结果文本) => {
                if (存档.天赋.家有薄财) {
                    存档.金钱 += 5;
                    结果文本.push('【家有薄财：获得0.5元】');
                }
            }
        },
    },

    {
        名称: "澎湃之血",
        说明: "你的血液充斥着澎湃的力量，攻击力增加最大生命值的15%，最大精力增加10点！",
        品质: "传说",
        效果: {
            计算最大精力: (计算容器: 计算容器类型) => {
                if (存档.天赋.澎湃之血) {
                    计算容器.固定加成 += 10;
                }
            },
            计算最大攻击: (计算容器: 计算容器类型) => {
                if (存档.天赋.澎湃之血) {
                    const 生命 = 计算最大生命()
                    计算容器.固定加成 += Math.floor(生命 * 0.15);
                }
            }
        },
    },
    {
        名称: "求生大师",
        说明: "小时候喜欢看贝爷的荒野求生，熟知各种野外生存常识。前进探索消耗精力减少2点，恢复量增加16点",
        品质: "传说",
        效果: {
            计算前进探索消耗精力: (计算容器: 计算容器类型) => {
                if (存档.天赋.求生大师) {
                    计算容器.固定加成 -= 2;
                }
            },
            计算恢复量: (计算容器: 计算容器类型) => {
                if (存档.天赋.求生大师) {
                    计算容器.固定加成 += 16;
                }
            }
        },
    },
    {
        名称: "天选打工人",
        说明: "老板再来一份工！所有打工事件必定成功，打工收益翻倍，每次打工恢复30精力",
        效果: {
            计算打工成功率: (计算容器: 计算容器类型) => {
                if (存档.天赋.天选打工人) {
                    计算容器.初始值 = 100;
                }
            },
            计算打工收益: (计算容器: 计算容器类型) => {
                if (存档.天赋.天选打工人) {
                    计算容器.独立乘区 *= 2;
                }
            },
            触发事件后: (事件) => {
                if (存档.天赋.天选打工人) {
                    const 名称 = ['搬砖', '服务生', '贴广告', '送水泥']
                    if(名称.includes(事件.名称)){
                        存档.精力 += 30
                    }
                }
            }
        },
        品质: "传说",
    },
    {
        名称: "夺宝达人",
        说明: "你对宝物有独特的嗅觉！击败BOSS必然掉落宝物",
        效果: {
            计算击败BOSS掉落概率: (计算容器: 计算容器类型) => {
                if (存档.天赋.夺宝达人) {
                    计算容器.固定加成 += 100;
                }
            } // todo 待验证
        },
        品质: "传说",
    },
    {
        名称: "持枪者",
        说明: "获得一把手枪和5发子弹",
        效果: {
            激活天赋: (名称) => {
                if (名称 === "持枪者") {
                    存档.物品.枪++;
                    存档.物品.子弹 += 5;
                }
            }
        },
        品质: "传说",
    },
    {
        名称: "拾荒者",
        说明: "捡破烂也能捡出一片天！荒野和山脉探索必定收获，荒野探索没有事件和战斗，获得10熟肉",
        效果: {
            收集前: ({ 物品表, 结果文本 }) => {
                if (存档.天赋.拾荒者) {
                    if (结果文本[0] === '什么也没发现！') {
                        let 掉落物 = 抽取物品(物品表, true);
                        结果文本.push(`【拾荒者：发现${掉落物}】`)
                    }
                }
            },
            计算前进探索探索事件权重: (计算容器: 计算容器类型) => {
                if (存档.天赋.拾荒者) {
                    if (获取地区名称() == '荒野') {
                        计算容器.百分比加成 = 0;
                    }
                }
            },
            计算前进探索探索战斗权重: (计算容器: 计算容器类型) => {
                if (存档.天赋.拾荒者) {
                    if (获取地区名称() == '荒野') {
                        计算容器.百分比加成 = 0;
                    }
                }
            },
            激活天赋: (名称) => {
                if (名称 === "拾荒者") {
                    存档.物品.熟肉 += 10;
                }
            }
        },
        品质: "传说",
    },
    {
        名称: "私房钱",
        说明: "获得50元",
        效果: {
            激活天赋: (名称) => {
                if (名称 === "私房钱") {
                    存档.金钱 += 500;
                }
            }
        },
        品质: "传说",
    },
    // {
    //     名称: "粉碎",
    //     说明: "你的攻击无视格挡，基础伤害增加28%",
    //     效果: {
    //         // todo
    //         攻击时: (对局: 对局类型) => {
    //             if (存档.天赋.粉碎) {
    //                 对局.伤害.加法乘率 += 0.28
    //             }
    //         },
    //     },
    //     品质: "传说",
    // },
    {
        名称: "极影",
        说明: "逃跑率+50%，闪避率+20%",
        效果: {
            计算最大逃跑: (计算容器: 计算容器类型) => {
                if (存档.天赋.极影) {
                    计算容器.固定加成 += 50;
                }
            },
            计算闪避率: (计算容器: 计算容器类型) => {
                if (存档.天赋.极影) {
                    计算容器.固定加成 += 20;
                }
            }
        },
        品质: "传说",
    },
    {
        名称: "震荡",
        说明: "攻击时的伤害附加自身相等的防御力",
        效果: {
            攻击时: (对局: 对局类型) => {
                if (存档.天赋.震荡) {
                    对局.伤害.基础加成 += 对局.主角.防御;
                    对局.结果文本.push('【震荡：附加防御力' + 对局.主角.防御 + '点伤害】');
                }
            }
        },
        品质: "传说",
    },
    {
        名称: "超量恢复",
        说明: "饥一顿饱一顿，身体自带过量恢复机制！战斗时生命值可以超量恢复，最大饥饿增加100点，最大精力增加20点",
        效果: {
            攻击后: (对局: 对局类型) => {
                if (!存档.天赋.超量恢复) {
                    if(对局.主角.生命 > 对局.主角.最大生命){
                        对局.主角.生命 = 对局.主角.最大生命
                    }
                }
            },
            被攻击后: (对局: 对局类型) => {
                if (!存档.天赋.超量恢复) {
                    if(对局.主角.生命 > 对局.主角.最大生命){
                        对局.主角.生命 = 对局.主角.最大生命
                    }
                }
            },

            计算最大饥饿: (计算容器: 计算容器类型) => {
                if (存档.天赋.超量恢复) {
                    计算容器.固定加成 += 100;
                }
            },
            计算最大精力: (计算容器: 计算容器类型) => {
                if (存档.天赋.超量恢复) {
                    计算容器.固定加成 += 20;
                }
            }
        },
        品质: "传说",
    },
    {
        名称: "生命共鸣",
        品质: "传说",
        说明: "你的体魄和生命力产生了神秘的共鸣！每点健康带来额外7点基础生命值，最大提升量不超过初始最大生命值的70%",
        效果: {
            计算最大生命_修正: (计算容器: 计算容器类型) => {
                const 回复量 = 存档.健康 * 7
                const 最大提升量 = Math.floor(计算容器.初始值 * 0.7)
                计算容器.固定加成 += Math.min(回复量, 最大提升量);
            }
        }
    },
    {
        名称: "善守者",
        说明: "长期挨打让你掌握了极限防守的技巧！防御力增加50%，直接掌握平衡和猥琐两种架势！",
        效果: {
            激活天赋: (名称) => {
                if (名称 === "善守者") {
                    存档.架势.猥琐 = true;
                    存档.架势.平衡 = true;
                }
            },
            计算最大防御: (计算容器: 计算容器类型) => {
                if (存档.天赋.善守者) {
                    计算容器.百分比加成 += 0.5;
                }
            }
        },
        品质: "传说",
    },
    {
        名称: "斩杀",
        说明: "你能准确洞察敌人的弱点！当敌人生命值低于18%时，攻击必定击杀敌人，攻击力增加25%",
        效果: {
            计算最大攻击: (计算容器: 计算容器类型) => {
                if (存档.天赋.斩杀) {
                    计算容器.百分比加成 += 25;
                }
            },
            攻击后: (对局: 对局类型) => {
                if (存档.天赋.斩杀 && 对局.敌人.生命 < 对局.敌人.最大生命 * 0.18) {
                    对局.敌人.生命 = -9999;
                    对局.结果文本.push('【斩杀！！！】');
                }
            }
        },
        品质: "传说",
    },
    {
        名称: "商店之友",
        说明: "商店老板的铁杆粉丝！商代常驻，获得4元",
        效果: {
            更新面板: () => {
                if (存档.天赋.商店之友) {
                    存档.按钮.商店 = true;
                }
            },
            激活天赋: (名称) => {
                if (名称 === "商店之友") {
                    存档.金钱 += 40;
                }
            }
        },
        品质: "传说",
    },
    {
        名称: "仁者",
        说明: "正义即力量！你的负罪小于0时，增加0.1倍的攻击力，每获得一个好人卡，额外增加2%基础伤害，增加老奶奶概率事件",
        效果: {
            计算最大攻击: (计算容器: 计算容器类型) => {
                if (存档.天赋.仁者) {
                    if (存档.罪恶 < 0) {
                        计算容器.固定加成 += Math.floor(存档.罪恶 * 0.75);
                    }
                    if (存档.物品.好人卡) {
                        计算容器.百分比加成 += 0.02 * 存档.物品.好人卡;
                    }
                }
            },
            计算地区事件概率: (事件表) => {
                事件表.push({名称: "扶老奶奶", 概率: 5})
            }
        },
        品质: "传说",
    },
    {
        名称: "枪魂",
        说明: "获得1把枪和10发子弹，睡觉时有50%概率获得1发子弹，枪击时，基础攻击力增加40%，不使用枪击时，基础伤害增加（枪等级*15%）",
        效果: {
            激活天赋: (名称) => {
                if (名称 === "枪魂") {
                    存档.物品.枪 += 1;
                    存档.物品.子弹 += 10;
                }
            },
            睡觉结算: (结果文本) => {
                if (存档.天赋.枪魂 && Math.random() * 100 < 50) {
                    存档.物品.子弹 += 1;
                    结果文本.push('【枪运：获得子弹*1】');
                }
            },
            攻击前: (对局: 对局类型) => {
                if (存档.天赋.枪魂) {
                    if (对局.主角.其他.枪开关) {
                        对局.攻击.加法乘率 += 40;
                        对局.结果文本.push('【要害打击：基础攻击增加40%】');
                    }
                }
            },
            攻击时: (对局: 对局类型) => {
                if (存档.天赋.枪魂) {
                    if (!对局.主角.其他.枪开关) {
                        const 枪等级 = 存档.物品.枪;
                        对局.攻击.加法乘率 += 枪等级 * 15;
                        对局.结果文本.push(`【空气弹：不使用枪击时基础伤害增加${枪等级 * 15}%】`);
                    }
                }
            }
        },
        品质: "传说",
    },
    // 负面天赋
    {
        名称: "骨质疏松",
        说明: "防御力-8",
        效果: {
            计算最大防御: (计算容器: 计算容器类型) => {
                if (存档.天赋.骨质疏松) {
                    计算容器.固定加成 -= 8;
                }
            }
        },
        品质: "普通",
        负面: true
    },
    {
        名称: "跑得慢",
        说明: "逃跑率-20%",
        效果: {
            计算最大逃跑: (计算容器: 计算容器类型) => {
                if (存档.天赋.跑得慢) {
                    计算容器.固定加成 -= 20;
                }
            }
        },
        品质: "普通",
    },
    {
        名称: "身体虚弱",
        说明: "从小身体虚弱，最大生命值-10，健康-10",
        效果: {
            计算最大生命: (计算容器: 计算容器类型) => {
                if (存档.天赋.身体虚弱) {
                    计算容器.固定加成 -= 10;
                }
            },
            激活天赋: (名称) => {
                if (名称 === '身体虚弱') {
                    存档.健康 -= 10;
                }
            }
        },
        品质: "普通",
        负面: true
    },
    {
        名称: "精神脆弱",
        说明: "增加10点罪恶感",
        效果: {
            激活天赋: (名称) => {
                if (名称 === '精神脆弱') {
                    存档.罪恶 += 10;
                }
            }
        },
        品质: "普通",
    },
    {
        名称: "吸烟不耐受",
        说明: "尼古丁过敏，吸烟后精力恢复效果减半",
        效果: {
            计算吸烟恢复精力: (计算容器: 计算容器类型) => {
                if (存档.天赋.吸烟不耐受) {
                    计算容器.独立乘区 *= 0.5;
                }
            }
        },
        品质: "普通",
        负面: true
    },
    {
        名称: "酒精不耐受",
        说明: "酒精不耐受，不可喝酒",
        效果: {
            使用物品: (食物) => {
                if (存档.天赋.酒精不耐受 && (食物.名称 === '啤酒')) {
                    食物.使用 = ({ 提示 }) => 提示(`酒精不耐受，不能喝酒！`)
                }
            }
        },
        品质: "普通",
        负面: true
    },
    {
        名称: "弱不禁风",
        说明: "最大攻击、防御、生命值-5，敌人逃跑率-30%",
        效果: {
            计算最大攻击: (计算容器: 计算容器类型) => {
                if (存档.天赋.弱不禁风) {
                    计算容器.固定加成 -= 5;
                }
            },
            计算最大防御: (计算容器: 计算容器类型) => {
                if (存档.天赋.弱不禁风) {
                    计算容器.固定加成 -= 5;
                }
            },
            计算最大生命: (计算容器: 计算容器类型) => {
                if (存档.天赋.弱不禁风) {
                    计算容器.固定加成 -= 5;
                }
            },
            战斗初始化: (对局) => {
                if (存档.天赋.弱不禁风) {
                    对局.敌人.逃跑 -= 30;
                }
            }
        },
        品质: "普通",
        负面: true
    },
    {
        名称: "四肢乏力",
        说明: "攻击力-10",
        效果: {
            计算最大攻击: (计算容器: 计算容器类型) => {
                if (存档.天赋.四肢乏力) {
                    计算容器.固定加成 -= 10;
                }
            }
        },
        品质: "普通",
        负面: true
    },
    {
        名称: "出门忘记带钱",
        说明: "出门忘记带钱了",
        效果: {
            激活天赋: (名称) => {
                if (名称 === '出门忘记带钱') {
                    存档.金钱 = 0;
                }
            }
        },
        品质: "普通",
        负面: true
    },

]
