import { 概率类型, 跳转场景 } from "../方法函数/公共函数";
import { 保存存档, 删除存档, 存档 } from "../管理器/存档管理器";
import { 随机分散文本和战斗元素 } from "../方法函数/动画效果";
import { 对局类型 } from "../场景脚本/战斗";
import { 计算最大生命 } from "../方法函数/属性计算";
import { 设置 } from "../管理器/设置管理器";

interface 敌人定义类型 {
	名称: string,
	显示名称?: string,
	方法?: string,
	等级?: number,
	生命: number,
	攻击?: number,
	防御?: number,
	最大生命?: number,
	逃跑?: number,
	压制?: number,
	增加声望?: number,
	增加属性?: number,
	损失健康?: number,
	出场语?: string ,
	掉落物?: 概率类型[],
	战斗初始化?:  (对局: 对局类型) => string | void,

	攻击前?:  (对局: 对局类型) => string | void,
	攻击时?:  (对局: 对局类型) => string | void,
	攻击后?:  (对局: 对局类型) => string | void,
	被攻击前?:  (对局: 对局类型) => string | void,
	被攻击时?:  (对局: 对局类型) => string | void,
	被攻击后?:  (对局: 对局类型) => string | void,

	胜利效果?:  (对局: 对局类型) => string | void,
	失败效果?:  (对局: 对局类型) => string | void,
}

export const 默认敌人表: 敌人定义类型[] = [
	// 荒野系列
	{
		名称: "小蚊",
		生命: 45,
		压制: -50,
		攻击: 5,
		损失健康: 1,
		掉落物: [
			{
				概率: 50,
				数量: 1,
				名称: "果子",
			},
			{
				概率: 50,
				数量: 1,
				名称: "伤药",
			},
		],
		方法: "叮咬",
		攻击后: (对局: 对局类型) => {
			对局.敌人.生命 += 对局.伤害.计算结果
			return `【${对局.敌人.名称}吸取了${对局.伤害.计算结果}点生命！】`;
		},
		失败效果: () => {
			存档.其他.消灭蚊子数++
			存档.物品.蚊子尸体++;
			return `【你已消灭${存档.其他.消灭蚊子数}只蚊子，获得「蚊子尸体」*1】`;
		},
	},
	{
		名称: "小小兔",
		等级: 3,
		生命: 255,
		防御: 5,
		压制: 100,
		逃跑: 40,
		损失健康: 1,
		掉落物: [
			{
				概率: 100,
				数量: 1,
				名称: "生肉",
			},
		],
		方法: "啾啾",
		攻击时: (对局: 对局类型) => {
			存档.物品.果子++;
			return `【${对局.敌人.名称}向你吐出一个果子！获得「果子」*1】`;
		},
	},
	{
		名称: "小小蛇",
		等级: 5,
		生命: 200,
		攻击: 23,
		损失健康: 1,
		方法: "咬咬",
		掉落物: [
			{
				概率: 50,
				数量: 1,
				名称: "生肉",
			},
			{
				概率: 60,
				数量: 1,
				名称: "伤药",
			},
		],
	},
	{
		名称: "小青（精英）",
		等级: 8,
		生命: 315,
		攻击: 11,
		压制: -10,
		损失健康: 2,
		增加声望: 1,
		增加属性: 2,
		出场语: "发现一条翠绿色的蛇！",
		掉落物: [
			{
				概率: 100,
				数量: 1,
				名称: "生肉",
			},
			{
				概率: 100,
				数量: 1,
				名称: "伤药",
			},
			{
				概率: 5,
				数量: 1,
				名称: "晓月手链",
			},
		],
		方法: "蛇毒",
		攻击时: (对局: 对局类型) => {
			const 伤害加成 = 对局.伤害.初始值 * 对局.敌人.其他.技能点数
			对局.伤害.基础加成 += 伤害加成
			对局.敌人.其他.技能点数++;
			return `【中毒：伤害附加${伤害加成}点（${对局.敌人.其他.技能点数}层）】`;
		},
	},
	{
		名称: "蚊.媛",
		等级: 29,
		生命: 599,
		压制: 9999,
		出场语: "%&#@*#%*%##%！",
		掉落物: [
			{
				概率: 1,
				数量: 1,
				名称: "眼泪",
			},
		],
		攻击后: (对局: 对局类型) => {
			对局.敌人.生命 -= 200;
			对局.主角.生命 += 200;
			return `【${对局.敌人.名称}在给你输送营养！你增加200点生命！】`;
		},
		失败效果: (对局: 对局类型) => {
			存档.其他.消灭蚊子数++;
			存档.物品.蚊子尸体++;
			return `【${对局.敌人.名称}变成了一具干尸！你已消灭${存档.其他.消灭蚊子数}只蚊子，获得「蚊子尸体」*1】`;
		},
	},
	{
		名称: "泰坦巨蟒（特殊）",
		等级: 25,
		生命: 875,
		压制: -30,
		损失健康: 1,
		增加声望: 3,
		增加属性: 3,
		出场语: "特注：战斗结束后巨蟒不会回满血！！！",
		掉落物: [
			{
				概率: 100,
				数量: 3,
				名称: "生肉",
			},
			{
				概率: 80,
				数量: 2,
				名称: "金钱",
			},
			{
				概率: 60,
				数量: 2,
				名称: "金钱",
			},
			{
				概率: 40,
				数量: 2,
				名称: "金钱",
			},
			{
				概率: 20,
				数量: 2,
				名称: "金钱",
			},
		],
		战斗初始化: (对局: 对局类型) => {
			const 真实满血 = 对局.敌人.生命;
			对局.敌人.最大生命 = 真实满血;

			if(!存档.特殊敌人["泰坦巨蟒（特殊）"]){
				存档.特殊敌人["泰坦巨蟒（特殊）"] = {
					生命: 真实满血,
				}
			}else{
				对局.敌人.生命 = 存档.特殊敌人["泰坦巨蟒（特殊）"].生命;

				if(对局.敌人.生命 <= 0){
					对局.敌人.生命 = 真实满血;
					存档.特殊敌人["泰坦巨蟒（特殊）"].生命 = 真实满血;
				}
			}
},
		方法: "缠绕",
		被攻击后: (对局: 对局类型) => {
			存档.特殊敌人["泰坦巨蟒（特殊）"].生命 = 对局.敌人.生命;
		},
		胜利效果: (对局: 对局类型) => {
			存档.特殊敌人["泰坦巨蟒（特殊）"].生命 = 对局.敌人.生命;
		},
		失败效果: (对局: 对局类型) => {
			存档.特殊敌人["泰坦巨蟒（特殊）"].生命 = 对局.敌人.生命;
		},
		攻击前: (对局: 对局类型) => {
			对局.攻击.基础加成 += Math.floor(0.07 * 对局.敌人.生命)
		}
	},

	// 县城敌人
	{
		名称: "葬爱.蚊乐队",
		等级: 8,
		生命: 315,
		损失健康: 1,
		出场语: "vi vvi o o o",
		攻击: 32,
		掉落物: [
			{
				概率: 50,
				数量: 1,
				名称: "果子",
			},
			{
				概率: 100,
				数量: 1,
				名称: "伤药",
			},
		],
		方法: "上下",
		失败效果: () => {
			存档.其他.消灭蚊子数 += 2;
			存档.物品.蚊子尸体 += 2
			return `【你已消灭${存档.其他.消灭蚊子数}只蚊子，获得「蚊子尸体」*2】`;
		},
	},
	{
		名称: "小混混",
		等级: 11,
		生命: 410,
		攻击: 43,
		损失健康: 1,
		出场语: "“你笑啥？啊？！”",
		掉落物: [
			{
				概率: 100,
				数量: 1,
				名称: "伤药",
			},
			{
				概率: 50,
				数量: 2,
				名称: "金钱",
			},
		],
		方法: "普攻",
		被攻击时: (对局: 对局类型) => {
			if (Math.random() * 100 < 25) {
				对局.伤害.独立乘区 *= 0
				return `【${对局.敌人.名称}使用「格挡」！（25%触发）】`;
			}
		},
	},
	{
		名称: "丐帮304代弟子",
		等级: 16,
		生命: 575,
		攻击: 63,
		防御: 15,
		压制: -10,
		损失健康: 1,
		出场语: "“兄弟，这是我们的地盘耶~”",
		掉落物: [
			{
				概率: 50,
				数量: 1,
				名称: "熟肉",
			},
			{
				概率: 100,
				数量: 1,
				名称: "伤药",
			},
			{
				概率: 5,
				数量: 1,
				名称: "创可贴",
			},
		],
		方法: "丐拳",
		被攻击时: (对局: 对局类型) => {
			if (Math.random() * 100 < 25) {
				const 反震伤害 = 对局.主角.攻击 - 对局.主角.防御
				对局.主角.生命 -= 反震伤害;
				return `【${对局.敌人.名称}使用「反震」，你损失${反震伤害}点生命！】`;
			}
		},
	},
	{
		名称: "恶霸（精英）",
		等级: 20,
		生命: 750,
		攻击: 50,
		防御: 20,
		压制: -30,
		损失健康: 1,
		出场语: "“不批准，也敢翻垃圾桶？”",
		掉落物: [
			{
				概率: 100,
				数量: 3,
				名称: "金钱",
			},
			{
				概率: 100,
				数量: 1,
				名称: "伤药",
			},
			{
				概率: 5,
				数量: 1,
				名称: "放大镜",
			},
		],
		方法: '咆哮',
		攻击前: (对局: 对局类型) => {
			对局.攻击.基础加成 += 0.25 * 对局.敌人.生命
		}
	},
	{
		名称: "麻城女警",
		等级: 65,
		生命: 2145,
		压制: 100,
		出场语: "“别跑！还不快回家喝奶去！”",
		掉落物: [
			{
				概率: 100,
				数量: 1,
				名称: "金钱",
			},
			{
				概率: 100,
				数量: 1,
				名称: "伤药",
			},
			{
				概率: 15,
				数量: 1,
				名称: "小裤裤",
			},
		],
		攻击时: (对局: 对局类型) => {
			对局.敌人.其他.技能点数++;
			if (对局.敌人.其他.技能点数 <= 3) {
				if (Math.random() * 100 < 75) {
					return `【${对局.敌人.名称}操起电棍，向你打来！但是被你躲开啦~】`;
				}else{
					对局.主角.生命 -= 999;
					return "【你被电棍击中！损失999点生命！】";
				}
			}
			对局.敌人.生命 -= 9999;
		},
		失败效果: (对局: 对局类型) => {
			return  `【${对局.敌人.名称}气急败坏！一棍打在自己脑门上，晕了过去\n_8(:з」∠)_】`
		},
		胜利效果: (对局: 对局类型) => {
			存档.生命 = 计算最大生命();
			return "【你被带到警局，小姐姐给你包扎了下伤口。然后，被放了出来...生命全恢复！】"
		},
	},
	{
		名称: "煤老板",
		等级: 17,
		生命: 545,
		防御: 40,
		压制: 100,
		逃跑: 20,
		出场语: "“我真的是一分钱也没有啊”",
		掉落物: [
			{
				概率: 100,
				数量: 10,
				名称: "金钱",
			},
		],
		攻击时: (对局: 对局类型) => {
			存档.金钱++;
			对局.敌人.逃跑 += 20
			return `【${对局.敌人.名称}丢了你0.1元，准备要溜了！】`;
		},
	},
	{
		名称: "城管104小分队",
		等级: 45,
		生命: 1535,
		攻击: 99,
		压制: 20,
		增加声望: 3,
		get 出场语() {
			if(存档.物品.板砖 >= 21){
				return "“这里不许囤积板砖！听到没！”"
			}
			return "“这里不许睡觉！听到没！”"
		},
		掉落物: [
			{
				概率: 100,
				数量: 2,
				名称: "白色粉末",
			},
		],
		被攻击前: (对局: 对局类型) => {
			const 恢复 = Math.floor(0.3 * (对局.敌人.最大生命 - 对局.敌人.生命));
			对局.敌人.生命 += 恢复;
			return `【城管使用「急救」，恢复${恢复}点生命】`
		},
		被攻击时: (对局: 对局类型) => {
			if (Math.random() * 100 < 40) {
				对局.伤害.独立乘区 *= 0
				return "【城管使用「防爆盾」！（40%触发）】";
			}
		},
		攻击时: (对局: 对局类型) => {
			const 技能类型 = Math.floor(Math.random() * 5);
			switch (技能类型) {
				case 0:
					对局.伤害.基础加成 += 2 * 对局.敌人.攻击;
					return `【城管使用「真皮皮鞋」，踢中了你的屁股，伤害增加${2 * 对局.敌人.攻击}点！】`;
				case 1:
					对局.主角.防御-= 30;
					return "【城管使用「38元皮鞋」，踢中了你的腹部，你降低30点防御！】";
				case 2:
					对局.主角.攻击 -= 30;
					return "【城管使用「铁鞋」，踢中了你的胳膊，你降低30点攻击！】";
				case 3:
					对局.敌人.其他.技能点数 += 2;
					对局.伤害.基础加成 += 对局.敌人.攻击 * 对局.敌人.其他.技能点数;
					return `【城管使用「碎骨鞋」，踢中了你的脸部，你的脸上开始流血，伤害增加${对局.敌人.攻击 * 对局.敌人.其他.技能点数}点！】`;
				case 4:
					对局.伤害.基础加成 += 5 * 对局.敌人.攻击;
					return `【城管使用「破鞋」，踢中了你的蛋蛋，受到伤害增加${5 * 对局.敌人.攻击}点！】`;
				default:
					break;
			}
		},
		胜利效果: (对局: 对局类型) => {
			if(存档.物品.板砖 >= 21){
				存档.物品.板砖 --
				return "【你被抢走1个..砖头..】";
			}
			存档.物品.烟头 > 0 && (存档.物品.烟头--);
			return "【你被抢走1个..烟头..】";
		},
	},

	// 山脉系列
	{
		名称: "皮皮猴",
		等级: 16,
		生命: 575,
		攻击: 63,
		防御: 17,
		损失健康: 1,
		掉落物: [
			{
				概率: 100,
				数量: 1,
				名称: "果子",
			},
			{
				概率: 100,
				数量: 1,
				名称: "伤药",
			},
		],
		方法: "抓挠",
		攻击后: (对局: 对局类型) => {
			if (Math.random() * 100 < 15) {
				对局.敌人.逃跑 += 20;
				if (存档.物品.果子 >= 1) {
					存档.物品.果子--;
					对局.敌人.其他.技能点数++;
				}
				return "【你被偷走「果子」*1！猴子准备开溜了】";
			}
		},
		失败效果: (对局: 对局类型) => {
			存档.物品.果子 += 对局.敌人.其他.技能点数;
			return "【你抢回被偷的果子】";
		},
	},
	{
		名称: "野猪",
		等级: 24,
		生命: 1100,
		防御: 40,
		损失健康: 1,
		攻击: 120,
		掉落物: [
			{
				概率: 100,
				数量: 1,
				名称: "生肉",
			},
			{
				概率: 100,
				数量: 1,
				名称: "伤药",
			},
		],
		方法: "猪突猛进",
		攻击时: (对局: 对局类型) => {
			if (Math.random() * 100 < 20) {
				对局.伤害.独立乘区 *= 3
				return `【你被猪撞飞啦！造成300%伤害！】`;
			}else{
				对局.伤害.独立乘区 *= 0
				对局.敌人.生命 -= 对局.伤害.初始值;
				return `【${对局.敌人.名称}撞到树上啦！野猪损失${对局.伤害.初始值}点生命！】`;
			}
		},
	},
	{
		名称: "药贩",
		等级: 32,
		生命: 999,
		攻击: 140,
		压制: -10,
		损失健康: 1,
		出场语: "“嘿嘿~我家里有132种颜色哟~”",
		掉落物: [
			{
				概率: 100,
				数量: 2,
				名称: "伤药",
			},
		],
		方法: "药粉",
		被攻击时: (对局: 对局类型) => {
			if (Math.random() * 100 < 30) {
				const e = Math.floor(0.1 * 对局.敌人.最大生命);
				对局.敌人.生命 += e;
				对局.敌人.防御 += 20;
				return `【${对局.敌人.名称}使用「猥琐2」，防御+20，生命+${e}】`;
			}
		},
		攻击后: (对局: 对局类型) => {
			if (Math.random() * 100 < 30) {
				if (存档.物品.伤药 > 0) {
					对局.敌人.其他.技能点数++;
					存档.物品.伤药--;
					对局.敌人.逃跑 += 20;
					return `【你的伤药被偷啦！${对局.敌人.名称}准备要溜！】`;
				}
			}
		},
		失败效果: (对局: 对局类型) => {
			存档.物品.伤药 += 对局.敌人.其他.技能点数;
			return "【你抢回全部伤药】";
		},
	},
	{
		名称: "流浪剑客",
		等级: 45,
		生命: 1535,
		防御: 46,
		压制: -20,
		损失健康: 1,
		攻击: 212,
		出场语: "“在杀戮中，我终将绽放”",
		掉落物: [
			{
				概率: 50,
				数量: 2,
				名称: "亚麻",
			},
			{
				概率: 50,
				数量: 2,
				名称: "木材",
			},
			{
				概率: 100,
				数量: 2,
				名称: "伤药",
			},
			{
				概率: 5,
				数量: 1,
				名称: "幸运石",
			},
		],
		方法: "剑术",
		攻击时: (对局: 对局类型)  => {
			对局.伤害.加法乘率 += 0.5
			const a = Math.floor(0.15 * 对局.敌人.生命);
			对局.敌人.生命 -= a;
			return `【${对局.敌人.名称}使用「拼命2」，伤害加成50%，${对局.敌人.名称}损失${a}点生命】`;
		},
	},
	{
		名称: "黑熊（精英）",
		等级: 60,
		生命: 2025,
		攻击: 110,
		防御: 60,
		压制: -30,
		损失健康: 1,
		出场语: "发现一只奶奶的熊！（「咆哮」：自身当前血量越高，伤害越高）",
		掉落物: [
			{
				概率: 100,
				数量: 2,
				名称: "生肉",
			},
			{
				概率: 100,
				数量: 2,
				名称: "伤药",
			},
		],
		攻击时: (对局: 对局类型) => {
			const n = Math.floor(Math.max(0.2 * 对局.敌人.生命 - 对局.主角.防御, 0));
			对局.伤害.基础加成 += n;
			return `【黑熊使用「咆哮」，额外造成${n}点伤害】`;
		},
		被攻击时: (对局: 对局类型) => {
			对局.敌人.防御 += 10;
			return "【黑熊使用「霸气护体」，增加10点防御】";
		},
	},
	{
		名称: "果树",
		等级: 99,
		生命: 99999,
		压制: -50,
		逃跑: 1,
		出场语: "“呜呜呜~”",
		攻击后: (对局: 对局类型) => {
			对局.敌人.其他.技能点数++;
			if(对局.敌人.其他.技能点数 < 5){
				return "【果树正在哭泣~】";
			}
			对局.敌人.生命 -= 999999;
			return "【果树自杀了！】";
		},
		失败效果: (对局: 对局类型) => {
			if(对局.敌人.其他.技能点数 < 5){
				const t = 对局.敌人.最大生命 - 对局.敌人.生命
				const n = Math.max(Math.min(Math.round(t / 500 + 1), 4), 1);
				存档.物品.果子 += n;

				if(Math.random() * 100 < 2){
					存档.物品.眼泪 += 1;
					return `【果树倒下了！你对果树造成${t}点伤害，获得「果子」*${n}，获得「眼泪」*1】`;
				}
				return `【果树倒下了！你对果树造成${t}点伤害，获得「果子」*${n}】`;
			}

			const t = 对局.敌人.最大生命 - (对局.敌人.生命 + 999999);
			const n = Math.max(Math.min(Math.round(t / 500 + 1), 4), 1);
			存档.物品.果子 += n;
			return `【果树自杀了！你对果树造成${t}点伤害，获得「果子」*${n}】`;
		},
	},
	{
		名称: "火狐（稀有）",
		get 显示名称() { return `火狐.${存档.击败次数["火狐（稀有）"] + 1}转（稀有）` },
		get 等级() { return 35 + 存档.击败次数["火狐（稀有）"] * 5 },
		get 攻击() { return 存档.击败次数["火狐（稀有）"] * 35 },
		get 防御() { return 存档.击败次数["火狐（稀有）"] * 10 },
		get 生命() { return 510 + 存档.击败次数["火狐（稀有）"] * 210 },
		压制: -50,
		损失健康: 1,
		出场语: "发现一只全身散发红色光芒的狐狸！",
		掉落物: [
			{
				概率: 100,
				数量: 1,
				名称: "火狐皮",
			},
		],
		方法: "摆尾",
		被攻击后: (对局: 对局类型) => {
			if(对局.敌人.生命 > 0){
				if (Math.random() * 100 < 40 + 10 * 存档.击败次数["火狐（稀有）"] ) {
					const n = Math.floor(0.12 * (对局.敌人.最大生命 - 对局.敌人.生命) + 10 * 存档.击败次数["火狐（稀有）"]);
					对局.敌人.生命 += n;
					对局.主角.生命 -= n;
					return `【火狐使用「红灵护体」，恢复自身12%已损失的生命！(${n}点)，并对你造成${n}点伤害！】`;
				}
			}
		},
		攻击时: (对局: 对局类型) => {
			if (Math.random() * 100 < 40 + 10 * 存档.击败次数["火狐（稀有）"] ) {
				const a = Math.floor(0.12 * 对局.主角.生命 + 10 * 存档.击败次数["火狐（稀有）"]);
				对局.伤害.基础加成 += a;
				对局.敌人.生命 += a;
				return `【火狐使用「灵魂摄取」，你损失12%的当前生命值（${a}），火狐恢复${a}点生命！】`;
			}
		},
		失败效果: () => `你已经击败${存档.击败次数["火狐（稀有）"] + 1}只火狐，火狐的力量增强了！`
	},
	{
		名称: "山岭巨人（稀有）",
		get 等级() { return 45 + 存档.击败次数["山岭巨人（稀有）"] * 5 },
		get 攻击() { return 存档.击败次数["山岭巨人（稀有）"] * 5 },
		get 防御() { return 存档.击败次数["山岭巨人（稀有）"] * 15 },
		get 生命() { return 2275 + 存档.击败次数["山岭巨人（稀有）"] * 400 },
		损失健康: 1,
		出场语: "特注：战斗结束后巨人不会回满血！！！",
		掉落物: [
			{
				概率: 100,
				数量: 1,
				名称: "黑曜石",
			},
		],
		方法: "震荡",
		战斗初始化: (对局: 对局类型) => {
			const 真实满血 = 2275 + (存档.击败次数["山岭巨人（稀有）"]||0) * 400;
			对局.敌人.最大生命 = 真实满血;
			if (!存档.特殊敌人["山岭巨人（稀有）"]) {
				存档.特殊敌人["山岭巨人（稀有）"] = { 生命: 真实满血 };
			}
			对局.敌人.生命 = 存档.特殊敌人["山岭巨人（稀有）"].生命;
			if (对局.敌人.生命 <= 0) {
				对局.敌人.生命 = 真实满血;
				存档.特殊敌人["山岭巨人（稀有）"].生命 = 真实满血;
			}
		},
		攻击时: (对局: 对局类型) => {
			const n = Math.floor(Math.max(0.1 * 对局.敌人.生命 - 对局.主角.防御 + 对局.敌人.防御, 0));
			对局.伤害.基础加成 += n;
			return `【${对局.敌人.名称}使用「咆哮」，你受到${n}点伤害】`;
		},
		被攻击时: (对局: 对局类型) => {
			存档.特殊敌人["山岭巨人（稀有）"].生命 = 对局.敌人.生命
			对局.敌人.防御 += 10;
			对局.主角.生命 -= 对局.敌人.防御;
			return `【巨人使用「石化皮肤」「强化反甲」，防御+10，你损失${对局.敌人.防御}点生命】`;
		},
		失败效果: (对局: 对局类型) => {
			存档.特殊敌人["山岭巨人（稀有）"].生命 = 对局.敌人.生命
			if (对局.敌人.等级 == 55) {
				return "【激活特性「防御强化2」】";
			}
			return "山岭巨人倒下了..."
		},
		胜利效果: (对局: 对局类型) => {
			存档.特殊敌人["山岭巨人（稀有）"].生命 = 对局.敌人.生命
		}
	},

	// 城中村
	{
		名称: "熊孩子",
		等级: 28,
		生命: 999,
		防御: 72,
		压制: -50,
		损失健康: 1,
		出场语: "“大伙快来看哇——！来了个SX！”",
		掉落物: [
			{
				概率: 100,
				数量: 1,
				名称: "果子",
			},
		],
		攻击时: (对局: 对局类型) => {
			对局.敌人.其他.技能点数++;

			const e = 对局.敌人.其他.技能点数 ** 2;
			const t = 20 * e;
			对局.伤害.基础加成 += t;
			return `【${e}个熊孩子向你扔石头！${e}个石头迎头砸来！】`;
		},
		攻击后: (对局: 对局类型) => {
			const e = 对局.敌人.其他.技能点数 ** 2;
			const n = (对局.敌人.其他.技能点数 + 1) ** 2 - e;
			对局.敌人.生命 += 50 * n;
			return `【${n}个新孩子加入战斗！】`
		}
	},
	{
		名称: "阿宾",
		等级: 40,
		生命: 1370,
		攻击: 599,
		防御: 180,
		压制: -10,
		损失健康: 1,
		出场语: "“我的眼睛在哪里？我给钱你，请还给我！”",
		掉落物: [
			{
				概率: 80,
				数量: 1,
				名称: "果子",
			},
		],
		攻击后: (对局: 对局类型) => {
			if (Math.random() * 100 < 70) {
				对局.敌人.其他.技能点数++;
				if (对局.敌人.其他.技能点数 < 4 && Math.random() * 100 < 50) {
					存档.金钱++;
					对局.伤害.独立乘区 *= 0
					return "【阿宾给了你1毛钱！】";
				}
				return `【“还我眼睛！”。阿宾咬了你一口！】`;
			}
			对局.伤害.独立乘区 *= 0
			对局.敌人.生命 -= 200;
			return "【“啊！~不要杀我！我没偷你们的东西！”。阿宾生命-200！】";
		},
	},
	{
		名称: "卖片老板",
		等级: 50,
		生命: 1700,
		攻击: 399,
		防御: 120,
		压制: -10,
		损失健康: 1,
		出场语: "“刚到新货，要不要来两张？”",
		掉落物: [
			{
				概率: 60,
				数量: 2,
				名称: "金钱",
			},
			{
				概率: 40,
				数量: 1,
				名称: "伤药",
			},
		],
		攻击时: (对局: 对局类型) => {
			const e = Math.random() * 100;
			if (e < 20) {
				存档.金钱 > 0 && (存档.金钱--);
				return "【老板向你飞出一张《夫妻其他日记》。你损失1毛钱！】";
			}
			if (e < 80) {
				const t = 99
				对局.伤害.基础加成 += t;
				return `【老板向你甩出一把「老王飞刀」。你损失${t}点生命！】`;
			}
			对局.主角.生命 += 99;
			return "【老板向你飞出一张《爱拼才会赢》。你恢复99点生命！】";
		},
	},
	{
		名称: "阿龙",
		等级: 70,
		生命: 2385,
		防御: 167,
		攻击: 382,
		压制: -20,
		损失健康: 2,
		出场语: "“这里的小妹全归老子管！”",
		掉落物: [
			{
				概率: 100,
				数量: 2,
				名称: "金钱",
			},
			{
				概率: 5,
				数量: 1,
				名称: "晓月手链",
			},
		],
		方法: "空气拳",
		攻击前: (对局: 对局类型) => {
			对局.攻击.基础加成 += 对局.敌人.防御
		},
		被攻击时: (对局: 对局类型) => {
			const e = Math.floor(382 - 0.3 * 对局.主角.攻击);
			对局.敌人.生命 += e;
			return `【阿龙使用「放气治疗！」，恢复${e}点生命！】`;
		},
	},
	{
		名称: "大龄站街妹",
		等级: 30,
		生命: 1040,
		攻击: 600,
		防御: 99,
		压制: -10,
		损失健康: 1,
		出场语: "“小伙子，来玩玩嘛，嗯~哼~”",
		掉落物: [
			{
				概率: 100,
				数量: 2,
				名称: "金钱",
			},
		],
		攻击时: (对局: 对局类型) => {
			if (存档.金钱) {
				存档.金钱--;
				return "【站街妹在你身上蹭了蹭，你被摸走1毛钱！】！";
			}
			对局.敌人.逃跑 += 100;
			return `【“蛤？没钱！？...来人呀——！抓小流氓啦——！”】`;
		},
		被攻击时: (对局: 对局类型) => {
			对局.主角.逃跑 -= 10;
			return "【站街使用「拖拽！」你逃跑几率-10%！】！";
		},
		失败效果: () => "【“我说没偷你的钱就是没偷，你想怎么着？”】！",
	},
	{
		名称: "走私团伙",
		get 显示名称() { return `走私团伙${Math.floor(899 * Math.random() + 100)}队` },
		get 等级() { return 100 + 存档.击败次数["走私团伙"] * 20 },
		get 生命() { return 3345 + 存档.击败次数["走私团伙"] * 500 },
		get 防御() { return 234 + 存档.击败次数["走私团伙"] * 40 },
		压制: 40,
		损失健康: 2,
		出场语: "“你知不知道好奇能让人疯掉？”",
		掉落物: [
			{
				概率: 30,
				数量: 1,
				名称: "白色粉末",
			},
			{
				概率: 20,
				数量: 1,
				名称: "子弹",
			},
		],
		攻击时: (对局: 对局类型) => {
			对局.敌人.其他.技能点数++;
			if (对局.敌人.其他.技能点数 <= 10) {
				if (Math.random() * 100 < 对局.敌人.等级 / 5) {
					对局.伤害.基础加成 += 9 * 对局.敌人.等级
					return `【走私团伙，向你发射了一颗子弹！击中！】`;
				}else{
					return "【走私团伙，向你发射了一颗子弹！但是未命中】";
				}
			}
			return "【走私团伙没子弹啦！】";
		},
		失败效果: () => {
			return "【“你给老子等着！”】"
		}
	},

	// 郊外系列
	{
		名称: "金环蛇",
		等级: 70,
		生命: 2385,
		防御: 150,
		损失健康: 1,
		攻击: 220,
		出场语: "滋溜~滋溜~（金环蛇保底攻击30点）",
		掉落物: [
			{
				概率: 80,
				数量: 1,
				名称: "生肉",
			},
		],
		方法: "毒液",
		攻击时: (对局: 对局类型) => {
			if(对局.伤害.初始值 < 30){
				对局.伤害.初始值 = 30
			}
			const n = 对局.伤害.初始值 * 对局.敌人.其他.技能点数;
			对局.伤害.基础加成 += n;
			对局.敌人.其他.技能点数++;
			return `【中毒：附加${n}点伤害（${对局.敌人.其他.技能点数}层）】`;
		},
	},
	{
		名称: "铃女",
		等级: 90,
		生命: 3075,
		攻击: 400,
		防御: 200,
		压制: -10,
		损失健康: 1,
		出场语: "“喔~~呵~呵~呵~”",
		掉落物: [
			{
				概率: 100,
				数量: 2,
				名称: "金钱",
			},
		],
		方法: "忍杀",
		攻击时: (对局: 对局类型) => {
			const e = Math.random() * 100;
			if (e < 30) {
				对局.主角.攻击 -= Math.floor(0.5 * 对局.主角.攻击);
				return "【铃女使用「挠痒痒」，你笑得像个二愣子，攻击下降一半！】";
			}
			if (e < 70) {
				if (存档.金钱 > 0) {
					存档.金钱--;
					return "【铃女使用「光速贴近」，你损失0.1元！】";
				}
				对局.敌人.逃跑 += 100;
				return "【铃女使用「光溜~(光速溜走)」！】";
			}
			对局.敌人.防御 += 60;
			return "【铃女使用「喵盾~」，防御+60！】";
		},
	},
	{
		名称: "流浪大叔",
		等级: 120,
		生命: 4035,
		攻击: 650,
		防御: 280,
		压制: -50,
		损失健康: 1,
		出场语: "“小伙，来热热身子？”",
		掉落物: [
			{
				概率: 50,
				数量: 1,
				名称: "熟肉",
			},
			{
				概率: 100,
				数量: 1,
				名称: "伤药",
			},
			{
				概率: 5,
				数量: 1,
				名称: "幸运石",
			},
		],
		方法: "穿心",
		攻击时: (对局: 对局类型) => {
			const e = Math.max(Math.floor(50 * 对局.敌人.其他.技能点数 - 0.5 * 对局.主角.防御), 0);
			对局.伤害.基础加成 += e;
			对局.敌人.其他.技能点数 ++
			return `【${对局.敌人.名称}使用「气合」，增加${e}点伤害，下一次攻击提高！】`;
		},
		被攻击时: (对局: 对局类型) => {
			if (Math.random() * 100 < 30) {
				const t = 对局.主角.攻击;
				对局.主角.生命 -= t;
				return `【大叔使用「反震.碎骨」，你损失${t}点生命！】`;
			}
		},
	},
	{
		名称: "古树",
		get 等级() { return 199 + 存档.击败次数["古树"] * 100 },
		get 生命() { return 19999 + 存档.击败次数["古树"] * 10000 },
		get 防御() { return 20 + 存档.击败次数["古树"] * 20 },
		压制: -50,
		损失健康: 1,
		出场语: "......",
		掉落物: [
			{
				概率: 100,
				数量: 10,
				名称: "果子",
			},
			{
				概率: 100,
				数量: 10,
				名称: "木材",
			},
		],
		战斗初始化: (对局: 对局类型) => {
			const 真实满血 = 19999 + (存档.击败次数["古树"] || 0) * 10000;
			对局.敌人.最大生命 = 真实满血;

			if (!存档.特殊敌人["古树"]) {
				存档.特殊敌人["古树"] = { 生命: 真实满血 };
			} else {
				对局.敌人.生命 = 存档.特殊敌人["古树"].生命;
				if (对局.敌人.生命 <= 0) {
					对局.敌人.生命 = 真实满血;
					存档.特殊敌人["古树"].生命 = 真实满血;
				}
			}
		},
		被攻击时: (对局: 对局类型) => {
			存档.特殊敌人["古树"].生命 = 对局.敌人.生命;
			对局.敌人.防御 += 20;
			对局.主角.生命 -= 对局.敌人.防御;
			return `【反弹！你损失${对局.敌人.防御}点生命】`;
		},
		胜利效果: (对局: 对局类型) => {
			存档.特殊敌人["古树"].生命 = 对局.敌人.生命;
		},
		失败效果:  (对局: 对局类型) => {
			存档.特殊敌人["古树"].生命 = 对局.敌人.生命;
		},
	},
	{
		名称: "受伤的火狐",
		get 等级() { return 20 + 存档.击败次数["受伤的火狐"] * 5 },
		get 攻击() { return 198 + 存档.击败次数["受伤的火狐"] * 35 },
		get 防御() { return 60 + 存档.击败次数["受伤的火狐"] * 10 },
		get 生命() { return 1780 + 存档.击败次数["受伤的火狐"] * 210 },
		损失健康: 3,
		出场语: "火狐周身散发着火红的光芒！",
		掉落物: [
			{
				概率: 100,
				数量: 1,
				名称: "火狐皮",
			},
		],
		被攻击后: (对局: 对局类型) => {
			if(对局.敌人.生命 > 0){
				const n = Math.floor(0.12 * (对局.敌人.最大生命 - 对局.敌人.生命));
				对局.敌人.生命 += n;
				对局.主角.生命 -= n;
				return `【火狐使用「红灵护体」，恢复自身12%已损失的生命！(${n}点)，并对你造成${n}点伤害！】`;
			}
		},
		攻击时: (对局: 对局类型) => {
			const a = Math.floor(0.12 * 对局.主角.生命);
			对局.伤害.基础加成 += a;
			对局.敌人.生命 += a;
			return `【火狐使用「灵魂摄取」，你损失12%的当前生命值（${a}），火狐恢复${a}点生命！】`;
		},
	},
	{
		名称: "再生虫（稀有）",
		生命: 2222,
		压制: 100,
		损失健康: 20,
		出场语: "散发着彩色光芒的蝴蝶",
		掉落物: [
			{
				概率: 100,
				数量: 1,
				名称: "火狐皮",
			},
		],
		攻击时: (对局: 对局类型) => {
			if (!存档.物品.火狐皮) {
				对局.主角.生命 += 200;
				return `【${对局.敌人.名称}在给你治疗！你回复200点生命】`;
			}
			对局.敌人.其他.技能点数 += 2;
			const i = 200 * 存档.物品.火狐皮 * 对局.敌人.其他.技能点数;
			对局.伤害.基础加成 += i;
			return `【剧毒：每回合损失${i}点生命】`;
		},
		失败效果: () => {
			return  "【“我知道，这是我无法逃脱的宿命。但是啊，愚蠢的人类，你将为此付出代价！”】"
		}
	},

	// 市中心系列
	{
		名称: "喵妹",
		等级: 105,
		生命: 3599,
		防御: 250,
		压制: 10,
		逃跑: 8,
		损失健康: 1,
		出场语: "“(づ◡ど)”",
		掉落物: [
			{
				概率: 30,
				数量: 1,
				名称: "果子",
			},
			{
				概率: 30,
				数量: 1,
				名称: "果子",
			},
			{
				概率: 30,
				数量: 1,
				名称: "果子",
			},
			{
				概率: 30,
				数量: 1,
				名称: "果子",
			},
			{
				概率: 3,
				数量: 1,
				名称: "小裤裤",
			},
		],
		攻击时: (对局: 对局类型) => {
			const e = Math.floor(0.2 * 对局.主角.生命 + 50);
			对局.伤害.基础加成 += e;
			return `【喵妹使用「撩裙」，对你造成${e}点生命(当前生命的20%)！】`;
		},
		被攻击时: (对局: 对局类型) => {
			对局.主角.生命 -= 233;
			对局.主角.攻击 -= 99;
			return "【喵妹使用「比心」，你降低99点攻击，233点生命！】";
		},
		失败效果: () => {
			return "“呜呜呜~我只是想找个人玩玩嘛~(ಥ_ಥ)”"
		},
		胜利效果: () => {
			return "“帅锅，记得再过来玩哈~❥(^_-)”"
		}
	},
	{
		名称: "高级金融分析师",
		等级: 125,
		生命: 8125,
		防御: 297,
		压制: 10,
		损失健康: 1,
		出场语: "“你好，我是从华尔街回国的数据挖掘师！”",
		掉落物: [
			{
				概率: 100,
				数量: 4,
				名称: "金钱",
			},
		],
		被攻击时: (对局: 对局类型) => {
			存档.物品.果子++;
			const e = Math.floor(0.1 * 对局.主角.攻击);
			对局.主角.攻击 -= e;
			return `【分析师丢给你一个果子，你获得「果子」*1，你攻击降低${e}！】`;
		},
		攻击后: (对局: 对局类型) => {
			对局.敌人.其他.技能点数++;
			if (对局.敌人.其他.技能点数 % 3 == 0) {
				if (存档.金钱 >= 4) {
					存档.金钱 -= 4;
					存档.物品.亚麻++;
					对局.敌人.逃跑 += 30;
					return "【分析师使用「嘴强王者」，你消费了0.4元，获得赠品「亚麻」*1！】";
				} else {
					存档.物品.果子 -= 3;
					存档.物品.果子 < 0 && (存档.物品.果子 = 0);
					对局.敌人.逃跑 += 100;
					return "【“mmp，你知道我时间有多宝贵吗？把东西还给我！”。你失去「果子」*3】";
				}
			}
			对局.敌人.压制 += 30;
			对局.敌人.逃跑 += 5;
			return "【分析师使用「抱大腿」，你逃跑-30%！】";
		},
		失败效果: () => {
			if (Math.random() * 100 < 10) {
				存档.物品.西装++;
				return "【“mmp！不买就算了~你的钱我不还啦~有本事你报警去呀~”（获得西装*1）】"
			}
			return "【“mmp！不买就算了~你的钱我不还啦~有本事你报警去呀~”】"
		},
	},
	{
		名称: "胖虎",
		等级: 155,
		生命: 5155,
		防御: 360,
		压制: -20,
		损失健康: 2,
		出场语: "“你是要挑战我胖虎？”",
		掉落物: [
			{
				概率: 30,
				数量: 1,
				名称: "烟头",
			},
			{
				概率: 30,
				数量: 1,
				名称: "伤药",
			},
			{
				概率: 30,
				数量: 1,
				名称: "伤药",
			},
			{
				概率: 5,
				数量: 1,
				名称: "放大镜",
			},
		],
		被攻击时: (对局: 对局类型) => {
			const e = Math.floor(0.5 * 对局.敌人.防御);
			对局.主角.生命 -= e;
			对局.敌人.防御 += 99;
			return `【胖虎使用「白鹤起舞」，防御增加99，你受到${e}反弹伤害！】`;
		},
		攻击时: (对局: 对局类型) => {
			对局.敌人.其他.技能点数++;
			if (对局.敌人.其他.技能点数 % 3 !== 0) {
				const e = 对局.主角.防御
				const t = Math.floor(0.2 * 对局.敌人.防御 * 对局.敌人.其他.技能点数);
				对局.伤害.基础加成 += e + t;
				return `【胖虎使用「黑虎袭胸！」，你损失${e}，附加${t}点流血！】`;
			}
			const n = Math.floor(对局.敌人.防御 * 对局.敌人.其他.技能点数);
			对局.伤害.基础加成 += n;
			return `【胖虎使用「绝活！千年杀！」，你损失${n}点生命！】`;
		},
		失败效果:() => {
			return  "【“可以！论骚气，我胖虎服！”】"
		},
		胜利效果: () => {
			return "【“你能拿我胖虎怎么办？”】"
		}
	},
	{
		名称: "龙啸天",
		等级: 195,
		生命: 6470,
		攻击: 1199,
		防御: 480,
		压制: -10,
		损失健康: 3,
		出场语: "“新来的，保护费没交？”",
		掉落物: [
			{
				概率: 50,
				数量: 1,
				名称: "熟肉",
			},
			{
				概率: 10,
				数量: 1,
				名称: "子弹",
			},
		],
		方法: "龙啸",
		攻击时: (对局: 对局类型) => {
			if (Math.random()* 100 < 20) {
				const e = Math.floor(对局.敌人.其他.技能点数 * 对局.主角.攻击 * 0.2 + 对局.敌人.攻击 - 对局.主角.防御);
				对局.伤害.基础加成 += e;
				
				const t = Math.floor(0.08 * 对局.主角.防御);
				对局.主角.防御-= t;

				对局.敌人.其他.技能点数++;
				return `【龙傲天使用「龙啸」！受到${e}点伤害，防御-${t}！】`;
			}
		},
		失败效果: () => {
			存档.金钱 += 5;
			return "【“大哥！以后我就跟你混了！” 获得0.5元】";
		},
		胜利效果: (对局: 对局类型) => {
			存档.金钱 -= Math.floor(0.1 * 存档.金钱);
			return "【“你永远都学不乖？” 你损失10%金钱！】";
		},
	},
	{
		名称: "排球少女",
		等级: 85,
		生命: 2850,
		防御: 250,
		损失健康: 1,
		增加声望: 1,
		出场语: "“我一定会进省队的！”「特注：随天数增强型对手」",
		掉落物: [
			{
				概率: 100,
				数量: 2,
				名称: "金钱",
			},
			{
				概率: 6,
				数量: 1,
				名称: "晓月手链",
			},
			{
				概率: 6,
				数量: 1,
				名称: "幸运石",
			},
		],
		被攻击时: (对局: 对局类型) => {
			if (Math.random() * 100 < 存档.天数 - 90) {
				if (存档.天数 - 90 < 40) {
					const 增加防御值 = Math.floor(0.1 * 对局.主角.防御);
					对局.敌人.防御 += 增加防御值;
					return `【少女使用「幻影旋风.一段！」，少女增加${增加防御值}点防御！】`;
				}
				else if (存档.天数 - 90 < 65) {
					const 增加防御值 = Math.floor(0.3 * 对局.主角.防御);
					对局.敌人.防御 += 增加防御值;
					return `【少女使用「幻影旋风.二段！」，少女增加${增加防御值}点防御！】`;
				} else {
					const 增加防御值 = Math.floor(0.3 * 对局.主角.防御);
					const 反弹伤害值 = Math.floor(0.7 * 对局.主角.攻击);

					对局.敌人.防御 += 增加防御值;
					对局.主角.生命 -= 反弹伤害值;
					return `【少女使用「幻影旋风.三段！」，少女增加${增加防御值}点防御！你受到${反弹伤害值}点反弹伤害！】`;
				}
			}
		},
		攻击时: (对局: 对局类型) => {
			// 120天前：晴空霹雳·一段
			if (存档.天数 < 120) {
				const 造成伤害值 = Math.floor(4 * 存档.天数 + 0.05 * 对局.主角.最大生命 - 对局.主角.防御);
				对局.伤害.基础加成 += 造成伤害值;
				return `【少女使用「晴空霹雳.一段！」，你受到${造成伤害值}点伤害】`;
			}
			// 120-150天：晴空霹雳·二段
			else if (存档.天数 < 150) {
				const 防御减少值 = 2 * (存档.天数 - 90);
				对局.主角.防御-= 防御减少值;

				const 造成伤害值 = Math.floor(4 * 存档.天数 + 0.05 * 对局.主角.最大生命 - 对局.主角.防御);
				对局.伤害.基础加成 += 造成伤害值;
				return `【少女使用「晴空霹雳.二段！」，你受到${造成伤害值}点伤害，防御减少${防御减少值}！】`;
			}
			// 150天及以后：晴空霹雳·三段
			else {
				const 防御减少值 = Math.floor(0.1 * 对局.主角.最大生命);
				对局.主角.防御 -= 防御减少值;

				const 造成伤害值 = Math.floor(4 * 存档.天数 + 0.05 * 对局.主角.最大生命 - 对局.主角.防御);
				对局.伤害.基础加成 += 造成伤害值;

				const 生命恢复值 = Math.floor(0.1 * 对局.主角.最大生命);
				对局.敌人.生命 += 生命恢复值;

				return `【少女使用「晴空霹雳.三段！」，你受到${造成伤害值}点伤害，防御减少${防御减少值}，少女恢复${生命恢复值}点生命！】`;
			}
		},
		失败效果: () => {
			return "“我一定会更强的！”"
		}
	},

	// 山洞系列
	{
		名称: "吸血蝙蝠",
		等级: 120,
		生命: 12000,
		攻击: 360,
		防御: 140,
		压制: 30,
		损失健康: 2,
		出场语: "“乌~拉！”",
		掉落物: [
			{
				概率: 100,
				数量: 1,
				名称: "漂亮石头",
			},
			{
				概率: 100,
				数量: 1,
				名称: "漂亮石头",
			},
		],
		方法: "吸血",
		攻击时: (对局: 对局类型) => {
			const t = Math.max(Math.floor(0.5 * 对局.敌人.攻击), 0);
			对局.伤害.基础加成 += t;
			对局.敌人.生命 += t;
			return `【${对局.敌人.名称}汲取了${t}点生命！】`;
		},
	},
	{
		名称: "彩色蜘蛛",
		等级: 150,
		生命: 15000,
		攻击: 450,
		防御: 175,
		压制: 40,
		损失健康: 2,
		掉落物: [
			{
				概率: 100,
				数量: 1,
				名称: "漂亮石头",
			},
			{
				概率: 100,
				数量: 1,
				名称: "漂亮石头",
			},
		],
		方法: "束缚",
		攻击时: (对局: 对局类型) => {
			if (Math.random() * 100 < 20) {
				对局.主角.攻击 -= Math.floor(0.10 * 对局.主角.攻击);
				对局.敌人.压制 += 10;
				return `【${对局.敌人.名称}使用「束缚」，你攻击降低10%，逃跑率降低10%！】`;
			}
			return `【${对局.敌人.名称}使用「束缚」，但是被你躲开啦！】`;
		},
	},
	{
		名称: "黑头剑蛇",
		等级: 190,
		生命: 19999,
		攻击: 599,
		防御: 221,
		损失健康: 2,
		掉落物: [
			{
				概率: 100,
				数量: 1,
				名称: "漂亮石头",
			},
			{
				概率: 100,
				数量: 1,
				名称: "漂亮石头",
			},
		],
		方法: "噬咬",
		攻击时: (对局: 对局类型) => {
			对局.敌人.其他.技能点数++;
			const a =  Math.floor(0.2 * 对局.敌人.攻击) * 对局.敌人.其他.技能点数;
			对局.伤害.基础加成 += a;

			const n = Math.floor(0.1 * 对局.主角.防御);
			对局.主角.防御-= n;
			return `【毒酸：每回合损失${a}点生命，${n}点防御！】`;
		},
	},
	{
		名称: "变异的巨型猫",
		等级: 240,
		生命: 24865,
		攻击: 740,
		防御: 270,
		压制: 60,
		损失健康: 2,
		掉落物: [
			{
				概率: 100,
				数量: 1,
				名称: "漂亮石头",
			},
			{
				概率: 100,
				数量: 1,
				名称: "漂亮石头",
			},
		],
		方法: "抓挠",
		攻击时: (对局: 对局类型) => {
			if (Math.random() * 100 < 30) {
				const e = Math.floor(0.2 * 对局.主角.生命);
				对局.伤害.基础加成 += e;
				return `【巨猫使用「疯狂撕咬」你损失${e}点生命！】`;
			}
		},
		被攻击时: (对局: 对局类型) => {
			if (Math.random() * 100 < 30) {
				对局.伤害.独立乘区 *= 0
				return `【${对局.敌人.名称}躲避你的攻击！】`;
			}
		},
	},
	{
		名称: "变异的流浪狗",
		等级: 300,
		生命: 30000,
		攻击: 900,
		防御: 350,
		压制: 70,
		损失健康: 2,
		掉落物: [
			{
				概率: 100,
				数量: 1,
				名称: "漂亮石头",
			},
			{
				概率: 100,
				数量: 1,
				名称: "漂亮石头",
			},
		],
		被攻击时: (对局: 对局类型) => {
			对局.敌人.攻击 += Math.floor(0.1 * 对局.敌人.攻击);
			对局.敌人.防御 -= Math.floor(0.1 * 对局.敌人.防御);
			return "【流浪狗狂躁，攻击提高10%，防御降低10%！】";
		},
		方法: "撕咬",
		攻击时: (对局: 对局类型) => {
			对局.敌人.其他.技能点数++;
			if (Math.random() * 100 < 10 * 对局.敌人.其他.技能点数 + 20) {
				const a = 2 * (对局.敌人.攻击 - 对局.主角.防御);
				对局.伤害.基础加成 += a;
				return `【${对局.敌人.名称}使用「疯狂暴击」，你损失${a}点生命！】`;
			}
		},
	},
	{
		名称: "变异的巨蜥",
		等级: 375,
		生命: 36000,
		攻击: 1150,
		防御: 434,
		压制: 80,
		损失健康: 2,
		掉落物: [
			{
				概率: 100,
				数量: 1,
				名称: "漂亮石头",
			},
			{
				概率: 100,
				数量: 1,
				名称: "漂亮石头",
			},
		],
		方法: "扑杀",
		被攻击时: (对局: 对局类型) => {
			const e = Math.floor(0.06 * 对局.敌人.最大生命);
			对局.敌人.生命 += e;
			return `【巨蜥使用自愈，恢复${e}点生命！】`;
		},
		攻击时: (对局: 对局类型) => {
			对局.主角.防御 -= Math.floor(0.08 * 对局.主角.防御);
			对局.主角.攻击 -= Math.floor(0.08 * 对局.主角.攻击);
			return "【巨蜥使用「粘液」，你降低8%攻击，8%防御！】";
		},
	},
	{
		名称: "被割掉舌头的人",
		等级: 475,
		生命: 45000,
		攻击: 1400,
		防御: 599,
		压制: 90,
		损失健康: 2,
		出场语: "“啊~呜~呜~”",
		掉落物: [
			{
				概率: 100,
				数量: 1,
				名称: "漂亮石头",
			},
			{
				概率: 100,
				数量: 1,
				名称: "漂亮石头",
			},
		],
		攻击时: (对局: 对局类型) => {
			if (Math.random() * 100 < 50) {
				const e = 对局.敌人.攻击;
				对局.主角.生命 += e;
				return `【无舌人对你使用「治疗」，你恢复${e}点生命】`;
			}else{
				对局.敌人.其他.技能点数 += 3;
				const t = 3 * 对局.伤害.初始值;
				对局.伤害.基础加成 += t;
				return `【无舌人对你使用「撕咬」，你损失${t}点生命，并附加3层毒素伤害！】`;
			}
		},
		攻击后: (对局: 对局类型) => {
			if (对局.敌人.其他.技能点数 > 0) {
				对局.敌人.其他.技能点数 --;

				const a = Math.floor(0.1 * 对局.敌人.攻击) * 对局.敌人.其他.技能点数;
				对局.主角.生命 -= a;
				return `【毒素：每回合损失${a}点生命】`;
			}
		}

	},
	{
		名称: "看守的士兵",
		等级: 600,
		生命: 60000,
		攻击: 1800,
		防御: 699,
		压制: 100,
		损失健康: 2,
		出场语: "“这里不准进入！”",
		掉落物: [
			{
				概率: 100,
				数量: 1,
				名称: "漂亮石头",
			},
			{
				概率: 100,
				数量: 1,
				名称: "漂亮石头",
			},
		],
		方法: "警告",
		攻击时: (对局: 对局类型) => {
			对局.敌人.其他.技能点数++;
			if (对局.敌人.其他.技能点数 % 4 == 0) {
				const e = 5 * 对局.敌人.攻击;
				对局.伤害.基础加成 += e;
				return `【${对局.敌人.名称}向你发射了一颗子弹！击中！你损失${e}点生命！】`;
			}
			return "【“警告！赶紧离开~不然就开枪了~”】";
		},
		被攻击时: (对局: 对局类型) => {
			if (Math.random() * 100 < 30) {
				对局.伤害.独立乘区 *= 0
				return `【${对局.敌人.名称}使用「防爆盾」！】`;
			}
		},
	},
	{
		名称: "军官",
		等级: 800,
		生命: 75000,
		攻击: 2499,
		防御: 999,
		压制: 120,
		损失健康: 2,
		出场语: "“你怕是没见过会用刀的人！”",
		掉落物: [
			{
				概率: 100,
				数量: 1,
				名称: "漂亮石头",
			},
			{
				概率: 100,
				数量: 1,
				名称: "漂亮石头",
			},
		],
		被攻击时: (对局: 对局类型) => {
			对局.敌人.攻击 += Math.floor(0.05 * 对局.敌人.攻击);
			return `【${对局.敌人.名称}使用「集中」，${对局.敌人.名称}攻击强化！】`;
		},
		方法: "军刀",
		攻击时: (对局: 对局类型) => {
			if (4 == 对局.敌人.其他.技能点数) {
				const e = 对局.敌人.攻击 * (1 + 对局.敌人.其他.技能点数);
				对局.伤害.基础加成 += e;
				return `【${对局.敌人.名称}使用「终结.斩杀！」，你受到${e}点生命！】`;
			}
			对局.敌人.其他.技能点数++;
			const t = 对局.敌人.攻击;
			const n = Math.floor(0.1 * 对局.敌人.攻击 * 对局.敌人.其他.技能点数);
			对局.伤害.基础加成 += t + n;

			对局.主角.防御-= Math.floor(0.05 * 对局.主角.防御);
			对局.主角.攻击 -= Math.floor(0.05 * 对局.主角.攻击);
			return `【${对局.敌人.名称}使用「剔骨小刀！」你受到${t}点伤害，附加${n}流血，攻防降低5%！】`;
		},
	},
	{
		名称: "科学家",
		等级: 1000,
		生命: 99999,
		攻击: 2999,
		防御: 1199,
		压制: 120,
		损失健康: 2,
		出场语: "“入侵者，既然你来到这里，就不太可能出去了~”",
		掉落物: [
			{
				概率: 100,
				数量: 1,
				名称: "漂亮石头",
			},
			{
				概率: 100,
				数量: 1,
				名称: "漂亮石头",
			},
			{
				概率: 5,
				数量: 1,
				名称: "西装",
			},
		],
		方法: "射线",
		攻击时: (对局: 对局类型) => {
			对局.敌人.其他.技能点数++;
			const e = Math.floor(对局.敌人.攻击 * (1 + 对局.敌人.其他.技能点数 / 10));
			对局.伤害.基础加成 += e;
			对局.敌人.生命 += e;
			return `【${对局.敌人.名称}喷出「靶向喷雾」你受到${e}点伤害。${对局.敌人.名称}恢复${e}点生命，并收集1点能量！】`;
		},
		被攻击时: (对局: 对局类型) => {
			if (对局.敌人.其他.技能点数 % 4 == 0) {
				对局.敌人.防御 = 899;
				return `【${对局.敌人.名称}「无敌屏障」被击破！】`;
			}
			if (对局.敌人.其他.技能点数 % 2 == 0) {
				对局.敌人.防御 = 99999;
				return `【${对局.敌人.名称}启动「无敌屏障」！】`;
			}
			const e = Math.floor(对局.主角.攻击 * (0.2 + 对局.敌人.其他.技能点数 / 10));
			对局.主角.生命 -= e;
			return `【${对局.敌人.名称}开启「反射屏障」你受到${e}点伤害！】`;
		},
	},
	{
		名称: "？？？？",
		get 等级() { return 存档.击败次数["？？？？"] * 999 },
		get 生命() { return 999999 + 存档.击败次数["？？？？"] * 999999 },
		get 攻击() { return 300 + 存档.击败次数["？？？？"] * 300 },
		压制: 0,
		损失健康: 3,
		增加声望: 1,
		方法: "？？",
		被攻击时: (对局: 对局类型) => {
			if (对局.敌人.防御 < 2 * 对局.主角.防御) {
				对局.敌人.防御 += 10;
				对局.敌人.等级++;
			}
			if (对局.敌人.等级 > 150) {
				const e = Math.floor(0.5 * 对局.敌人.防御);
				对局.主角.生命 -= e;
				return `【？使用「学习.反弹」你受到${e}点伤害！】`;
			}
			if (对局.敌人.等级 > 700) {
				const e = 2 * 对局.敌人.攻击;
				对局.主角.生命 -= e;
				对局.敌人.其他.技能点数 -= Math.floor(0.4 * 对局.主角.攻击);
				return `【？使用「进化.离子护甲」，格挡40%伤害，你受到${e}点反弹伤害！】`;
			}
		},
		攻击时: (对局: 对局类型) => {
			if (对局.敌人.攻击 < 2 * 对局.主角.攻击) {
				对局.敌人.攻击 += 20;
				对局.敌人.等级++;
			}
			if (对局.敌人.等级 > 30) {
				const e = 2 * 对局.伤害.初始值
				对局.伤害.基础加成 += e;
				return `【？使用「学习.暴击」你受到${e}点伤害！】`;
			}
			if (对局.敌人.等级 > 100) {
				const e = 2 * 对局.敌人.攻击;
				对局.伤害.基础加成 += e;
				return `【？使用「学习.破防」你受到${e}点伤害！】`;
			}
			if (对局.敌人.等级 > 200) {
				const e = 2 * 对局.敌人.攻击;
				对局.伤害.基础加成 += e;

				const t = Math.floor(0.2 * e);
				对局.敌人.生命 += t;
				return `【？使用「学习.吸血」你受到${e}点伤害，？恢复${t}点生命！】`;
			}
			if (对局.敌人.等级 > 500) {
				对局.敌人.其他.技能点数++;
				const e = 2 * 对局.敌人.攻击
				const n = Math.floor(0.2 * 对局.敌人.攻击 * 对局.敌人.其他.技能点数);
				对局.伤害.基础加成  += e + n;
				
				对局.主角.防御-= Math.floor(0.05 * 对局.主角.防御);

				const t = Math.floor(0.2 * e)
				对局.敌人.生命 += t;
				return `【？使用「进化.毒暴」你受到${e}点伤害，附加${n}点毒性伤害，防御降低5%。？恢复${t}点生命！】`;
			}
		},
		失败效果: () => {
			return  "“如果我不存在...整个世界将会陷入混乱...”"
		},
	},

	// 晓月家系列
	{
		名称: "晓月家大狼狗",
		等级: 80,
		生命: 2685,
		防御: 187,
		压制: 9999,
		损失健康: 1,
		出场语: "emmmmmm",
		攻击后: (对局: 对局类型) => {
			对局.敌人.其他.技能点数++;
			if (对局.敌人.其他.技能点数 <= 5) {
				对局.主角.生命 += 99;
				return "【狗狗使用「添~滋溜~滋溜~」，你恢复99点生命！】";
			}
			对局.敌人.逃跑 += 100;
			return "【狗狗有些伤心，准备要离开了！】";
		},
		失败效果: () => {
			存档.伙伴.晓月家进度++;
			存档.物品.熟肉 += 3;
			return "【狗狗点了点头，开心地离开了。狗狗的祝福：获得「熟肉」*3！】";
		},
	},
	{
		名称: "晓月后援1群",
		等级: 100,
		生命: 3345,
		防御: 234,
		压制: 9999,
		损失健康: 1,
		出场语: "“加入我们，才能偷看喔~”",
		攻击后: (对局: 对局类型) => {
			对局.敌人.其他.技能点数++;
			if (对局.敌人.其他.技能点数 <= 4) {
				对局.主角.攻击 += 30;
				return "【后援队使用「加油！」，你增加30点攻击！】";
			}
			对局.敌人.逃跑 += 100;
			return "【后援队有些失望，准备要离开了！】";
		},
		失败效果: () => {
			存档.伙伴.晓月家进度++;
			存档.物品.女装++;
			return "【“好吧，你确实配得上我老婆，加油吧~”。粉丝的祝福：获得「女装」*1！】";
		},
	},
	{
		名称: "晓月管家",
		等级: 130,
		生命: 4335,
		防御: 300,
		压制: 9999,
		损失健康: 1,
		出场语: "“不好意思，这里没大米哈~”",
		攻击后: (对局: 对局类型) => {
			对局.敌人.其他.技能点数++;
			if (对局.敌人.其他.技能点数 <= 3) {
				存档.金钱++;
				return "【管家给了你1毛钱~】";
			}
			对局.主角.生命 -= 99999;
			return "【“还不走？”】";
		},
		失败效果: (对局: 对局类型) => {
			存档.伙伴.晓月家进度++;
			存档.金钱 -= 对局.敌人.其他.技能点数;
			存档.金钱 += 20;
			return "【“现在年轻人脸皮都这么厚嘛！”。你把钱还给了管家。管家的祝福：获得2元！】";
		},
		胜利效果: (对局: 对局类型) => {
			存档.金钱 -= 3;
			return "【“做人不要太贪！滚出去！”。你被轰出院子，失去3毛钱！】";
		},
	},
	{
		名称: "晓月哥",
		等级: 170,
		生命: 5650,
		防御: 500,
		压制: 9999,
		损失健康: 1,
		出场语: "“想抢走我妹妹？先从我身上踏过去！”",
		攻击时: (对局: 对局类型) => {
			const e = Math.random() * 100;
			if (e < 40) {
				对局.敌人.生命 -= 999;
				return `【${对局.敌人.名称}使用「信心打击」，反弹，${对局.敌人.名称}受到${999}点伤害！】`;
			}
			if (e < 60) {
				对局.敌人.生命 += 2 * 999;
				return `【${对局.敌人.名称}感觉有点口干，喝了一口水，恢复${2 * 999}点生命！】`;
			}

			const t = Math.floor(999 - 对局.主角.防御);
			对局.伤害.基础加成 += t;
			return `【${对局.敌人.名称}使用「信心打击」，你受到${t}点伤害！】`;
		},
		失败效果: () => {
			存档.伙伴.晓月家进度++;
			const e = Math.min(Math.floor(0.05 * 存档.伙伴.晓月好感 + 5), 55);
			存档.防御 += e;
			return `【“你走吧，我想静静~”。哥哥的祝福：防御永久增加${e}（与晓月好感有关）！】`;
		},
	},
	{
		名称: "晓月妈",
		等级: 220,
		生命: 7300,
		防御: 510,
		压制: 9999,
		损失健康: 1,
		出场语: "“做啥工作？工资多少？有没有买房？”",
		被攻击时: (对局: 对局类型) => {
			const e = Math.floor(0.3 * 存档.金钱);
			对局.敌人.攻击++;
			if (对局.敌人.攻击 <= 3) {
				对局.敌人.其他.技能点数 += e;
				存档.金钱 -= e;
				return `【你给了晓月妈${(e / 10).toFixed(1)}元！】`;
			}

			if (对局.敌人.其他.技能点数 < 20) {
				对局.伤害.基础加成 -= 999999;
				return "【“哈哈哈哈哈”】";
			} else{
				对局.敌人.生命 -= 999999;
				return "【“哈哈哈哈哈”】";
			}
		},
		失败效果: () => {
			存档.伙伴.晓月家进度++;

			const e = Math.min(Math.floor(0.5 * 存档.伙伴.晓月好感 + 50), 550);
			存档.最大生命 += e;
			return `【“好像还有点钱嗷~”。母上大人的祝福：生命永久增加${e}（与晓月好感有关）！】`;
		},
		胜利效果: () => {
			return "【“穷成这样~我敢把女儿交给你？”。你被赶出屋来！】"
		},
	},
	{
		名称: "晓月爸",
		等级: 300,
		生命: 9999,
		攻击: 1200,
		防御: 500,
		压制: 9999,
		损失健康: 1,
		出场语: "“你要是能打败我，我就让你带走晓月”",
		方法: "空手道",
		攻击时: (对局: 对局类型) => {
			if (4 == 对局.敌人.其他.技能点数) {
				const e = 对局.敌人.攻击 * (1 + 对局.敌人.其他.技能点数);
				对局.伤害.基础加成 += e
				return `【${对局.敌人.名称}使用「空手道.锁喉！」，你受到${e}点伤害！】`;
			}

			对局.敌人.其他.技能点数++;
			const t = Math.floor(0.5 * 对局.敌人.攻击);
			对局.伤害.基础加成 += t;

			对局.主角.防御-= Math.floor(0.1 * 对局.主角.防御);
			return `【${对局.敌人.名称}使用「空手道.穿心！」你受到${t}点伤害，防御降低10%！】`;
		},
		被攻击时: (对局: 对局类型) => {
			对局.敌人.攻击 += Math.floor(0.05 * 对局.敌人.攻击);
			return `【${对局.敌人.名称}使用「空手道.蓄气！」，${对局.敌人.名称}攻击强化！】`;
		},
		失败效果: () => {
			存档.伙伴.晓月家进度++;

			const e = Math.min(Math.floor(0.1 * 存档.伙伴.晓月好感 + 10), 110);
			存档.攻击 += e;
			return `【父亲大人的祝福：攻击永久增加${e}（与晓月好感有关）！】`;
		},
	},

	// 流浪汉系列
	{
		名称: "流浪汉(懒)",
		等级: 5,
		生命: 215,
		压制: 30,
		出场语: "“求求你放过我吧，我两天没吃饭啦~(ㄒoㄒ)”",
		掉落物: [
			{
				概率: 100,
				数量: 1,
				名称: "金钱",
			},
		],
		攻击时: (对局: 对局类型) => {
			if (存档.金钱 >= 1) {
				对局.敌人.其他.技能点数++;

				对局.主角.攻击 -= 10;
				存档.金钱--;
				return `【${对局.敌人.名称}使用「求饶」，你的攻击下降10点，并给了对方0.1元】`;
			}
			对局.敌人.逃跑 += 100;
			return "【流浪汉发现你根本没钱，打算要溜了！】";
		},
		失败效果: (对局: 对局类型) => {
			存档.其他.流浪汉系列击杀次数++;
			存档.金钱 += 对局.敌人.其他.技能点数;
			return `【你拿回${(对局.敌人.其他.技能点数 / 10).toFixed(1)}元】\n【“你们全是没同情心的坏人！”】`;
		},
	},
	{
		名称: "流浪汉(宅)",
		等级: 12,
		生命: 445,
		防御: 9999,
		压制: 9999,
		损失健康: 1,
		出场语: "“没看见我在玩手机吗！”",
		掉落物: [
			{
				概率: 100,
				数量: 2,
				名称: "金钱",
			},
		],
		攻击时: (对局: 对局类型) => {
			if (Math.random() * 100 < 50) {
				对局.敌人.生命 -= 99;
				return `【${对局.敌人.名称}使用「嘴遁」，但是被你反弹，${对局.敌人.名称}受到99点伤害！】`;
			}
			对局.伤害.基础加成 += 99;
			return `【${对局.敌人.名称}使用「嘴遁」，你受到99点伤害！】`;
		},
		失败效果: () => {
			存档.其他.流浪汉系列击杀次数++;
			return "【“老子特么就服你！”】";
		},
		胜利效果: (对局: 对局类型) => {
			const n = Math.floor(Math.max(0.1 * 存档.金钱, 0));
			存档.金钱 -= n;
			return "【你损失10%的钱！】";
		},
	},
	{
		名称: "流浪汉(女)",
		等级: 20,
		生命: 775,
		压制: 9999,
		损失健康: 3,
		出场语: "“我真的没偷你的钱！不信你搜啊！”",
		掉落物: [
			{
				概率: 100,
				数量: 1,
				名称: "女装",
			},
		],
		攻击后: (对局: 对局类型) => {
			对局.敌人.其他.技能点数++;
			if (Math.random() * 100 < 20 * 对局.敌人.其他.技能点数) {
				对局.主角.生命 -= 9999;
				return "【你被吃瓜群众围殴，损失9999点生命！】";
			}
			return `【${对局.敌人.名称}在大声呼救！】`;
		},
		被攻击后: (对局: 对局类型) => {
			const t = Math.random() * 100;
			if (t <= 40) {
				const i = 50 - 对局.主角.防御;
				对局.主角.生命 -= i;
				return `【你从${对局.敌人.名称}身上搜到发霉的男式内衣，你损失${i}点生命！】`;
			}
			if (t > 40 && t <= 60) {
				存档.金钱++;
				return `【你从${对局.敌人.名称}身上搜到0.1元！】`;
			}
			if (t > 60) {
				对局.敌人.生命 -= 对局.主角.攻击;
				return "【你碰到一个奇怪的东西...】";
			}
		},
		失败效果: () => {
			存档.其他.流浪汉系列击杀次数++;
			return "【“(ಥ_ಥ)有人耍流氓哇”】";
		},
		胜利效果: () => {
			return  "【你被吃瓜群众围殴，损失9999点生命！】"
		},
	},
	{
		名称: "流浪汉(暴)",
		等级: 32,
		生命: 1150,
		压制: 9999,
		攻击: 400,
		损失健康: 1,
		出场语: "快把钱交出来，就饶你一命！",
		掉落物: [
			{
				概率: 100,
				数量: 5,
				名称: "金钱",
			},
		],
		方法: "疯狂",
		攻击时: (对局: 对局类型) => {
			const n = 400 * Math.random()
			对局.伤害.基础加成 += n;
			return `【${对局.敌人.名称}使用「疯狂」，你受到${n}点伤害】`;
		},
		失败效果: () => {
			存档.其他.流浪汉系列击杀次数++;
			return "【你抢回被偷的钱！】";
		},
		胜利效果: (对局: 对局类型) => {

			const n = Math.floor(Math.max(0.2 * 存档.金钱, 0));
			存档.金钱 -= n;
			return "【你损失20%的钱！】";
		},
	},
	{
		名称: "流浪汉(失业)",
		等级: 46,
		生命: 1670,
		防御: 99999,
		压制: 9999,
		损失健康: 1,
		增加属性: 3,
		出场语: "求求你给我找一份工作吧！(ಥ﹏ಥ)~哇！哇~哇——！",
		掉落物: [
			{
				概率: 100,
				数量: 6,
				名称: "果子",
			},
		],
		攻击后: (对局: 对局类型) => {
			const t = (233 - 对局.主角.防御) * (对局.敌人.其他.技能点数 + 1);
			const n = 233 * (对局.敌人.其他.技能点数 + 1);
			对局.主角.生命 -= t;
			对局.敌人.生命 -= n;
			对局.敌人.其他.技能点数++;
			return `【你和流浪一起抱头痛哭，你损失${t}点生命，流浪汉损失${n}点生命】`;
		},
		被攻击时: (对局: 对局类型) => {
			const t = 66 * 对局.敌人.其他.技能点数;
			对局.敌人.生命 += t;
			return `【你在安慰流浪汉，流浪汉恢复了${t}点生命】`;
		},
		失败效果: () => {
			存档.其他.流浪汉系列击杀次数++;
		},
	},
	{
		名称: "流浪汉(赌)",
		等级: 66,
		生命: 2300,
		防御: 60,
		攻击: 353,
		压制: 9999,
		损失健康: 1,
		出场语: "如果你赢啦我给你1毛钱，输啦我剁你一根手指，如何？",
		掉落物: [
			{
				概率: 100,
				数量: 9,
				名称: "金钱",
			},
		],
		攻击时: (对局: 对局类型) => {
			if (Math.random() * 100 < 20 + 20 * 对局.敌人.其他.技能点数) {
				对局.伤害.独立乘区 *= 3
				return `【你输啦，损失${对局.伤害.初始值 * 3}点生命】`;
			} else{
				对局.伤害.独立乘区 *= 0
				对局.敌人.其他.技能点数++;
				存档.金钱++;
				return "【你赢啦，获得0.1元！】";
			}
		},
		失败效果: () => {
			存档.其他.流浪汉系列击杀次数++;
		},
		胜利效果: (对局: 对局类型) => {
			const n = Math.floor(Math.max(0.25 * 存档.金钱 + 对局.敌人.其他.技能点数, 0));
			存档.金钱 -= n;
			return "【你损失全部赢得钱，和自己25%的钱！】";
		},
	},
	{
		名称: "流浪汉(毒)",
		等级: 92,
		生命: 3080,
		防御: 92,
		攻击: 560,
		压制: 9999,
		损失健康: 3,
		增加声望: 2,
		增加属性: 2,
		出场语: "！",
		掉落物: [
			{
				概率: 100,
				数量: 2,
				名称: "白色粉末",
			},
		],
		方法: "！",
		攻击时: (对局: 对局类型) => {
			对局.敌人.其他.技能点数++;
			const a = 60 * 对局.敌人.其他.技能点数;
			对局.伤害.基础加成 += a;
			return `【流浪汉使用「撕咬」，每回合损失${a}点生命（${对局.敌人.其他.技能点数}层）】`;
		},
		被攻击时: (对局: 对局类型) => {
			对局.敌人.其他.技能点数++;
			const n = 60 * 对局.敌人.其他.技能点数;
			对局.主角.生命 -= n;
			return `【中毒：每回合损失${n}点生命（${对局.敌人.其他.技能点数}层）】`;
		},
		失败效果: () => {
			存档.其他.流浪汉系列击杀次数++;
		},
		胜利效果: (对局: 对局类型) => {
			const n = Math.floor(Math.max(0.3 * 存档.金钱, 0));
			存档.金钱 -= n;
			return "【你损失30%的钱！】";
		},
	},

	// 蚊子系列
	{
		名称: "蚊小满",
		等级: 10,
		生命: 380,
		损失健康: 1,
		出场语: "嗡嗡-嗡！",
		攻击: 20,
		掉落物: [
			{
				概率: 100,
				数量: 1,
				名称: "木材",
			},
			{
				概率: 100,
				数量: 1,
				名称: "亚麻",
			},
		],
		方法: "叮咬",
		攻击后: (对局: 对局类型) => {
			对局.敌人.生命 += 对局.伤害.计算结果;
			return `【${对局.敌人.名称}吸取了${对局.伤害.计算结果}点生命！】`;
		},
		失败效果: () => {
			存档.其他.蚊子系列击杀次数++
			存档.其他.消灭蚊子数++;
			存档.物品.蚊子尸体++;
			return `【你已消灭${存档.其他.消灭蚊子数}只蚊子，获得「蚊子尸体」*1】`;
		},
	},
	{
		名称: "大毛蚊",
		等级: 20,
		生命: 710,
		压制: 10,
		攻击: 60,
		损失健康: 1,
		出场语: "%$#%$#%#^&^",
		掉落物: [
			{
				概率: 100,
				数量: 2,
				名称: "木材",
			},
			{
				概率: 100,
				数量: 2,
				名称: "亚麻",
			},
		],
		方法: "叮咬",
		攻击后: (对局: 对局类型) => {
			对局.敌人.生命 += 对局.伤害.计算结果;
			对局.敌人.攻击 += 10;
			return `【${对局.敌人.名称}吸取了${对局.伤害.计算结果}点生命！${对局.敌人.名称}攻击+10】`;
		},
		失败效果: () => {
			存档.其他.蚊子系列击杀次数++
			存档.其他.消灭蚊子数++;
			存档.物品.蚊子尸体++;
			return `【你已消灭${存档.其他.消灭蚊子数}只蚊子，获得「蚊子尸体」*1】`;
		},
	},
	{
		名称: "密斯特蚊",
		等级: 35,
		生命: 1200,
		攻击: 120,
		压制: 15,
		损失健康: 1,
		出场语: "嗡--------！",
		掉落物: [
			{
				概率: 100,
				数量: 3,
				名称: "木材",
			},
			{
				概率: 100,
				数量: 3,
				名称: "亚麻",
			},
		],
		方法: "叮咬",
		攻击后: (对局: 对局类型) => {
			对局.敌人.生命 += 对局.伤害.计算结果 * 对局.敌人.其他.技能点数;
			对局.敌人.其他.技能点数 ++
			return `【${对局.敌人.名称}吸取了${对局.伤害.计算结果}点生命！${对局.敌人.名称}吸血能力强化！】`;
		},
		失败效果: () => {
			存档.其他.蚊子系列击杀次数++
			存档.其他.消灭蚊子数++;
			存档.物品.蚊子尸体++;
			return `【你已消灭${存档.其他.消灭蚊子数}只蚊子，获得「蚊子尸体」*1】`;
		},
	},
	{
		名称: "阿蚊",
		等级: 50,
		生命: 1665,
		攻击: 200,
		压制: 20,
		损失健康: 1,
		增加声望: 1,
		掉落物: [
			{
				概率: 100,
				数量: 4,
				名称: "木材",
			},
			{
				概率: 100,
				数量: 4,
				名称: "亚麻",
			},
		],
		方法: "叮咬",
		攻击后: (对局: 对局类型) => {
			对局.敌人.生命 += 对局.伤害.计算结果;
			对局.敌人.防御 += 30;
			return `【${对局.敌人.名称}吸取了${对局.伤害.计算结果}点生命！${对局.敌人.名称}防御+30】`;
		},
		失败效果: () => {
			存档.其他.蚊子系列击杀次数++
			存档.其他.消灭蚊子数++;
			存档.物品.蚊子尸体++;
			return `【你已消灭${存档.其他.消灭蚊子数}只蚊子，获得「蚊子尸体」*1】`;
		},
	},
	{
		名称: "徐蚊强",
		等级: 70,
		生命: 2465,
		压制: 25,
		损失健康: 1,
		增加声望: 1,
		攻击: 320,
		掉落物: [
			{
				概率: 100,
				数量: 5,
				名称: "木材",
			},
			{
				概率: 100,
				数量: 5,
				名称: "亚麻",
			},
		],
		方法: "叮咬",
		攻击后: (对局: 对局类型) => {
			对局.敌人.生命 += Math.floor(对局.伤害.计算结果 * (2 - 对局.敌人.生命 / 对局.敌人.最大生命))
			return `【${对局.敌人.名称}吸取了${对局.伤害.计算结果}点生命！】`;
		},
		失败效果: () => {
			存档.其他.蚊子系列击杀次数++
			存档.其他.消灭蚊子数++;
			存档.物品.蚊子尸体++;
			return `【你已消灭${存档.其他.消灭蚊子数}只蚊子，获得「蚊子尸体」*1】`;
		},
	},
	{
		名称: "莫斯奇托蚊",
		等级: 80,
		生命: 3333,
		压制: 30,
		损失健康: 1,
		增加声望: 1,
		攻击: 520,
		掉落物: [
			{
				概率: 100,
				数量: 5,
				名称: "木材",
			},
			{
				概率: 100,
				数量: 5,
				名称: "亚麻",
			},
		],
		方法: "叮咬",
		攻击后: (对局: 对局类型) => {
			对局.敌人.生命 += Math.floor(对局.伤害.计算结果)
			return `【${对局.敌人.名称}吸取了${对局.伤害.计算结果}点生命！】`;
		},
		失败效果: () => {
			存档.其他.蚊子系列击杀次数++
			存档.其他.消灭蚊子数++;
			存档.物品.蚊子尸体++;
			return `【你已消灭${存档.其他.消灭蚊子数}只蚊子，获得「蚊子尸体」*1】`;
		},
	},
	{
		名称: "蚊女王",
		等级: 99,
		生命: 4200,
		压制: 33,
		攻击: 560,
		损失健康: 1,
		增加声望: 2,
		出场语: "血红的肚子，如同宝石般纯净无暇！",
		掉落物: [
			{
				概率: 100,
				数量: 10,
				名称: "木材",
			},
			{
				概率: 100,
				数量: 10,
				名称: "亚麻",
			},
			{
				概率: 100,
				数量: 1,
				名称: "幸运石",
			},
		],
		攻击后: (对局: 对局类型) => {
			对局.敌人.生命 += 对局.伤害.计算结果;
			return `【${对局.敌人.名称}吸取了${对局.伤害.计算结果}点生命！】`;
		},
		失败效果: () => {
			存档.其他.蚊子系列击杀次数++
			存档.其他.消灭蚊子数++;
			存档.物品.蚊子尸体++;
			return `【你已消灭${存档.其他.消灭蚊子数}只蚊子，获得「蚊子尸体」*1】`;
		},
	},

	// 女贼系列
	{
		名称: "女贼(小学生)",
		等级: 7,
		生命: 210,
		压制: 20,
		出场语: "..嘻嘻..(≥▽≤)y",
		攻击后: (对局: 对局类型) => {
			if (存档.金钱 > 0) {
				对局.敌人.其他.技能点数++;
				存档.金钱--;
				对局.敌人.逃跑 += 10
				return "【你被偷走0.1元，女贼想要溜(￣﹏￣)】";
			}
			return "【“穷成这B样也敢出来？”】";
		},
		失败效果: (对局: 对局类型) => {
			const n = 对局.敌人.其他.技能点数 + 5;
			存档.金钱 += n;
			存档.其他.贼系列击杀数++;
			return `【获得${(n / 10).toFixed(1)}元！】【“呜呜呜，我告诉我姐去”】`;
		},
	},
	{
		名称: "女贼她姐",
		等级: 16,
		生命: 575,
		压制: 20,
		攻击: 20,
		损失健康: 1,
		出场语: "( ' – ' )你就那个怪蜀黍？",
		掉落物: [
			{
				概率: 100,
				数量: 4,
				名称: "金钱",
			},
		],
		攻击时: (对局: 对局类型) => {
			const t = Math.max(15 * 对局.敌人.其他.技能点数, 0);
			对局.伤害.基础加成 += t;
			对局.主角.防御-= 15;

			对局.敌人.其他.技能点数++;
			return `【${对局.敌人.名称}使用「泰山压顶（130kg）」，你受到${t}点伤害！你感觉喘呼吸困难！防御降低15点！】`;
		},
		失败效果: () => {
			存档.其他.贼系列击杀数++;
		},
		胜利效果: (对局: 对局类型) => {
			const n = Math.floor(Math.max(0.2 * 存档.金钱, 0));
			存档.金钱 -= n;
			return "【你损失20%的钱！】";
		},
	},
	{
		名称: "女贼她小姨",
		等级: 20,
		生命: 700,
		攻击: 80,
		压制: 20,
		损失健康: 1,
		出场语: "来嘛！过来玩会儿~",
		掉落物: [
			{
				概率: 100,
				数量: 6,
				名称: "金钱",
			},
		],
		攻击时: (对局: 对局类型) => {
			对局.主角.攻击 -= 25;
			对局.敌人.其他.技能点数++;

			const a = 对局.敌人.其他.技能点数 * Math.max(30 - 对局.主角.防御, 5);
			对局.伤害.基础加成 += a;

			存档.金钱 -= 对局.敌人.其他.技能点数;
			存档.金钱 < 0 && (存档.金钱 = 0);
			return `【${对局.敌人.名称}用身体在你身上蹭了蹭，你攻击减少25，生命减少${a}，金钱减少${(对局.敌人.其他.技能点数 / 10).toFixed(1)}元】`;
		},
		失败效果: (对局: 对局类型) => {
			存档.其他.贼系列击杀数++;

			存档.金钱 += Math.min(对局.敌人.其他.技能点数, 10);
			return "【你抢回被偷的钱！】";
		},
		胜利效果: (对局: 对局类型) => {
			const n = Math.floor(Math.max(0.15 * 存档.金钱, 0));
			存档.金钱 -= n;
			return "【你损失15%的钱！】";
		},
	},
	{
		名称: "女贼她妈",
		等级: 35,
		生命: 1200,
		最大生命: 1200,
		攻击: 150,
		防御: 36,
		压制: 20,
		损失健康: 1,
		掉落物: [{
			概率: 100,
			名称: '金钱',
			数量: 8
		}],
		出场语: "快把钱交出来！",
		攻击前: (对局: 对局类型)  => {
			对局.主角.攻击 -= 30;
			const e = Math.floor(0.03 * 对局.主角.攻击);
			对局.伤害.基础加成 += e
			return `【${对局.敌人.名称}使用色诱，你的攻击降低30点，生命减少${e}】`;
		},
		胜利效果: (对局: 对局类型) => {
			const n = Math.floor(Math.max(0.1 * 存档.金钱, 0));
			存档.金钱 -= n;
			return "【你损失10%的钱！】";
		},
		失败效果: () => {
			存档.其他.贼系列击杀数++;
		},
	},
	{
		名称: "女贼她奶奶",
		等级: 45,
		生命: 1500,
		防御: 30,
		压制: 20,
		攻击: 80,
		损失健康: 1,
		出场语: "打劫(〃'▽'〃)！",
		掉落物: [
			{
				概率: 100,
				数量: 10,
				名称: "金钱",
			},
		],
		方法: "打劫",
		攻击时: (对局: 对局类型) => {
			对局.敌人.其他.技能点数++;
			const t = 80 * 对局.敌人.其他.技能点数;
			对局.伤害.基础加成 += t;
			return `【放血：每回合损失${t}点生命（${对局.敌人.其他.技能点数}层）】`;
		},
		失败效果: () => {
			存档.其他.贼系列击杀数++;
		},
		胜利效果: (对局: 对局类型) => {
			const n = Math.floor(Math.max(0.1 * 存档.金钱, 0));
			存档.金钱 -= n;
			return "【你损失10%的钱！】";
		},
	},
	{
		名称: "女贼集团总裁（精英）",
		等级: 60,
		生命: 1999,
		攻击: 310,
		防御: 50,
		压制: 20,
		损失健康: 1,
		增加声望: 1,
		增加属性: 2,
		出场语: "快把钱交出来！",
		掉落物: [
			{
				概率: 100,
				数量: 12,
				名称: "金钱",
			},
		],
		攻击时: (对局: 对局类型) => {
			对局.敌人.其他.技能点数++;
			const t = 100 * 对局.敌人.其他.技能点数;
			对局.伤害.基础加成 += t;
			return `【流血：每回合损失${t}点生命（${对局.敌人.其他.技能点数}层）】`;
		},
		失败效果: () => {
			存档.其他.贼系列击杀数++;
		},
		胜利效果: (对局: 对局类型) => {
			const n = Math.floor(Math.max(0.15 * 存档.金钱, 0));
			存档.金钱 -= n;
			return "【你损失15%的钱！】";
		},
	},
	{
		名称: "贼女王（精英）",
		等级: 80,
		生命: 2700,
		防御: 60,
		压制: 20,
		损失健康: 1,
		增加声望: 2,
		增加属性: 3,
		攻击: 400,
		出场语: "嘿嘿(º﹃º )，咱们来玩cosplay吧~",
		掉落物: [
			{
				概率: 100,
				数量: 15,
				名称: "金钱",
			},
			{
				概率: 100,
				数量: 15,
				名称: "金钱",
			},
			{
				概率: 100,
				数量: 1,
				名称: "晓月手链",
			},
		],
		攻击时: (对局: 对局类型) => {
			对局.敌人.其他.技能点数++;
			if (对局.敌人.其他.技能点数 % 3 == 0) {
				const n = 100 * 对局.敌人.其他.技能点数
				对局.伤害.基础加成 += n;

				const a = 20 * 对局.敌人.其他.技能点数;
				对局.主角.攻击 -= a;
				return `【女王使用「黑色高跟鞋」，你损失${n}点生命，并降低${a}点攻击】`;
			} else{
				对局.主角.生命 += 200;
				对局.主角.防御-= 100
				return "【女王使用「皮鞭」，你恢复200点生命，降低100点防御】";
			}
		},
		被攻击时: (对局: 对局类型) => {
			对局.敌人.生命 += 200;
			return "【女王有点小兴奋，恢复200点生命】";
		},
		失败效果: () => {
			存档.其他.贼系列击杀数++;
		},
		胜利效果: (对局: 对局类型) => {
			const n = Math.floor(Math.max(0.15 * 存档.金钱, 0));
			存档.金钱 -= n;
			return "【你损失15%的钱！】";
		},
	},

	// 吸毒男系列
	{
		名称: "吸毒男（BOSS）",
		等级: 120,
		生命: 3999,
		攻击: 760,
		防御: 120,
		压制: 30,
		损失健康: 2,
		增加声望: 3,
		增加属性: 3,
		出场语: "“没错，她就是为了我才当贼女王的...我是个废物..”",
		掉落物: [
			{
				概率: 100,
				数量: 2,
				名称: "白色粉末",
			},
		],
		攻击时: (对局: 对局类型) => {
			const n = Math.floor(Math.max(0.25 * (对局.敌人.最大生命 - 对局.敌人.生命) - 对局.主角.防御 + 0.01 * 对局.敌人.生命, 0));
			对局.伤害.基础加成 += n;

			const a = Math.floor(0.3 * n);
			对局.敌人.生命 += a;
			return `【毒男使用「嗜血狂魔」，你受到${n}点伤害,毒男恢复${a}点生命】`;
		},
		被攻击时: (对局: 对局类型) => {
			对局.敌人.其他.技能点数++;
			const n = 200 * 对局.敌人.其他.技能点数;
			对局.主角.生命 -= n;
			return `【中毒：每回合损失${n}点生命】`;
		},
		失败效果: () => {
			存档.其他.毒男系列击杀数++;
			return "“也许，死是一种解脱吧...再见了...我的女王...”";
		},
		胜利效果: (对局: 对局类型) => {
			const n = Math.floor(Math.max(0.2 * 存档.金钱, 0));
			存档.金钱 -= n;
			return "【你损失20%的钱！】";
		},
	},
	{
		名称: "吸毒男2阶（BOSS）",
		等级: 180,
		生命: 5980,
		攻击: 1087,
		防御: 418,
		压制: 40,
		损失健康: 2,
		增加声望: 3,
		增加属性: 3,
		出场语: "“我是不会死的，我一定要为她报仇！”",
		掉落物: [
			{
				概率: 100,
				数量: 2,
				名称: "白色粉末",
			},
		],
		攻击时: (对局: 对局类型) => {
			const n = Math.floor(Math.max(0.25 * (对局.敌人.最大生命 - 对局.敌人.生命) - 对局.主角.防御 + 0.01 * 对局.敌人.生命, 0));
			对局.伤害.基础加成 += n;

			const a = Math.floor(0.3 * n);
			对局.敌人.生命 += a;
			return `【毒男使用「嗜血狂魔」，你受到${n}点伤害,毒男恢复${a}点生命】`;
		},
		被攻击时: (对局: 对局类型) => {
			const n = Math.floor(0.2 * 对局.敌人.攻击);
			对局.敌人.其他.技能点数++;
			const a = n * 对局.敌人.其他.技能点数;
			对局.主角.生命 -= a;
			return `【中毒：每回合损失${a}点生命】`;
		},
		失败效果: () => {
			存档.其他.毒男系列击杀数++;
			return "“...不甘心...啊...”";
		},
		胜利效果: (对局: 对局类型) => {
			const n = Math.floor(Math.max(0.2 * 存档.金钱, 0));
			存档.金钱 -= n;
			return "【你损失20%的钱！】";
		},
	},
	{
		名称: "吸毒男3阶（BOSS）",
		等级: 300,
		生命: 9999,
		攻击: 1800,
		防御: 700,
		压制: 50,
		损失健康: 2,
		增加声望: 3,
		增加属性: 3,
		出场语: "“就算没手，我还有脚！”",
		掉落物: [
			{
				概率: 100,
				数量: 2,
				名称: "白色粉末",
			},
		],
		攻击时: (对局: 对局类型) => {
			const n = Math.floor(Math.max(0.25 * (对局.敌人.最大生命 - 对局.敌人.生命) - 对局.主角.防御 + 0.01 * 对局.敌人.生命, 0));
			对局.伤害.基础加成 += n;

			const a = Math.floor(0.3 * n);
			对局.敌人.生命 += a;
			return `【毒男使用「嗜血狂魔」，你受到${n}点伤害,毒男恢复${a}点生命】`;
		},
		被攻击时: (对局: 对局类型) => {
			const n = Math.floor(0.2 * 对局.敌人.攻击);
			对局.敌人.其他.技能点数++;
			const a = n * 对局.敌人.其他.技能点数;
			对局.主角.生命 -= a;
			return `【中毒：每回合损失${a}点生命】`;
		},
		失败效果: () => {
			存档.其他.毒男系列击杀数++;
			return "“啊！我的脚！”";
		},
		胜利效果: (对局: 对局类型) => {
			const n = Math.floor(Math.max(0.2 * 存档.金钱, 0));
			存档.金钱 -= n;
			return "【你损失20%的钱！】";
		},
	},
	{
		名称: "吸毒男4阶（BOSS）",
		等级: 500,
		生命: 16520,
		攻击: 3000,
		防御: 1200,
		压制: 60,
		损失健康: 2,
		增加声望: 3,
		增加属性: 3,
		出场语: "“就算没手没脚，我还有嘴！”",
		掉落物: [
			{
				概率: 100,
				数量: 2,
				名称: "白色粉末",
			},
		],
		攻击时: (对局: 对局类型) => {
			const n = Math.floor(Math.max(0.25 * (对局.敌人.最大生命 - 对局.敌人.生命) - 对局.主角.防御 + 0.01 * 对局.敌人.生命, 0));
			对局.伤害.基础加成 += n;

			const a = Math.floor(0.3 * n);
			对局.敌人.生命 += a;
			return `【毒男使用「嗜血狂魔」，你受到${n}点伤害,毒男恢复${a}点生命】`;
		},
		被攻击时: (对局: 对局类型) => {
			const n = Math.floor(0.2 * 对局.敌人.攻击);
			对局.敌人.其他.技能点数++;
			const a = n * 对局.敌人.其他.技能点数;
			对局.主角.生命 -= a;
			return `【中毒：每回合损失${a}点生命】`;
		},
		失败效果: () => {
			存档.其他.毒男系列击杀数++;
			return "..e..e.e..e..a..a";
		},
		胜利效果: (对局: 对局类型) => {
			const n = Math.floor(Math.max(0.2 * 存档.金钱, 0));
			存档.金钱 -= n;
			return "【你损失20%的钱！】";
		},
	},
	{
		名称: "吸毒男5阶（BOSS）",
		等级: 999,
		生命: 32995,
		攻击: 6000,
		防御: 2400,
		压制: 70,
		损失健康: 2,
		增加声望: 3,
		增加属性: 3,
		出场语: "哧溜~哧溜~毒男拖着半截身子爬了过来~",
		掉落物: [
			{
				概率: 100,
				数量: 2,
				名称: "白色粉末",
			},
		],
		攻击时: (对局: 对局类型) => {
			const n = Math.floor(Math.max(0.25 * (对局.敌人.最大生命 - 对局.敌人.生命) - 对局.主角.防御 + 0.01 * 对局.敌人.生命, 0));
			对局.伤害.基础加成 += n;

			const a = Math.floor(0.3 * n);
			对局.敌人.生命 += a;
			return `【毒男使用「嗜血狂魔」，你受到${n}点伤害,毒男恢复${a}点生命】`;
		},
		被攻击时: (对局: 对局类型) => {
			const n = Math.floor(0.2 * 对局.敌人.攻击);
			对局.敌人.其他.技能点数++;
			const a = n * 对局.敌人.其他.技能点数;
			对局.主角.生命 -= a;
			return `【中毒：每回合损失${a}点生命】`;
		},
		失败效果: () => {
			存档.其他.毒男系列击杀数++;
			return "毒男化成一缕青烟，飘散在蓝天白云中..."
		},
		胜利效果: (对局: 对局类型) => {
			const n = Math.floor(Math.max(0.2 * 存档.金钱, 0));
			存档.金钱 -= n;
			return "【你损失20%的钱！】";
		},
	},
	{
		名称: "吸毒男终阶（BOSS）",
		等级: 1200,
		生命: 65990,
		攻击: 9600,
		防御: 4800,
		压制: 90,
		损失健康: 3,
		增加声望: 5,
		增加属性: 5,
		出场语: "“肉体早已消散...如今的我，只是一缕毒烟！”",
		掉落物: [
			{
				概率: 100,
				数量: 3,
				名称: "白色粉末",
			},
		],
		攻击时: (对局: 对局类型) => {
			const n = Math.floor(Math.max(0.35 * (对局.敌人.最大生命 - 对局.敌人.生命) - 对局.主角.防御 + 0.02 * 对局.敌人.生命, 0));
			对局.伤害.基础加成 += n;

			const a = Math.floor(0.5 * n);
			对局.敌人.生命 += a;
			return `【毒男使用「毒烟噬命」，你受到${n}点毒烟伤害，毒烟恢复${a}点虚无生命】`;
		},
		被攻击时: (对局: 对局类型) => {
			const n = Math.floor(0.25 * 对局.敌人.攻击);
			对局.敌人.其他.技能点数++;
			const a = n * 对局.敌人.其他.技能点数 * 2;
			对局.主角.生命 -= a;
			return `【烟毒侵蚀：每回合损失${a}点生命（毒烟层数：${对局.敌人.其他.技能点数}）】`;
		},
		失败效果: () => {
			存档.其他.毒男系列击杀数++;
			return "最后一缕毒烟随清风散去，消散在空气中，仿佛从未存在过一般...";
		},
		胜利效果: (对局: 对局类型) => {
			const n = Math.floor(Math.max(0.3 * 存档.金钱, 0));
			存档.金钱 -= n;
			return "【你损失30%的钱！】";
		},
	},


	// 挑战进度
	{
		名称: "眼镜王蛇（精英）",
		等级: 15,
		生命: 545,
		攻击: 60,
		压制: 9999,
		损失健康: 1,
		增加声望: 1,
		出场语: "呼哧~呼哧~",
		掉落物: [
			{
				概率: 100,
				数量: 2,
				名称: "生肉",
			},
			{
				概率: 100,
				数量: 1,
				名称: "创可贴",
			},
		],
		方法: "毒蚀",
		攻击时: (对局: 对局类型) => {
			const n = 对局.伤害.初始值 * 对局.敌人.其他.技能点数;
			对局.伤害.基础加成 += n;
			对局.敌人.其他.技能点数++;
			return `【中毒：每回合损失${n}点生命（${对局.敌人.其他.技能点数}层）】`;
		},
		失败效果: () => {
			存档.其他.挑战进度++;
		},
	},
	{
		名称: "逃犯（精英）",
		等级: 25,
		生命: 850,
		攻击: 80,
		防御: 20,
		压制: 9999,
		损失健康: 1,
		增加声望: 1,
		掉落物: [
			{
				概率: 100,
				数量: 2,
				名称: "伤药",
			},
			{
				概率: 100,
				数量: 1,
				名称: "放大镜",
			},
		],
		攻击时: (对局: 对局类型) => {
			const n = Math.floor(Math.max(0.2 * 对局.敌人.生命 - 对局.主角.防御, 0));
			对局.伤害.基础加成 += n;
			return `【${对局.敌人.名称}使用「咆哮」，你受到${n}点伤害】`;
		},
		失败效果: () => {
			存档.其他.挑战进度++;
		},
	},
	{
		名称: "深渊巨蟒",
		等级: 35,
		生命: 875,
		压制: 9999,
		损失健康: 1,
		增加声望: 1,
		增加属性: 3,
		出场语: "特注：战斗结束后巨蟒不会回满血！！！",
		掉落物: [
			{
				概率: 100,
				数量: 3,
				名称: "生肉",
			},
			{
				概率: 100,
				数量: 1,
				名称: "幸运石",
			},
		],
		战斗初始化: (对局: 对局类型) => {
			const 真实满血 = 对局.敌人.生命;
			对局.敌人.最大生命 = 真实满血;

			if(!存档.特殊敌人["深渊巨蟒"]){
				存档.特殊敌人["深渊巨蟒"] = {
					生命: 真实满血,
				}
			}else{
				对局.敌人.生命 = 存档.特殊敌人["深渊巨蟒"].生命;
				if(对局.敌人.生命 <= 0){
					对局.敌人.生命 = 真实满血;
					存档.特殊敌人["深渊巨蟒"].生命 = 真实满血;
				}
			}
		},
		方法: "缠绕",
		攻击前: (对局: 对局类型) => {
			对局.攻击.初始值 = Math.floor(0.07 * 对局.敌人.生命)
		},
		被攻击后: (对局: 对局类型) => {
			存档.特殊敌人["深渊巨蟒"].生命 = 对局.敌人.生命;
		},
		胜利效果: (对局: 对局类型) => {
			存档.特殊敌人["深渊巨蟒"].生命 = 对局.敌人.生命;
		},
		失败效果: (对局: 对局类型) => {
			存档.特殊敌人["深渊巨蟒"].生命 = 对局.敌人.生命;
			存档.其他.挑战进度++;
		},
	},
	{
		名称: "机械人（被害妄想症）",
		等级: 45,
		生命: 1500,
		防御: 60,
		攻击: 699,
		压制: 9999,
		损失健康: 1,
		增加声望: 1,
		出场语: "“我必需得这么走路，别人才不会害我”",
		掉落物: [
			{
				概率: 100,
				数量: 1,
				名称: "放大镜",
			},
			{
				概率: 100,
				数量: 6,
				名称: "金钱",
			},
			{
				概率: 100,
				数量: 1,
				名称: "放大镜",
			},
		],
		方法: "电钻",
		攻击时: (对局: 对局类型) => {
			if (Math.random() * 100 < 70) {
				对局.伤害.独立乘区 *= 0
				return  "【机械人电钻戳歪了！】";
			}
			return `【机械人电钻戳中！】`;
		},
		被攻击时: (对局: 对局类型) => {
			对局.主角.攻击 -= 40;
			return "【机械人使用「神奇舞蹈」，太逗啦！你降低40点攻击】";
		},
		失败效果: () => {
			存档.其他.挑战进度++;
		},
	},
	{
		名称: "女剑士（中二病他姐）",
		等级: 60,
		生命: 2100,
		攻击: 310,
		压制: 9999,
		损失健康: 1,
		增加声望: 1,
		出场语: "“我在找一个小男孩”",
		掉落物: [
			{
				概率: 100,
				数量: 1,
				名称: "晓月手链",
			},
			{
				概率: 100,
				数量: 8,
				名称: "金钱",
			},
		],
		方法: "剑刺",
		攻击时: (对局: 对局类型) => {
			if (Math.random() * 100 < 50) {
				对局.主角.防御-= 20;
				return "【女剑士使用「弱点打击」，你降低20点防御】";
			} else{
				对局.主角.攻击 -= 40;
				return "【女剑士使用「弱点打击」，你降低40点攻击】";
			}
		},
		被攻击时: (对局: 对局类型) => {
			对局.敌人.其他.技能点数 ++
			if (Math.random() * 100 < Math.min(20 + 5 * 对局.敌人.其他.技能点数, 40)) {
				const t = Math.floor(0.5 * 对局.主角.攻击);
				对局.伤害.独立乘区 *= 0
				对局.主角.生命 -= t;
				return `【${对局.敌人.名称}使用「格挡」「反弹」，你减少${t}点生命！（${Math.min(20 + 5 * 对局.敌人.其他.技能点数, 40)}%触发）】`;
			}
		},
		失败效果: () => {
			存档.其他.挑战进度++;
			return "【激活特性「攻击强化2」】";
		},
	},
	{
		名称: "天下第一乖（么么啾）",
		等级: 80,
		生命: 2680,
		防御: 80,
		攻击: 660,
		压制: 9999,
		损失健康: 1,
		增加声望: 1,
		出场语: "“m(_ _)m主银饶命啊！我是你的女仆(*･ω-q)  ”",
		掉落物: [
			{
				概率: 100,
				数量: 1,
				名称: "小裤裤",
			},
			{
				概率: 100,
				数量: 2,
				名称: "幸运石",
			},
		],
		攻击时: (对局: 对局类型) => {
			const n = Math.random() * 100;
			if (n < 30) {
				对局.主角.生命 += 233;
				return "【么么啾给在给你捏脚，你恢复233点生命！】";
			}
			if (n >= 30 && n < 70) {
				对局.主角.防御-= 130;
				return "【么么啾袭击了你的胸部，你降低130点防御】";
			}
			if (n >= 70) {
				对局.伤害.独立乘区 *= 3
				return `【么么啾使用「大铁锤」——绝后一击！造成3倍伤害！！】`;
			}
		},
		失败效果: () => {
			存档.其他.挑战进度++;
			return "“呜呜呜，主银你不要我吗\n(ಥ﹏ಥ)”";
		},
	},
	{
		名称: "红狼",
		等级: 120,
		生命: 12000,
		攻击: 360,
		防御: 140,
		压制: 9999,
		损失健康: 1,
		出场语: "“喵？”「晓风提示：从此怪开始，后续怪血量激增，但是攻防下调~」",
		掉落物: [
			{
				概率: 100,
				数量: 3,
				名称: "火狐皮",
			},
			{
				概率: 100,
				数量: 2,
				名称: "创可贴",
			},
		],
		攻击时: (对局: 对局类型) => {
			const n = Math.random() * 100;
			对局.敌人.其他.技能点数++;
			if (n < Math.min(20 + 4 * 对局.敌人.其他.技能点数, 50)) {
				const a = Math.floor(1.5 * 对局.敌人.攻击 - 对局.主角.防御);
				对局.伤害.基础加成 += a;
				return `【${对局.敌人.名称}使用「暴击」，伤害增加${a}点！】`;
			}
		},
		被攻击时: (对局: 对局类型) => {
			if (Math.random() * 100 < Math.min(20 + 4 * 对局.敌人.其他.技能点数, 50)) {
				对局.伤害.独立乘区 *= 0
				return `【${对局.敌人.名称}躲避了你的攻击！（${ Math.min(20 + 4 * 对局.敌人.其他.技能点数, 50)}%触发）】`;
			}
		},
		失败效果: () => {
			存档.其他.挑战进度++;
		},
	},
	{
		名称: "8号拳师",
		等级: 155,
		生命: 15155,
		攻击: 470,
		防御: 180,
		压制: 9999,
		损失健康: 1,
		出场语: "“已经好多年没人来过这里啦~”",
		掉落物: [
			{
				概率: 100,
				数量: 2,
				名称: "幸运石",
			},
			{
				概率: 100,
				数量: 2,
				名称: "板砖",
			},
		],
		方法: "拳击",
		攻击时: (对局: 对局类型) => {
			对局.敌人.其他.技能点数++;
	
			const e = 对局.敌人.攻击;
			const t = Math.floor(0.1 * 对局.敌人.攻击 * 对局.敌人.其他.技能点数);
			对局.伤害.基础加成 += e + t;

			对局.主角.防御-= Math.floor(0.05 * 对局.主角.防御);
			return `【${对局.敌人.名称}使用「碎骨爆裂拳！」你受到${e}点伤害，附加${t}流血，防御降低5%！】`;
		},
		被攻击时: (对局: 对局类型) => {
			对局.敌人.攻击 += Math.floor(0.05 * 对局.敌人.攻击);
			return `【${对局.敌人.名称}使用「集中」，${对局.敌人.名称}攻击强化！】`;
		},
		失败效果: () => {
			存档.其他.挑战进度++;
		},
	},
	{
		名称: "双枪老太婆",
		等级: 245,
		生命: 24120,
		攻击: 1,
		防御: 280,
		压制: 9999,
		损失健康: 1,
		出场语: "“其实我最擅长的不是枪~”",
		掉落物: [
			{
				概率: 100,
				数量: 6,
				名称: "子弹",
			},
			{
				概率: 100,
				数量: 2,
				名称: "女装",
			},
		],
		方法: "枪击",
		攻击时: (对局: 对局类型) => {
			if (Math.random() * 100 < 50) {
				const e = Math.floor(0.25 * 对局.主角.生命);
				对局.伤害.基础加成 += e;
				return `【${对局.敌人.名称}使用「P18C手枪」！你损失${e}点生命(当前生命的25%)！】`;
			}
			const e = Math.floor(0.25 * (对局.主角.最大生命 - 对局.主角.生命));
			对局.伤害.基础加成 += e;
			return `【${对局.敌人.名称}使用「AKM突击枪」！你损失${e}点生命(已损失生命的25%)！】`;
		},
		被攻击时: (对局: 对局类型) => {
			if (Math.random() * 100 < 30 + 10 * 对局.敌人.其他.技能点数) {
				对局.敌人.其他.技能点数++;
				对局.伤害.独立乘区 *= 0
				return `【${对局.敌人.名称}闪避了你的攻击！并且下次闪避概率提升！】`;
			}
		},
		失败效果: () => {
			存档.其他.挑战进度++;
			return "【激活特性「攻击强化3」】";
		},
	},
	{
		名称: "自爆蛋",
		等级: 300,
		生命: 99999,
		防御: 350,
		压制: 9999,
		损失健康: 1,
		出场语: "惹不起~惹不起~",
		掉落物: [
			{
				概率: 100,
				数量: 1,
				名称: "┑(=^ω^=)┑",
			},
			{
				概率: 100,
				数量: 2,
				名称: "护身符",
			},
		],
		攻击时: (对局: 对局类型) => {
			对局.敌人.防御 += Math.floor(0.1 * 对局.敌人.防御);
			return `【${对局.敌人.名称}就这么静静的看着你~】`;
		},
		被攻击时: (对局: 对局类型) => {
			对局.敌人.其他.技能点数 ++

			if (对局.敌人.其他.技能点数 < 8) {
				const e = Math.floor(对局.敌人.防御);
				对局.主角.生命 -= e;
				return `【${对局.敌人.名称}「蛋身一震」！你受到${e}点反弹伤害！】`;
			}
			对局.主角.生命 -= 9999999;
			return "【自爆！！！！】";
		},
		失败效果: () => {
			存档.其他.挑战进度++;
		},
		胜利效果: () => {
			return "【天啦噜！自爆蛋爆炸啦啊啊啊啊！你被炸飞啦~】"
		},
	},

	{
		名称: "晓风基因计划",
		等级: 500,
		生命: 599999,
		压制: -50,
		损失健康: 1,
		增加声望: 1,
		出场语: "「晓风：由于基因计划属于研发失败的产品，有些功能并不完善，目前还不具备自动修复能力；但是在这个世界的某处，还沉睡着一个来自同一胚胎、即将完工的伟大作品！」",
		掉落物: [
			{
				概率: 100,
				数量: 4,
				名称: "放大镜",
			},
		],

		战斗初始化: (对局: 对局类型) => {
			const 真实满血 = 对局.敌人.生命;
			对局.敌人.最大生命 = 真实满血;

			if(!存档.特殊敌人["晓风基因计划"]){
				存档.特殊敌人["晓风基因计划"] = {
					生命: 对局.敌人.生命,
					等级: 对局.敌人.等级,
					防御: 对局.敌人.防御,
					攻击: 对局.敌人.攻击,
				}
			}else{
				对局.敌人.生命 = 存档.特殊敌人["晓风基因计划"].生命;
				对局.敌人.等级 = 存档.特殊敌人["晓风基因计划"].等级;
				对局.敌人.防御 = 存档.特殊敌人["晓风基因计划"].防御;
				对局.敌人.攻击 = 存档.特殊敌人["晓风基因计划"].攻击;

				if(对局.敌人.生命 <= 0){
					对局.敌人.生命 = 真实满血;
					存档.特殊敌人["晓风基因计划"].生命 = 真实满血;
				}
			}
		},

		攻击时: (对局: 对局类型) => {
			if (对局.敌人.攻击 < 1500) {
				对局.敌人.攻击 += 4;
				对局.敌人.等级++;
			}
			if (对局.敌人.等级 > 580) {
				对局.敌人.其他.技能点数++;
				const e = 对局.敌人.攻击;
				const t = Math.floor(0.05 * 对局.敌人.攻击 * 对局.敌人.其他.技能点数);
				对局.伤害.基础加成 += e + t;
				return `【基因计划使用「进化.感染」你受到${e}点伤害，附加${t}点生化伤害！】`;
			}
		},
		被攻击时: (对局: 对局类型) => {
			if (对局.敌人.防御 < 600) {
				对局.敌人.防御 += 2;
				对局.敌人.等级++;
			}
			if (对局.敌人.等级 > 530) {
				const e = Math.max(对局.敌人.防御 - 28, 0);
				对局.主角.生命 -= e;
				return `【基因计划使用「模仿.反弹」你受到${e}点伤害！】`;
			}
			return "【基因计划静静的看着你...】";
		},
		被攻击后: (对局: 对局类型) => {
			存档.特殊敌人["晓风基因计划"].攻击 = 对局.敌人.攻击;
			存档.特殊敌人["晓风基因计划"].防御 = 对局.敌人.防御;
			存档.特殊敌人["晓风基因计划"].等级 = 对局.敌人.等级;
			存档.特殊敌人["晓风基因计划"].生命 = 对局.敌人.生命;
		},
		胜利效果: (对局: 对局类型) => {
			存档.特殊敌人["晓风基因计划"].攻击 = 对局.敌人.攻击;
			存档.特殊敌人["晓风基因计划"].防御 = 对局.敌人.防御;
			存档.特殊敌人["晓风基因计划"].等级 = 对局.敌人.等级;
			存档.特殊敌人["晓风基因计划"].生命 = 对局.敌人.生命;
		},
		失败效果: (对局: 对局类型) => {
			存档.特殊敌人["晓风基因计划"].攻击 = 对局.敌人.攻击;
			存档.特殊敌人["晓风基因计划"].防御 = 对局.敌人.防御;
			存档.特殊敌人["晓风基因计划"].等级 = 对局.敌人.等级;
			存档.特殊敌人["晓风基因计划"].生命 = 对局.敌人.生命;
			存档.其他.挑战进度++;
		},
	},
	{
		名称: "一块黑色的石头",
		等级: 200,
		生命: 299999,
		压制: -50,
		损失健康: 1,
		出场语: "「特注：这真的是块石头！」",
		掉落物: [
			{
				概率: 100,
				数量: 6,
				名称: "黑曜石",
			},
		],
		战斗初始化: (对局: 对局类型) => {
			const 真实满血 = 对局.敌人.生命;
			对局.敌人.最大生命 = 真实满血;

			if(!存档.特殊敌人["一块黑色的石头"]){
				存档.特殊敌人["一块黑色的石头"] = {
					生命: 对局.敌人.生命,
					防御: 对局.敌人.防御,
				}
			}else{
				对局.敌人.生命 = 存档.特殊敌人["一块黑色的石头"].生命;
				对局.敌人.防御 = 存档.特殊敌人["一块黑色的石头"].防御;

				if(对局.敌人.生命 <= 0){
					对局.敌人.生命 = 真实满血;
					存档.特殊敌人["一块黑色的石头"].生命 = 真实满血;
				}
			}
		},
		被攻击时: (对局: 对局类型) => {
			if (对局.敌人.防御 < 300) {
				对局.敌人.防御++;
			}
			const e = 2 * 对局.敌人.防御;
			对局.主角.生命 -= e;
			return `【你受到${e}点反弹伤害！】`;
		},
		胜利效果: (对局: 对局类型) => {
			存档.特殊敌人["一块黑色的石头"].防御 = 对局.敌人.防御;
			存档.特殊敌人["一块黑色的石头"].生命 = 对局.敌人.生命;
		},
		失败效果: (对局: 对局类型) => {
			存档.特殊敌人["一块黑色的石头"].防御 = 对局.敌人.防御;
			存档.特殊敌人["一块黑色的石头"].生命 = 对局.敌人.生命;
		
			存档.其他.挑战进度++;
		},
	},
	{
		名称: "机甲少女",
		等级: 380,
		生命: 36570,
		攻击: 1143,
		防御: 440,
		压制: 9999,
		损失健康: 1,
		出场语: "“(ಡωಡ)hiahiahia”\n「碾压」技能效果：对于防御低于自身的目标造成2倍伤害",
		掉落物: [
			{
				概率: 100,
				数量: 4,
				名称: "晓月手链",
			},
			{
				概率: 100,
				数量: 2,
				名称: "小裤裤",
			},
		],
		攻击时: (对局: 对局类型) => {
			if (对局.主角.防御 < 对局.敌人.防御) {
				对局.伤害.独立乘区 *= 2;
				return `【机甲少女使用「碾压」对你造成2倍伤害】`;
			}
			对局.敌人.防御 += Math.floor(0.3 * 对局.敌人.防御);
			return "【机甲少女使用「护甲强化」防御增加30%】";
		},
		被攻击时: (对局: 对局类型) => {
			if (Math.random() * 100 < Math.min(20 + 5 * 对局.敌人.其他.技能点数, 100)) {
				const e = Math.floor(对局.主角.攻击);
				对局.主角.生命 -= e;
				return `【机甲少女使用「机甲护体」，你受到${e}点弹刀伤害！（你攻击的100%，${Math.min(20 + 5 * 对局.敌人.其他.技能点数, 100)}%触发）】`;
			}
			对局.敌人.其他.技能点数++;
			return "【机甲少女「机甲护体」触发几率提高！】";
		},
		失败效果: () => {
			存档.其他.挑战进度++;
		},
	},
	{
		名称: "炮击少女",
		等级: 600,
		生命: 60815,
		攻击: 1804,
		防御: 700,
		压制: 9999,
		损失健康: 1,
		出场语: "“要来一炮吗？”",
		掉落物: [
			{
				概率: 100,
				数量: 4,
				名称: "幸运石",
			},
			{
				概率: 100,
				数量: 4,
				名称: "板砖",
			},
		],
		攻击时: (对局: 对局类型) => {
			对局.敌人.其他.技能点数++;

			if (对局.敌人.其他.技能点数 % 3 == 0) {
				return `【${对局.敌人.名称}使用「战争践踏！」，你被一脚剁飞啦！】`;
			} 
			if (对局.敌人.其他.技能点数 % 3 == 1) {
				对局.伤害.基础加成 += 4 * 对局.敌人.攻击
				return `【${对局.敌人.名称}使用「对空一击！」！你损失${4 * 对局.敌人.攻击}点生命！】`;
			}
			if (对局.敌人.其他.技能点数 % 3 == 2) {
				对局.敌人.攻击 += Math.floor(0.4 * 对局.敌人.攻击);
				对局.敌人.生命 += Math.floor(0.3 * 对局.敌人.最大生命);
				return `【${对局.敌人.名称}坐地点了一根烟，吐了一个烟圈，生命恢复30%，攻击提高40%！】`;
			}
		},
		失败效果: () => {
			存档.其他.挑战进度++;
		},
	},
	{
		名称: "吾王",
		等级: 750,
		生命: 72000,
		攻击: 2299,
		防御: 999,
		压制: 9999,
		损失健康: 1,
		出场语: "“嗷嗷嗷~吃早饭咯~”\n「不屈的意志！」技能效果:如果对方生命百分比高于自身，则造成3倍无视防御的伤害！并恢复自身10%生命",
		掉落物: [
			{
				概率: 100,
				数量: 1,
				名称: "黑刀",
			},
			{
				概率: 100,
				数量: 1,
				名称: "红夹克",
			},
		],
		攻击时: (对局: 对局类型) => {
			if ((对局.主角.生命/对局.主角.最大生命) > (对局.敌人.生命/对局.敌人.最大生命)) {
				const e = 3 * 对局.敌人.攻击;
				对局.伤害.基础加成 += e
				对局.敌人.生命 += Math.floor(0.1 * 对局.敌人.最大生命);
				对局.敌人.其他.技能点数 -= 3;
				return `【吾王使用「不屈的意志！」，造成${e}点伤害！自身恢复10%生命！吾王怒气减3】`;
			}
			if (Math.random() * 100 < Math.min(30 + 5 * 对局.敌人.其他.技能点数, 100)) {
				const e = Math.floor(1.2 * 对局.敌人.攻击);
				对局.伤害.基础加成 += e
				对局.敌人.其他.技能点数--;
				return `【吾王使用「誓约胜利之剑！暴击！」，造成${e}点伤害！吾王怒气减1】`;
			}
			const e = 对局.敌人.攻击 - 对局.主角.防御;
			对局.伤害.基础加成 += e
			对局.敌人.生命 += Math.floor(0.1 * 对局.敌人.最大生命);
			对局.敌人.其他.技能点数++;
			return `【吾王使用「誓约胜利之剑！」，造成${e}点伤害，并获得2点怒气（下次暴击率提高！）】`;
		},
		被攻击时: (对局: 对局类型) => {
			if (Math.random() * 100 < Math.min(30 + 5 * 对局.敌人.其他.技能点数, 60)) {
				对局.敌人.攻击 += Math.floor(0.05 * 对局.敌人.攻击);
				对局.伤害.独立乘区 *= 0
				return `【${对局.敌人.名称}使用「风王结界」，免疫伤害，攻击增加5%，！】`;
			}
			对局.敌人.其他.技能点数 += 2;
			return "【吾王获得2点怒气（下次结界触发几率提高！）】";
		},
		失败效果: () => {
			存档.其他.挑战进度++;
		},
	},
	{
		名称: "晓风",
		等级: 999,
		生命: 99999,
		防御: 1999,
		压制: 9999,
		损失健康: 1,
		掉落物: [
			{
				概率: 100,
				数量: 3,
				名称: "晓风披肩",
			},
		],
		被攻击时: (对局: 对局类型) => {
			const e = [
				"「对于国产游戏，」”",
				"「我始终坚信，」",
				"「什么样的环境孕育出什么样的作品。」",
				"「那些嘲讽国产游戏的人，」",
				"「本质上是在嘲讽自己————你低估了自己的力量。」”",
				"「国产游戏的未来，」",
				"「在你的手中，」",
				"「而不是开发商或者平台...」",
				"「一起共勉吧。晓风 2017.10.16」",
			][对局.敌人.其他.技能点数]
			对局.敌人.其他.技能点数++;
			if (e) {
				对局.伤害.独立乘区 *= 0
				return  e
			} else {
				对局.敌人.生命 -= 99999
			}
		},
		失败效果: () => {
			存档.其他.挑战进度++;
			return "“再会吧~朋友...”";
		},
	},
	{
		名称: "天庭（BOSS）",
		等级: 9999,
		生命: 9999999,
		攻击: 9999,
		防御: 1999,
		压制: 99999,
		损失健康: 1,
		增加声望: 99,
		出场语: "何人在殿外喧嚣？",
		方法: "天威",
		攻击时: (对局: 对局类型) => {
			if (Math.random() * 100 < Math.min(40 + 3 * 对局.敌人.其他.技能点数, 80)) {
				对局.伤害.独立乘区 *= 5;
				return `【${对局.敌人.名称}震怒！发动「殿主天威」，伤害*5！（${Math.min(40 + 3 * 对局.敌人.其他.技能点数, 80)}%触发）】`;
			} else {
				return `【${对局.敌人.名称}冷冷一瞥，威压降临！】`;
			}
		},
		被攻击时: (对局: 对局类型) => {
			if (Math.random() * 100 < Math.min(30 + 4 * 对局.敌人.其他.技能点数, 70)) {
				对局.伤害.独立乘区 *= 0;
				const back = Math.floor(0.5 * 对局.主角.攻击);
				对局.主角.生命 -= back;
				return `【${对局.敌人.名称}发动「王权格挡」，免疫伤害并反弹 ${back} 点！】`;
			}
			对局.敌人.其他.技能点数 += 2;
			return `【${对局.敌人.名称}怒气攀升！】`;
		},
		失败效果: () => {
			存档.其他.挑战进度 ++
			return "【殿主之位易主！你踏碎王座，执掌万殿权柄，从此世间再无喧嚣，唯尔独尊！】";
		},
		胜利效果: () => {
			return "【胆敢在殿内放肆，此乃自取灭亡！】"
		}
	},

	// 荒野剧情
	{
		名称: "女贼（呆萌）",
		生命: 60,
		压制: 9999,
		出场语: "把钱交出来<(｀^′)>",
		攻击时: (对局: 对局类型) => {
			if (存档.金钱 > 0) {
				存档.金钱--;
				对局.敌人.其他.技能点数++;
				return "【你被偷走0.1元(笑)】";
			}
			return "【“哼！不跟你玩了！”】";
		},
		失败效果: (对局: 对局类型) => {
			const n = Math.min(10, 对局.敌人.其他.技能点数 + 3);
			存档.金钱 += n;
			return `【你从女贼身上抢到${(n / 10).toFixed(1)}元】`;
		},
	},
	{
		名称: "银环蛇（精英）",
		等级: 6,
		生命: 210,
		攻击: 7,
		压制: 9999,
		损失健康: 3,
		增加声望: 1,
		增加属性: 2,
		出场语: "~嘶~嘶！~",
		掉落物: [
			{
				概率: 100,
				数量: 3,
				名称: "生肉",
			},
		],
		方法: "毒液",
		攻击时: (对局: 对局类型) => {
			const n = 对局.伤害.初始值 * 对局.敌人.其他.技能点数;
			对局.伤害.基础加成 += n;
			对局.敌人.其他.技能点数++;
			return `【中毒：每回合损失${n}点生命（${对局.敌人.其他.技能点数}层）】`;
		},
	},

	// 县城剧情
	{
		名称: "胡渣壮汉（精英）",
		等级: 12,
		生命: 485,
		攻击: 30,
		压制: 9999,
		损失健康: 3,
		增加声望: 2,
		增加属性: 2,
		出场语: "“给老子滚远点~！”",
		掉落物: [
			{
				概率: 100,
				数量: 2,
				名称: "伤药",
			},
			{
				概率: 100,
				数量: 1,
				名称: "香烟",
			},
			{
				概率: 100,
				数量: 1,
				名称: "啤酒",
			},
			{
				概率: 100,
				数量: 1,
				名称: "板砖",
			},
		],
		攻击前: (对局: 对局类型) => {
			对局.敌人.攻击 += 7;
			return "【壮汉暴跳如雷，攻击强化！】";
		},
		被攻击时: (对局: 对局类型) => {
			if (Math.random() * 100 < 35) {
				const n = 对局.主角.攻击 - 对局.主角.防御;
				对局.主角.生命 -= n;
				return `【壮汉使用「反震」，你损失${n}点生命！】`;
			}
		},
		失败效果: () => {
			存档.剧情.击败壮汉 = true;
			return "【“你给老子等着！”】";
		},
		胜利效果: (对局: 对局类型) => {
			存档.物品.熟肉 = 0;
			存档.物品.香烟 = 0;
			return "【你损失全部的熟肉和香烟！】【“别让老子再看到你，听见没！”】";
		},
	},
	{
		名称: "西装男（精英）",
		等级: 10,
		生命: 410,
		攻击: 30,
		压制: 9999,
		损失健康: 3,
		增加声望: 1,
		出场语: "“小兄弟，过来一下”",
		掉落物: [
			{
				概率: 50,
				数量: 1,
				名称: "护身符",
			},
			{
				概率: 50,
				数量: 1,
				名称: "护身符",
			},
		],
		攻击时: (对局: 对局类型) => {
			对局.敌人.其他.技能点数++;
			if (对局.敌人.其他.技能点数 % 3 == 0) {
				对局.敌人.生命 += 99;
				对局.敌人.攻击 += 5;
				return `【${对局.敌人.名称}使用「治疗」，恢复99点生命，攻击提高5点！】`;
			}
		},
		失败效果: (对局: 对局类型) => {
			存档.剧情.击败西装男 = true
			存档.物品.西装 += 1
			return `【${对局.敌人.名称}逃走了！获得【西装】*1】`;
		},
		胜利效果: (对局: 对局类型) => {
			const n = 存档.金钱;
			存档.金钱 -= n;
			return "【你损失全部的钱！】";
		},
	},
	{
		名称: "醉汉（精英）",
		等级: 15,
		生命: 545,
		压制: 9999,
		损失健康: 1,
		增加声望: 1,
		攻击: 120,
		增加属性: 2,
		出场语: "“不还酒，就别想走！”",
		掉落物: [
			{
				概率: 100,
				数量: 1,
				名称: "板砖",
			},
		],
		攻击时: (对局: 对局类型) => {
			对局.敌人.生命 -= 99;
			return `【醉汉使用「拼命」，醉汉损失99点生命！】`;
		},
		失败效果: (对局: 对局类型) => {
			存档.剧情.击败醉汉 = true
		},
	},
	{
		名称: "刀疤男（BOSS）",
		等级: 23,
		生命: 855,
		攻击: 100,
		压制: 9999,
		损失健康: 3,
		增加声望: 3,
		增加属性: 3,
		出场语: "“x你x！”",
		掉落物: [
			{
				概率: 100,
				数量: 1,
				名称: "红夹克",
			},
		],
		攻击时: (对局: 对局类型) => {
			const n = Math.floor(Math.max(0.25 * (对局.敌人.最大生命 - 对局.敌人.生命) - 对局.主角.防御 + 20, 0));
			对局.伤害.基础加成 += n;

			const a = Math.floor(0.3 * n);
			对局.敌人.生命 += a;
			return `【刀疤男使用「嗜血狂魔」，你受到${n}点伤害,刀疤男恢复${a}点生命】`;
		},
		被攻击时: (对局: 对局类型) => {
			if (Math.random() * 100 < 15) {
				对局.伤害.独立乘区 *= 0
				return "【刀疤男使用「格挡」！】";
			}
		},
		失败效果: (对局: 对局类型) => {
			存档.剧情.击败刀疤 = true
			return `【${对局.敌人.名称}被人救走了！】`;
		},
		胜利效果: (对局: 对局类型) => {
			存档.精力 = 0;
			return "【你受重伤！损失全部的精力】";
		},
	},

	// 山脉剧情
	{
		名称: "看守者",
		等级: 15,
		生命: 540,
		攻击: 40,
		压制: 9999,
		损失健康: 1,
		出场语: "“我叫你滚啦！——”",
		掉落物: [
			{
				概率: 100,
				数量: 1,
				名称: "白色粉末",
			},
		],
		攻击时: (对局: 对局类型) => {
			对局.敌人.生命 -= 50;
			return `【看守者使用「拼命」，看守者损失50点生命】`;
		},
		失败效果: () => {
			存档.剧情.击败看守者 = true
			return `【你已拥有白色粉末*${存档.物品.白色粉末}】`
		}
	},
	{
		名称: "追杀者",
		等级: 35,
		生命: 1498,
		压制: 9999,
		损失健康: 3,
		出场语: "“我不跟你多BB哈~杀手得有个B样！”",
		掉落物: [
			{
				概率: 100,
				数量: 2,
				名称: "白色粉末",
			},
		],
		攻击时: (对局: 对局类型) => {
			对局.敌人.其他.技能点数++;
			if (对局.敌人.其他.技能点数 <= 20) {
				if ( Math.random() * 100 < 85) {
					return "【追杀者拿起铁锹，向你发射了一颗子弹！但是未命中】";
				}
				const a = 699 - 对局.主角.防御;
				对局.主角.生命 -= a;
				return `【追杀者拿起铁锹，向你发射了一颗子弹！击中！你损失${a}点生命！】`;
			}
			return "【追杀者拿起铁锹，但是发现没子弹啦！】";
		},
		失败效果: () => {
			存档.剧情.击败追杀者 = true
			return `【你已拥有白色粉末*${存档.物品.白色粉末}】`
		},
		胜利效果: (对局: 对局类型) => {
			存档.物品.白色粉末 = 0;
			return "【你失去所有白色粉末！】";
		},
	},
	{
		名称: "劫匪（精英）",
		等级: 40,
		生命: 1370,
		压制: 9999,
		攻击: 100,
		损失健康: 2,
		增加声望: 2,
		出场语: "“别他妈的挡老子路！”",
		掉落物: [
			{
				概率: 100,
				数量: 6,
				名称: "金钱",
			},
			{
				概率: 50,
				数量: 1,
				名称: "创可贴",
			},
		],
		攻击时: (对局: 对局类型) => {
			const n = 对局.伤害.初始值 * 对局.敌人.其他.技能点数;
			对局.伤害.基础加成 += n;
			对局.敌人.其他.技能点数++;
			return `【劫匪使用「放血」，每回合损失${n}点生命（${对局.敌人.其他.技能点数}层）】`;
		},
		失败效果: () => {
			存档.剧情.击败劫匪 = true
			return "“大爷饶命啊！m(_ _)m”"
		},
		胜利效果: (对局: 对局类型) => "“叫NM多管闲事！”",
	},
	{
		名称: "不干净的流浪汉（精英）",
		等级: 50,
		生命: 1700,
		攻击: 243,
		防御: 50,
		压制: 9999,
		损失健康: 3,
		增加声望: 1,
		出场语: "“我长啥样，心里会没个B数？”",
		掉落物: [
			{
				概率: 100,
				数量: 1,
				名称: "护身符",
			},
			{
				概率: 100,
				数量: 1,
				名称: "滑稽裤",
			},
			{
				概率: 50,
				数量: 1,
				名称: "晓月手链",
			},
		],
		被攻击时: (对局: 对局类型) => {
			if (Math.random() * 100 < 40) {
				const n = 对局.主角.攻击 - 对局.主角.防御;
				对局.主角.生命 -= n;
				return `【流浪汉使用「反震」，你损失${n}点生命！】`;
			}
		},
		失败效果: () => {
			存档.剧情.击败不干净的流浪汉 = true
			return "“你给老子等着！老子还会回来的！”"
		},
		胜利效果: (对局: 对局类型) => "“老子脸上写着王八蛋？”",
	},
	{
		名称: "通缉犯（BOSS）",
		等级: 60,
		生命: 2199,
		防御: 20,
		攻击: 180,
		压制: 9999,
		损失健康: 3,
		增加声望: 5,
		增加属性: 5,
		出场语: "“cnm！别坏老子好事！”",
		掉落物: [
			{
				概率: 100,
				数量: 2,
				名称: "白色粉末",
			},
			{
				概率: 100,
				数量: 1,
				名称: "匕首",
			},
			{
				概率: 100,
				数量: 2,
				名称: "晓月手链",
			},
			{
				概率: 100,
				数量: 1,
				名称: "放大镜",
			},
		],
		攻击前: (对局: 对局类型) => {
			对局.敌人.攻击 += 10 * 对局.敌人.其他.技能点数
			对局.敌人.攻击 -=  40 * 存档.伙伴.选择拯救晓月次数
		},
		攻击时: (对局: 对局类型) => {
			对局.敌人.其他.技能点数++;
			const a = 30 * 对局.敌人.其他.技能点数;
			对局.伤害.基础加成 +=  a;

			const c = Math.floor(0.05 * 对局.敌人.生命);
			对局.敌人.生命 -= c;
			return `【${对局.敌人.名称}使用「拼命3」，每回合损失${a}点生命（流血），杀人犯损失${c}点生命】`;
		},
		被攻击时: (对局: 对局类型) => {
			const n = 对局.敌人.防御;
			对局.敌人.防御 += 20;
			对局.主角.生命 -= n;
			return `【杀人犯使用「霸气护体2」，增加20点防御，你受到${n}点伤害】`;
		},
		失败效果: () => {
			存档.剧情.击败通缉犯 = true
		},
		胜利效果: (对局: 对局类型) => {
			存档.伙伴.晓月关系 = false;
			const 小黑屋 = ['小黑屋1', '小黑屋2','小黑屋3'][存档.伙伴.选择拯救晓月次数]
			存档.当前剧情 = 小黑屋
			保存存档()
			跳转场景("剧情");
		},
	},

	// 省城剧情
	{
		名称: "城中村大佬（精英）",
		等级: 70,
		生命: 2460,
		攻击: 317,
		防御: 141,
		压制: 9999,
		损失健康: 3,
		增加声望: 1,
		出场语: "“你是个sb？”",
		攻击时: (对局: 对局类型) => {
			const t = 对局.主角.防御;
			对局.伤害.基础加成 += t;

			const e = Math.floor(0.15 * (对局.敌人.最大生命 - 对局.敌人.生命));
			对局.敌人.生命 += e
			return `【dalao使用「穿透」，攻击增加${t}点，小兰使用「崇拜」，dalao恢复${e}点生命！】`;
		},
		失败效果: () => {
			存档.剧情.击败城中村大佬 = true
			if (!存档.其他.坎贝尔骨科手术学) {
				存档.其他.坎贝尔骨科手术学 = 1;
				return "你从大佬身上找到一本书，获得《坎贝尔骨科手术学》书籍（请去看书界面使用）！";
			}
		},
		胜利效果: (对局: 对局类型) => {
			存档.金钱 = 0;
			return "你损失全部的金钱！！！";
		},
	},
	{
		名称: "城市治安管理408分队",
		等级: 199,
		生命: 6222,
		攻击: 405,
		防御: 200,
		压制: 9999,
		损失健康: 2,
		增加声望: 1,
		出场语: "“不许睡觉，听到没！”",
		掉落物: [
			{
				概率: 60,
				数量: 1,
				名称: "香烟",
			},
			{
				概率: 60,
				数量: 1,
				名称: "香烟",
			},
			{
				概率: 60,
				数量: 1,
				名称: "香烟",
			},
		],
		失败效果: () => {
			存档.剧情.击败治安小队 = true
			if (存档.伙伴.临时碧瑶关系) {
				存档.伙伴.碧瑶关系 = false
				存档.伙伴.临时碧瑶关系 = false
				存档.伙伴.碧瑶好感 -= 700;
			}
			return "“可以，你们两个给我等好喽！”";
		},
		胜利效果: (对局: 对局类型) => {
			if (存档.伙伴.临时碧瑶关系) {
				存档.伙伴.碧瑶关系 = false
				存档.伙伴.临时碧瑶关系 = false
				存档.伙伴.碧瑶好感 -= 700;
			}
			存档.金钱 -= Math.floor(0.5 * 存档.金钱);
			return "你损失一半的金钱！";
		},
	},
	{
		名称: "城中村大佬（精英）2",
		显示名称: "城中村大佬（精英）",
		等级: 70,
		生命: 2460,
		防御: 121,
		攻击: 317,
		压制: 9999,
		损失健康: 3,
		增加声望: 1,
		出场语: "“你是个sb？”",
		攻击时: (对局: 对局类型) => {
			const e = 对局.主角.防御;
			对局.伤害.基础加成 += e;
			return `【大佬使用「穿透」，伤害增加${e}点！】`;
		},
		被攻击时: (对局: 对局类型) => {
			const e = Math.floor(0.15 * (对局.主角.最大生命 - 对局.主角.生命) + 50);
			对局.主角.生命 += e;
			return `【小兰对你使用「协助」，你恢复${e}点生命！】`;
		},
		失败效果: () => {
			存档.剧情.击败城中村大佬 = true
			if (!存档.其他.坎贝尔骨科手术学) {
				存档.其他.坎贝尔骨科手术学 = 1;
				return "你从大佬身上找到一本书，获得《坎贝尔骨科手术学》书籍（请去看书界面使用）！";
			}
		},
		胜利效果: () => {
			return "“老子打自己的女人，要你管？”"
		}
	},
	{
		名称: "皮衣男（小BOSS）",
		等级: 199,
		生命: 19999,
		防御: 499,
		攻击: 699,
		压制: 9999,
		损失健康: 3,
		增加声望: 1,
		出场语: "“你和她啥关系？”",
		攻击时: (对局: 对局类型) => {
			对局.伤害.基础加成 += Math.floor(0.5 * 对局.主角.防御)

			if (4 == 对局.敌人.其他.技能点数) {
				对局.伤害.独立乘区 *= 3
				return `【${对局.敌人.名称}使用「终结.剔骨」，你受到3倍伤害！】`;
			}

			对局.敌人.其他.技能点数++;
			const n = Math.floor(49 * 对局.敌人.其他.技能点数);
			对局.伤害.基础加成 += n;

			对局.主角.防御-= Math.floor(0.05 * 对局.主角.防御);
			对局.主角.攻击 -= Math.floor(0.05 * 对局.主角.攻击);
			return `【${对局.敌人.名称}使用「放血」你受到${Math.floor(0.5 * 对局.主角.防御)}点伤害，附加${n}流血，攻防降低5%！】`;
		},
		被攻击时: (对局: 对局类型) => {
			if (Math.random() * 100 < 35) {
				const n = Math.floor(0.6 * (对局.主角.攻击 - 对局.主角.防御));
				对局.主角.生命 -= n;
				return `【皮衣男使用「反震」，你损失${n}点生命！】`;
			}
		},
		失败效果: () => {
			存档.剧情.击败皮衣男 = true
			if (!存档.其他.儿童手工DIY) {
				存档.其他.儿童手工DIY = 1;
				return "你从皮衣男身上找到一本书，获得《儿童手工DIY》书籍（请去看书界面使用）！";
			}
		},
	},
	{
		名称: "皮衣男（小BOSS）2",
		显示名称: "皮衣男（小BOSS）",
		等级: 199,
		生命: 19999,
		攻击: 499,
		防御: 499,
		压制: 9999,
		损失健康: 3,
		增加声望: 1,
		出场语: "“你和她啥关系？”",
		攻击时: (对局: 对局类型) => {
			对局.伤害.基础加成 += Math.floor(0.7 * 对局.主角.防御)

			if (4 == 对局.敌人.其他.技能点数) {
				对局.伤害.独立乘区 *= 3
				return `【${对局.敌人.名称}使用「终结.剔骨」，你受到3倍伤害！】`;
			}

			对局.敌人.其他.技能点数++;
			const n = Math.floor(39 * 对局.敌人.其他.技能点数);
			对局.伤害.基础加成 += n;

			对局.主角.防御-= Math.floor(0.05 * 对局.主角.防御);
			对局.主角.攻击 -= Math.floor(0.05 * 对局.主角.攻击);
			return `【${对局.敌人.名称}使用「放血」你受到${Math.floor(0.7 * 对局.主角.防御)}点伤害，附加${n}流血，攻防降低5%！】`;
		},
		被攻击时: (对局: 对局类型) => {
			if (Math.random() * 100 < 35) {
				const n = 对局.主角.攻击 - 对局.主角.防御;
				对局.主角.生命 -= n;
				return `【皮衣男使用「反震」，你损失${n}点生命！】`;
			}
		},
		失败效果: () => {
			if (!存档.其他.儿童手工DIY) {
				存档.其他.儿童手工DIY = 1;
				return "你从皮衣男身上找到一本书，获得《儿童手工DIY》书籍（请去看书界面使用）！";
			}
		},
	},

	// 驱逐系列
	{
		名称: "城管1队",
		等级: 100,
		生命: 16000,
		攻击: 199,
		防御: 120,
		压制: 9567,
		损失健康: 1,
		掉落物: [
			{
				概率: 100,
				数量: 50,
				名称: "金钱",
			},
		],
		攻击时: (对局: 对局类型) => {
			const e = Math.floor(对局.敌人.攻击 - 0.3 * 对局.主角.防御);
			对局.伤害.基础加成 += e;
			return `【${对局.敌人.名称}使用「连拖带拽」！你损失${e}点生命！】`;
		},
		被攻击时: (对局: 对局类型) => {
			对局.主角.防御-= 20;
			return `【${对局.敌人.名称}使用「抱大腿」！你降低20点防御】`;
		},
		失败效果: () => {
			存档.烟瘾率 -= 4;
			return "【奖励：烟瘾永久降低4%】“不想走是吧？可以的！”";
		},
		胜利效果: (对局: 对局类型) => {
			存档.剧情.住在桥洞 = false
			存档.伙伴.晓月关系 = false
			存档.伙伴.碧瑶关系 = false
			存档.按钮.伙伴 = false;
			存档.当前地点 = '郊外'
			return 存档.伙伴.晓月关系 ? "【你被强行赶出城...你与晓月失去了联系。】" : "【你被强行赶出城...】";
		},
	},
	{
		名称: "城管2队",
		等级: 140,
		生命: 23333,
		攻击: 280,
		防御: 160,
		压制: 9567,
		损失健康: 2,
		掉落物: [
			{
				概率: 100,
				数量: 80,
				名称: "金钱",
			},
		],
		攻击时: (对局: 对局类型) => {
			let t = Math.floor(对局.敌人.攻击 - 0.3 * 对局.主角.防御);

			if (Math.random() * 100 < 30 + 5 * 对局.敌人.其他.技能点数) {
				t *= 2;
				对局.伤害.基础加成 += t
				return `【${对局.敌人.名称}使用「致命一击」，你损失${t}点生命！（${30 + 5 * 对局.敌人.其他.技能点数}%触发）】`;
			}

			对局.敌人.其他.技能点数 += 5;
			对局.伤害.基础加成 += t
			return `【${对局.敌人.名称}使用「电棍」，你损失${t}点生命！】`;
		},
		被攻击时: (对局: 对局类型) => {
			if (Math.random() * 100 < 30) {
				对局.伤害.独立乘区 *= 0
				return `【${对局.敌人.名称}使用「防爆盾」！】`;
			}
		},
		失败效果: () => {
			存档.金钱 += 100;
			return "【奖励：10元钱】“小伙子，虽然你确实有两下子，但是你是不可能干过政府滴~”";
		},
		胜利效果: (对局: 对局类型) => {
			存档.剧情.住在桥洞 = false
			存档.伙伴.晓月关系 = false
			存档.伙伴.碧瑶关系 = false
			存档.按钮.伙伴 = false;
			存档.当前地点 = '郊外'
			return 存档.伙伴.晓月关系 ? "【你被强行赶出城...你与晓月失去了联系。】" : "【你被强行赶出城...】";
		},
	},
	{
		名称: "城管3队",
		等级: 200,
		生命: 33332,
		攻击: 400,
		防御: 240,
		压制: 9567,
		损失健康: 3,
		掉落物: [
			{
				概率: 100,
				数量: 120,
				名称: "金钱",
			},
		],
		攻击时: (对局: 对局类型) => {
			const e = Math.floor(对局.敌人.攻击 - 0.3 * 对局.主角.防御);
			对局.伤害.基础加成 += e;
			对局.敌人.生命 += e;
			return `【${对局.敌人.名称}使用「强行验血」，你损失${e}点生命，3队恢复${e}点生命！】`;
		},
		被攻击时: (对局: 对局类型) => {
			对局.敌人.攻击 += 10;
			return `【${对局.敌人.名称}攻击+10！】`;
		},
		失败效果: () => {
			存档.物品.啤酒 += 10;
			return "【奖励：啤酒*10】“报告，你惹了一个惹不起的人！”";
		},
		胜利效果: (对局: 对局类型) => {
			存档.剧情.住在桥洞 = false
			存档.伙伴.晓月关系 = false
			存档.伙伴.碧瑶关系 = false
			存档.按钮.伙伴 = false;
			存档.当前地点 = '郊外'
			return 存档.伙伴.晓月关系 ? "【你被强行赶出城...你与晓月失去了联系。】" : "【你被强行赶出城...】";
		},
	},
	{
		名称: "城管4队",
		等级: 280,
		生命: 48865,
		攻击: 560,
		防御: 330,
		压制: 9567,
		损失健康: 4,
		掉落物: [
			{
				概率: 100,
				数量: 170,
				名称: "金钱",
			},
		],
		攻击时: (对局: 对局类型) => {
			if (Math.random() * 100 <  Math.min(20 + 2 * 对局.敌人.其他.技能点数, 60)) {
				let e = Math.floor(对局.敌人.攻击 - 0.3 * 对局.主角.防御);
				e *= 5;
				对局.伤害.基础加成 += e;
				return `【${对局.敌人.名称}使用「枪击」！击中！你损失${e}点生命！（${Math.min(20 + 2 * 对局.敌人.其他.技能点数, 60)}%击中）】`;
			}
			return `【${对局.敌人.名称}使用「枪击」，但是未命中！（${Math.min(20 + 2 * 对局.敌人.其他.技能点数, 60)}%击中）】`;
		},
		被攻击时: (对局: 对局类型) => {
			对局.敌人.其他.技能点数++;
			对局.敌人.攻击 += 15;
			return `【${对局.敌人.名称}使用集中，攻击+15，且下次枪击命中率提高！】`;
		},
		失败效果: () => {
			存档.物品.子弹 += 20;
			return "【奖励：子弹*20】“老大要来了！”";
		},
		胜利效果: (对局: 对局类型) => {
			存档.剧情.住在桥洞 = false
			存档.伙伴.晓月关系 = false
			存档.伙伴.碧瑶关系 = false
			存档.按钮.伙伴 = false;
			存档.当前地点 = '郊外'
			return 存档.伙伴.晓月关系 ? "【你被强行赶出城...你与晓月失去了联系。】" : "【你被强行赶出城...】";
		},
	},
	{
		名称: "陈晓（大大）",
		等级: 380,
		生命: 65865,
		攻击: 762,
		防御: 450,
		压制: 9567,
		损失健康: 4,
		出场语: "“小伙，看我，帅不帅？”",
		掉落物: [
			{
				概率: 100,
				数量: 230,
				名称: "金钱",
			},
		],
		攻击时: (对局: 对局类型) => {
			const e = 对局.敌人.攻击 + 对局.主角.防御;
			对局.伤害.基础加成 += e;

			const t = Math.floor(0.015 * (对局.敌人.最大生命 - 对局.敌人.生命));
			对局.敌人.生命 += t;
			return `【陈晓使用「晓风.霸王拳」，对你造成${e}点伤害，自身恢复${t}点生命】`;
		},
		被攻击时: (对局: 对局类型) => {
			if (Math.random() * 100 < Math.min(3 * 对局.敌人.其他.技能点数 + 20, 60)) {
				对局.伤害.独立乘区 *= 0

				const t = Math.floor(0.3 * 对局.主角.攻击);
				对局.主角.生命 -= t;
				return `【${对局.敌人.名称}使用「格挡」「反弹」，你减少${t}点生命！】`;
			}
			对局.敌人.其他.技能点数++;
			return "【陈晓下次格挡概率增加！】";
		},
		失败效果: () => {
			存档.物品.晓风披肩 += 5;
			存档.物品.香烟 += 3;
			存档.物品.啤酒 += 5;
			存档.烟瘾率 -= 15;
			return "【奖励：烟瘾降低15%，烟*3，晓风披肩*5，啤酒*5！】“但愿你能赢过政府，虽然我是政府的狗...”";
		},
		胜利效果: (对局: 对局类型) => {
			存档.剧情.住在桥洞 = false
			存档.伙伴.晓月关系 = false
			存档.伙伴.碧瑶关系 = false
			存档.按钮.伙伴 = false;
			存档.当前地点 = '郊外'
			return 存档.伙伴.晓月关系 ? "【你被强行赶出城...你与晓月失去了联系。】" : "【你被强行赶出城...】";
		},
	},
	{
		名称: "挖掘机（BOSS）",
		等级: 999,
		生命: 299999,
		防御: 1299,
		攻击: 999,
		压制: 10000,
		逃跑: -9999,
		损失健康: 5,
		出场语: "“这是专门为你们这些刁民研发的隐藏武器，除了高层，世界上没有人知道，因为知道的都死了！”\n「特点：钢甲巨兽，慢热型对手；高血高防，但前期伤害较低」",
		掉落物: [
			{
				概率: 100,
				数量: 1,
				名称: "眼泪",
			},
		],
		攻击时: (对局: 对局类型) => {
			if(!对局.敌人.其他.充能){
				对局.敌人.其他.充能 = 0
			}

			对局.敌人.其他.技能点数++;
			if (对局.敌人.其他.技能点数 % 7 == 0) {
				const t = Math.max(Math.floor(0.04 * 对局.敌人.防御 * 对局.敌人.其他.充能 - 对局.主角.防御), 1);
				对局.伤害.基础加成 += t;

				对局.敌人.其他.充能++;
				对局.敌人.生命 += t;
				return `【挖掘机使用「加农炮！」你受到${t}点伤害！挖掘机充能+1，恢复${t}点生命！（回复量与挖掘机充能量/主角防御有关）】`;
			}
			if (对局.敌人.其他.技能点数 % 4 == 0) {
				对局.敌人.其他.充能 += 4;
				return "【挖掘机使用「机甲进化」，充能+4！】";
			}
			const n = Math.max(Math.floor(0.01 * 对局.敌人.防御 * 对局.敌人.其他.充能 - 0.5 * 对局.主角.防御), 0);
			对局.伤害.基础加成 += n;
			return `【挖掘机「喷油！灼烧」你受到${n}点灼烧伤害（伤害与挖掘机充能量/主角防御有关）！】`;
		},
		被攻击时: (对局: 对局类型) => {
			对局.敌人.其他.技能点数 ++
			if(!对局.敌人.其他.充能){
				对局.敌人.其他.充能 = 0
			}

			if (对局.敌人.其他.技能点数 % 11 == 0) {
				const n = Math.floor(0.06 * (对局.敌人.最大生命 - 对局.敌人.生命));
				对局.敌人.生命 += n;
				return `【挖掘机启动紧急修复！恢复已损失生命的6%（${n}点）】`;
			}
			if (对局.敌人.其他.技能点数 % 5 == 0) {
				const a = Math.floor(0.2 * 对局.主角.攻击 + 0.2 * 对局.敌人.防御);
				对局.伤害.基础加成 += a;
				return `【挖掘机使用「荆棘钢甲」！你受到${a}点伤害！】`;
			}
			if (对局.敌人.其他.技能点数 % 3 == 0) {
				const i = Math.floor(0.06 * 对局.敌人.防御);
				对局.敌人.防御 += i;
				return `【挖掘机启动「防御系统」！防御增加6%（${i}点）】`;
			}
			if (Math.random() * 100 < Math.min(30 + 2 * 对局.敌人.其他.充能, 60)) {
				对局.敌人.其他.充能++;
				对局.伤害.独立乘区 *= 0
				return `【挖掘机使用「电离屏障」，免疫伤害，充能+1！（${ Math.min(30 + 2 * 对局.敌人.其他.充能, 60)}%触发）】`;
			}

			const c = 2 * 对局.敌人.其他.充能 + 20;
			对局.敌人.防御 += c;
			return `【挖掘机启动「警戒系统」，防御+${c}（增加量与挖掘机当前充能量有关）！】`;
		},
		失败效果: () => {
			存档.剧情.通关 = true
			设置.通关次数 += 1;
			存档.物品.眼泪 ++
			return "【挖掘机流下了一滴泪水...获得「眼泪」*1！你已战胜最终BOSS，游戏即将结束，可以看看还有啥没做完的~】"
		},
		胜利效果: (对局: 对局类型) => {
			存档.剧情.住在桥洞 = false
			存档.伙伴.晓月关系 = false
			存档.伙伴.碧瑶关系 = false
			存档.按钮.伙伴 = false;
			存档.当前地点 = '郊外'
			return 存档.伙伴.晓月关系 ? "【你被驱逐出城。你与晓月失去了联系。】" : "【你桥底的窝被挖掘机铲平...你被赶出城区...】";
		},
	},

	// 公共系列
	{
		名称: "草带男孩（中二病）",
		get 生命() { return 30 + 存档.击败次数["草带男孩（中二病）"] * 80 },
		get 等级() { return 存档.击败次数["草带男孩（中二病）"] * 3 },
		get 攻击() { return 1 + 存档.击败次数["草带男孩（中二病）"] * 15 },
		get 防御() { return 1 + 存档.击败次数["草带男孩（中二病）"] * 6 },
		压制: 20,
		出场语: "“我是要成为第一剑豪的男人！”",
		掉落物: [
			{
				概率: 10,
				数量: 1,
				名称: "幸运石",
			},
		],
		方法: "普攻",
		攻击时: (对局: 对局类型) => {
			const n = 存档.击败次数["草带男孩（中二病）"];

			if (Math.random() * 100 < 10 * n) {
				const a = 2 * 对局.敌人.攻击 - 对局.主角.防御;
				对局.伤害.基础加成 += a;

				const i = 对局.敌人.防御;
				对局.主角.防御-= i;
				return `【男孩使用「啊拖勒啊可痛！」，你受到${a}点伤害，并降低${i}点防御！（${10 * n}%触发）】`;
			}
		},
		被攻击时: (对局: 对局类型) => {
			if (Math.random() * 100 < Math.min(5 * 存档.击败次数["草带男孩（中二病）"], 75)) {
				对局.伤害.独立乘区 *= 0
				return `【男孩使用「侯塞给！」（${Math.min(5 * 存档.击败次数["草带男孩（中二病）"], 75)}%触发）】`;
			}
		},
		失败效果: () => {
			const n = 存档.击败次数["草带男孩（中二病）"];
			if (2 == n) {
				存档.物品.果子 += 2;
				return "【男孩留下2个「果子」！然后逃走了！】你获得「果子」*2";
			}
			if (6 == n) {
				存档.物品.伤药 += 3;
				return "【男孩留下3个「伤药」！然后逃走了！】你获得「伤药」*3";
			}
			if (12 == n) {
				存档.物品.板砖++;
				return "【男孩留下一块「板砖」！然后逃走了！】你获得「板砖」*1";
			}
			if (20 == n) {
				存档.物品.装避鞋++;
				return "【男孩留下一个「装避鞋」！然后逃走了！】你获得「装避鞋」*1";
			}
			return "【“我是不会认输的！(▼ヘ▼#)”】";
		},
		胜利效果: () => {
			return "【︿(￣︶￣)︿】"
		}
	},
	{
		名称: "女流氓",
		get 等级() { return 8 + 存档.击败次数["女流氓"] * 20 },
		get 生命() { return 315 + 存档.击败次数["女流氓"] * 520 },
		get 攻击() { return 20 + 存档.击败次数["女流氓"] * 80 },
		get 防御() { return 存档.击败次数["女流氓"] * 40 },
		压制: 10,
		损失健康: 1,
		出场语: "“小帅哥，要不要跟姐姐玩玩呀”",
		掉落物: [
			{
				概率: 20,
				数量: 1,
				名称: "香烟",
			},
			{
				概率: 10,
				数量: 1,
				名称: "小裤裤",
			},
			{
				概率: 100,
				数量: 1,
				名称: "伤药",
			},
		],
		攻击时: (对局: 对局类型) => {
			const n = Math.floor(对局.敌人.攻击);
			const a = Math.floor(0.1 * 对局.敌人.攻击);
			const i = Math.floor(0.2 * 对局.敌人.攻击);
			对局.主角.防御-= a;
			对局.主角.攻击 -= i;
			对局.主角.生命 -= n;
			return `【${对局.敌人.名称}使用「壁咚」，你受到${n}点伤害，攻击下降${i}点，防御下降${a}点！】`;
		},
		失败效果: () => {
			存档.其他.女流氓要钱数 = 0
			return "【姐姐有点小兴奋了呢\n(*/ω＼*)】"	
		},
		胜利效果: () => {
			return  "【“￣へ￣！非要逼姐姐？”】"
		}
	},
	{
		名称: "女(流浪)汉子",
		get 等级() { return 20 + 存档.击败次数["女(流浪)汉子"] * 40 },
		get 生命() { return 998 + 存档.击败次数["女(流浪)汉子"] * 1400 },
		get 攻击() { return 50 + 存档.击败次数["女(流浪)汉子"] * 120 },
		get 防御() { return 36 + 存档.击败次数["女(流浪)汉子"] * 90 },
		压制: 40,
		损失健康: 1,
		增加声望: 1,
		出场语: "“(╬￣皿￣)=○这是我先看到的”",
		掉落物: [
			{
				概率: 100,
				数量: 2,
				名称: "果子",
			},
			{
				概率: 30,
				数量: 1,
				名称: "女装",
			},
		],
		攻击时: (对局: 对局类型) => {
			const e = Math.floor(0.3 * 对局.敌人.防御);
			const t = Math.floor(0.1 * 对局.敌人.生命);
			对局.主角.防御-= e;
			对局.敌人.生命 += t;
			return `【女汉子使用「王之怒视」，你降低${e}点防御，女汉子很开心，恢复了${t}点生命】`;
		},
	},
	{
		名称: "壮汉（精英）",
		get 等级() { return 15 + 存档.击败次数["壮汉（精英）"] * 30 },
		get 生命() { return 575 + 存档.击败次数["壮汉（精英）"] * 1000 },
		get 攻击() { return 60 + 存档.击败次数["壮汉（精英）"] * 180 },
		get 防御() { return 存档.击败次数["壮汉（精英）"] * 60 },
		压制: 40,
		损失健康: 1,
		增加声望: 1,
		出场语: "“老子的钱，你也敢捡？”",
		掉落物: [
			{
				概率: 100,
				数量: 2,
				名称: "伤药",
			},
			{
				概率: 30,
				数量: 1,
				名称: "创可贴",
			},
		],
		攻击时: (对局: 对局类型) => {
			对局.敌人.攻击 += Math.floor(0.1 * 对局.敌人.攻击);
			return "【壮汉使用「狂暴」，壮汉攻击增加】";
		},
		胜利效果: (对局: 对局类型) => {
			const n = Math.floor(Math.max(0.5 * 存档.金钱, 0));
			存档.金钱 -= n;
			return "【你损失一半的钱！】";
		},
	},

	// 荒野事件
	{
		名称: "孩子她妈",
		等级: 8,
		生命: 315,
		攻击: 10,
		压制: 9999,
		损失健康: 1,
		出场语: "“N——M——B——！”",
		掉落物: [
			{
				概率: 30,
				数量: 1,
				名称: "香烟",
			},
			{
				概率: 50,
				数量: 1,
				名称: "啤酒",
			},
		],
		攻击时: (对局: 对局类型) => {
			if (Math.random() * 100 < 50)  {
				return `【${对局.敌人.名称}使用「红色高跟鞋」，但是被你躲开啦！】`;
			}
			const n = 4 * 对局.敌人.攻击 - 对局.主角.防御;
			对局.伤害.基础加成 += n;
			return `【${对局.敌人.名称}使用「红色高跟鞋」，正中靶心，你损失${n}点生命！】`;
		},
	},
	{
		名称: "恶狗",
		等级: 6,
		生命: 250,
		攻击: 30,
		压制: 15,
		损失健康: 1,
		出场语: "“%&cnm#@*”",
		掉落物: [
			{
				概率: 100,
				数量: 2,
				名称: "生肉",
			},
		],
		方法: "撕咬",
		攻击时: (对局: 对局类型) => {
			对局.敌人.其他.技能点数++;
			if (Math.random() * 100 < 20 * 对局.敌人.其他.技能点数) {
				const a = 2 * 对局.敌人.攻击;
				对局.伤害.基础加成 += a;
				return `【${对局.敌人.名称}使用「疯咬」，伤害加成${a}点！】`;
			}
		},
	},

	// 县城事件
	{
		名称: "勒索二人组",
		等级: 20,
		生命: 710,
		攻击: 85,
		防御: 10,
		压制: 9999,
		损失健康: 1,
		出场语: "来人呀！！！抓小偷啦！————",
		掉落物: [
			{
				概率: 100,
				数量: 5,
				名称: "金钱",
			},
		],
		胜利效果: (对局: 对局类型) => {
			const n = Math.floor(Math.max(0.5 * 存档.金钱, 0));
			存档.金钱 -= n;
			return "【你损失一半的钱！】";
		},
	},

	// 山脉事件
	{
		名称: "电锯男",
		等级: 35,
		生命: 1200,
		压制: 9999,
		攻击: 9999,
		增加声望: 2,
		增加属性: 2,
		出场语: "“站好喽~别动啊~”",
		掉落物: [
			{
				概率: 100,
				数量: 1,
				名称: "麻布衣",
			},
		],
		方法: "电锯！",
		胜利效果: (对局: 对局类型) => {
			const n = 2 * 存档.其他.拒绝砍一刀次数 + 2;
			存档.金钱 += n;
			存档.其他.拒绝砍一刀次数 = 0;
			return `【“哎呀~舒服了~舒服了”。你获得${(n / 10).toFixed(1)}元】`;
		},
	},

	// 郊外事件
	{
		名称: "杀.破.狼",
		get 等级() { return 60 + 存档.击败次数["杀.破.狼"] * 20 },
		get 生命() { return 2025 + 存档.击败次数["杀.破.狼"] * 120 },
		get 攻击() { return 310 + 存档.击败次数["杀.破.狼"] * 150 },
		get 防御() { return 121 + 存档.击败次数["杀.破.狼"] * 50 },
		压制: 9999,
		损失健康: 1,
		出场语: "“嗷嗷嗷~”",
		掉落物: [
			{
				概率: 100,
				数量: 2,
				名称: "生肉",
			},
			{
				概率: 20,
				数量: 1,
				名称: "火狐皮",
			},
		],
		攻击时: (对局: 对局类型) => {
			对局.敌人.其他.技能点数++;
			if (Math.random() * 100 < 20 * 对局.敌人.其他.技能点数) {
				const a = 2 * 对局.敌人.攻击 - 对局.主角.防御;
				对局.伤害.基础加成 += a;
				return `【${对局.敌人.名称}使用「暴击」，你损失${a}点生命！（${20 * 对局.敌人.其他.技能点数}%触发）】`;
			}
		},
		失败效果: (对局: 对局类型) => {
			if (对局.敌人.等级 == 160) {
				return "【激活特性「防御强化3」！】";
			}
		},
	},

	// 市中心事件
	{
		名称: "大肚男（幕后操手）",
		等级: 200,
		生命: 6645,
		攻击: 1200,
		防御: 450,
		压制: 9999,
		损失健康: 2,
		增加声望: 1,
		增加属性: 2,
		出场语: "“滚开！敢打老子女人的注意？”",
		掉落物: [
			{
				概率: 100,
				数量: 60,
				名称: "金钱",
			},
		],
		失败效果: () => {
			存档.其他.给妹子钱次数++;
		},
	},

	// 城中村事件
	{
		名称: "暴走的流浪汉",
		get 等级() { return 40 + 存档.击败次数["暴走的流浪汉"] * 20 },
		get 生命() { return 3900 + 存档.击败次数["暴走的流浪汉"] * 2000 },
		get 攻击() { return 90 + 存档.击败次数["暴走的流浪汉"] * 63 },
		get 防御() { return 50 + 存档.击败次数["暴走的流浪汉"] * 23 },
		压制: -50,
		损失健康: 2,
		增加声望: 1,
		出场语: "“？NM~敢抢老子东西？”",
		攻击时: (对局: 对局类型) => {
			if (对局.敌人.其他.技能点数 === 4) {
				const e = 对局.敌人.攻击 * (1 + 对局.敌人.其他.技能点数);
				对局.伤害.基础加成 += e;
				return `【${对局.敌人.名称}使用「叫尼玛抢！还敢不敢抢？」，你损失${e}点生命！】`;
			}
			对局.敌人.其他.技能点数++;
			const t = 对局.敌人.攻击;
			const n = Math.floor(0.1 * 对局.敌人.攻击 * 对局.敌人.其他.技能点数);
			对局.伤害.基础加成 += t + n;

			对局.主角.攻击 -= Math.floor(0.05 * 对局.主角.攻击);
			return `【${对局.敌人.名称}使用「连推带踹！」你受到${t}点伤害，附加${n}流血，攻击降低5%！】`;
		},
		被攻击时: (对局: 对局类型) => {
			对局.敌人.攻击 += Math.floor(0.05 * 对局.敌人.攻击);
			return `【${对局.敌人.名称}使用「暴跳如雷」，流浪汉攻击强化5%！】`;
		},
		失败效果: () => {
			存档.物品.易拉罐 += 3;
			return `【获得「易拉罐」*3！】`;
		},
		胜利效果: (对局: 对局类型) => {
			存档.金钱 -= Math.floor(0.3 * 存档.金钱);
			return "【你被抢走30%的金钱！】";
		},
	},

	// 特殊
	{
		名称: "蒙面人",
		等级: 99,
		生命: 99999,
		防御: 9999,
		压制: 9999,
		损失健康: 1,
		出场语: "“想知道我是谁？那是不可能的！”",
		掉落物: [
			{
				概率: 100,
				数量: 4,
				名称: "果子",
			},
			{
				概率: 10,
				数量: 1,
				名称: "麻布衣",
			},
		],
		攻击时: (对局: 对局类型) => {
			const n = 2 * Math.random() + 1;
			const a = Math.floor(对局.主角.最大生命 * n);
			对局.主角.生命 -= a;
			return `【蒙面人使用「闷棍Max」，你损失${a}点生命！】`;
		},
		胜利效果: (对局: 对局类型) => {
			存档.距离 = 299;
			return "【你被蒙面人打晕，趴光衣服被丢在了省城门口！】";
		},
	},
	{
		名称: "蒙面人2",
		显示名称: "蒙面人",
		等级: 99,
		生命: 9999,
		防御: 9999,
		压制: 9999,
		损失健康: 1,
		出场语: "“想知道我是谁？那是不可能的！”",
		掉落物: [
			{
				概率: 100,
				数量: 4,
				名称: "果子",
			},
			{
				概率: 10,
				数量: 1,
				名称: "麻布衣",
			},
		],
		攻击时: (对局: 对局类型) => {
			const n = 2 * Math.random() + 1;
			const a = Math.floor(对局.主角.最大生命 * n);
			对局.主角.生命 -= a;
			return `【蒙面人使用「闷棍Max」，你损失${a}点生命！】`;
		},
		胜利效果: (对局: 对局类型) => {
			存档.物品.果子 = 0;
			存档.物品.熟肉 = 0;
			存档.距离 = 99;
			return "【你被蒙面人打晕，食物全丢，趴光衣服被丢在了县城门口！】";
		},
	},
	{
		名称: "游戏作者",
		等级: 999,
		生命: 9999,
		压制: 9999,
		损失健康: 999,
		出场语: "“哈哈哈哈哈哈！你是想抵抗神的旨意么？”",
		攻击时: (对局: 对局类型) => {
			const n = Math.floor(0.3 * 对局.主角.最大生命);
			对局.主角.生命 -= n;
			随机分散文本和战斗元素()
			return "【啊哈哈哈你的游戏数据正在被作者删除啊哈哈哈游戏已损坏游戏已损坏】";
		},
		被攻击时: () => {
			return "【啊哈哈哈你的游戏数据正游戏已损坏啊哈哈哈你的游戏数据正】"
		},
		失败效果: () => {
			存档.物品.眼泪++;
			return `获得【MMP】*1【眼泪】*1（用于解锁隐藏其他，你已拥有${存档.物品.眼泪}）`;
		},
		胜利效果: (对局: 对局类型) => {
			setTimeout(() => {
				删除存档(存档.存档名称)
				跳转场景("开始");
			}, 3000)
			return "你的存档已被作者清除，游戏即将自动关闭";
		},
	},
	{
		名称: "陈晓（大大）2",
		显示名称: "陈晓（大大）",
		get 等级() { return 500 + 存档.击败次数["陈晓（大大）2"] * 500 },
		get 生命() { return 16500 + 存档.击败次数["陈晓（大大）2"] * 16000 },
		get 攻击() { return 1500 + 存档.击败次数["陈晓（大大）2"] * 1500 },
		get 防御() { return 1150 + 存档.击败次数["陈晓（大大）2"] * 1150 },
		压制: 9999,
		损失健康: 1,
		增加声望: 1,
		出场语: "“小伙，过来抽根烟？”",
		掉落物: [
			{
				概率: 100,
				数量: 6,
				名称: "子弹",
			},
			{
				概率: 100,
				数量: 1,
				名称: "香烟",
			},
		],
		攻击时: (对局: 对局类型) => {
			const e = 对局.敌人.攻击 + 对局.主角.防御;
			对局.伤害.基础加成 += e;
			
			const t = Math.floor(0.2 * (对局.敌人.最大生命 - 对局.敌人.生命));
			对局.敌人.生命 += t;
			return `【陈晓使用「晓风.霸王拳」，对你造成${e}点伤害，自身恢复${t}点生命】`;
		},
		被攻击时: (对局: 对局类型) => {
			if (Math.random() * 100 < Math.min(对局.敌人.等级 / 50 + 20, 80)) {
				对局.伤害.独立乘区 *= 0
				const t = Math.floor(0.5 * 对局.主角.攻击);
				对局.主角.生命 -= t;
				return `【${对局.敌人.名称}使用「格挡」「反弹」，你减少${t}点生命！（${Math.min(对局.敌人.等级 / 50 + 20, 80)}%触发）】`;
			}
		},
		胜利效果: (对局: 对局类型) => {
			存档.物品.枪--;
			return "【枪被抢走一把！你损失「枪」*1！】";
		},
	},

	// 未收录
	{
		名称: "毛贼",
		等级: 10,
		生命: 380,
		损失健康: 1,
		出场语: "嗡嗡-嗡！",
		掉落物: [
			{
				概率: 100,
				数量: 1,
				名称: "木材",
			},
			{
				概率: 100,
				数量: 1,
				名称: "亚麻",
			},
		],
		攻击时: (对局: 对局类型) => {
			const t = Math.max(20 - 对局.主角.防御, 0);
			对局.主角.生命 -= t;
			对局.敌人.生命 += t;
			return `【你被吸取${t}点生命！】`;
		},
		失败效果: () => {
			存档.物品.蚊子尸体++;
			return `【获得「蚊子尸体」*1】`;
		},
	},
	{
		名称: "精分患者",
		等级: 20,
		生命: 710,
		压制: 10,
		损失健康: 1,
		出场语: "%$#%$#%#^&^",
		掉落物: [
			{
				概率: 100,
				数量: 2,
				名称: "木材",
			},
			{
				概率: 100,
				数量: 2,
				名称: "亚麻",
			},
		],
		攻击时: (对局: 对局类型) => {
			const t = Math.max(60 - 对局.主角.防御, 0);
			对局.敌人.攻击 += 10;
			对局.主角.生命 -= t;
			对局.敌人.生命 += t;
			return `【你被吸取${t}点生命！${对局.敌人.名称}攻击+10】`;
		},
		失败效果: () => {
			存档.物品.蚊子尸体++;
			return `【获得「蚊子尸体」*1】`;
		},
	},
	{
		名称: "盯谁谁怀孕大妈",
		等级: 35,
		生命: 1200,
		压制: 20,
		损失健康: 1,
		出场语: "嗡--------！",
		掉落物: [
			{
				概率: 100,
				数量: 3,
				名称: "木材",
			},
			{
				概率: 100,
				数量: 3,
				名称: "亚麻",
			},
		],
		攻击时: (对局: 对局类型) => {
			const t = Math.max(120 + 20 * 对局.敌人.其他.技能点数 - 对局.主角.防御, 0);
			对局.主角.生命 -= t;
			对局.敌人.生命 += t;
			return `【你被吸取${t}点生命！${对局.敌人.名称}吸血能力强化！】`;
		},
		失败效果: () => {
			存档.物品.蚊子尸体++;
			return `【获得「蚊子尸体」*1】`;
		},
	},
	{
		名称: "游戏GM",
		等级: 999,
		生命: 999999999,
		攻击: 999,
		防御:  999,
		损失健康: 5,
		出场语: "“你好，你已经被我盯上了哟~”",
		掉落物: [
			{
				概率: 100,
				数量: 4,
				名称: "果子",
			},
			{
				概率: 10,
				数量: 1,
				名称: "麻布衣",
			},
		],
		攻击时: (对局: 对局类型) => {
			const n = Math.floor(0.2 * 对局.主角.最大生命);
			对局.主角.生命 -= n;
			return "【“叫你丫的刷！啊！还刷不刷？！”】";
		},
		被攻击时: (对局: 对局类型) => {
			const n = Math.floor(0.2 * 对局.主角.最大生命);
			对局.主角.生命 -= n;
			return "【“你丫还敢还手？你还敢还手！”】";
		},
	},
];

