import { 存档 } from "../管理器/存档管理器";
import { 设置 } from "../管理器/设置管理器";

interface 藏品定义类型 {
	名称: string,
	描述: string | (() => string),
	效果?: Record<string, (a: any) => void>
}

export const 默认藏品表: 藏品定义类型[] = [
    {
        名称: "流浪牌香烟",
        描述: "击败县城的胡渣壮汉概率获得",
    },

    {
        名称: "老白干",
        描述: "击败县城的醉汉概率获得",
    },

    {
        名称: "西装",
        描述: "击败西装男概率获得，面试成功率提升",
    },

    {
        名称: "草袋",
        描述: "击败草袋男孩获得"
    },

    {
        名称: "巨人之冠",
        描述: "击败山岭巨人获得，全属性提升"
    },

    {
        名称: "青鳞玉佩",
        描述: "击败荒野小青获得，蛇类伤害-5%"
    },

    {
        名称: "小混混的弹簧刀",
        描述: "击败县城小混混获得，暴击率+0.5"
    },

    {
        名称: "灵果籽",
        描述: "击败果树获得，恢复速度提升"
    },

    {
        名称: "作者签名卡",
        描述: "挑战晓风获得，经验获取速度提升"
    },

    {
        名称: "幻想草绳",
        描述: "击败草袋男孩获得，闪避率提升"
    },

    {
        名称: "旧军壶",
        描述: "击败郊外流浪大叔获得，恢复速度提升"
    },

    {
        名称: "赤狼牙",
        描述: "击败红狼获得，攻击提升"
    },

    {
        名称: "股市分析报告",
        描述: "击败金融分析师获得，投资成功率提升"
    },

    {
        名称: "二锅头",
        描述: "击败县城醉汉获得，暴躁概率增加/饮酒恢复精力+5"
    },

    {
        名称: "蚊子腿",
        描述: "击败蚊女王获得，击败蚊子掉落生肉"
    },

    {
        名称: "山岩之心",
        描述: "击败山脉山岭巨人获得，防御提升"
    },

    {
        名称: "王者冠冕",
        描述: "挑战吾王获得，全属性提升"
    },

    {
        名称: "虫壳",
        描述: "击败再生虫获得，生命提升"
    },

    {
        名称: "女贼王冠",
        描述: "击败女贼王获得，偷窃成功率提升"
    },

    {
        名称: "基因碎片",
        描述: "挑战基因计划获得"
    },

    {
        名称: "赤焰狐尾",
        描述: "击败火狐获得，每回合自动回复"
    },

    {
        名称: "大大徽章",
        描述: "击败陈晓（大大）获得"
    },

    {
        名称: "加密光盘",
        描述: "击败卖片老板获得"
    },

    {
        名称: "千年树皮",
        描述: "击败古树获得，开局木材增加"
    },

    {
        名称: "走私团伙的粉末",
        描述: "击败走私团伙获得，走私团伙爆率提升"
    },

    {
        名称: "街头项链",
        描述: "击败阿龙获得，市中心伤害加成"
    }
]