import { 对局类型 } from "../场景脚本/战斗";
import { 保存设置, 设置 } from "../管理器/设置管理器";

interface 藏品定义类型 {
	名称: string,
	描述: string,
    敌人: string,
    效果?: Record<string, (a: any) => void>
}

const 藏品表: 藏品定义类型[] = [
    {
        名称: "流浪牌香烟",
        描述: "击败县城的胡渣壮汉概率获得，提高攻击伤害",
        敌人: "胡渣壮汉（精英）",
    },
    {
        名称: "老白干",
        描述: "击败县城的醉汉概率获得，提高暴躁率",
        敌人: "醉汉（精英）",
    },
    {
        名称: "西装",
        描述: "击败西装男概率获得，面试成功率提升",
        敌人: "西装男（精英）",
    },
    {
        名称: "青鳞玉佩",
        描述: "击败荒野小青获得，蛇类伤害-5%",
        敌人: "小青（精英）",
    },

    {
        名称: "小混混的弹簧刀",
        描述: "击败县城小混混获得，暴击率+0.5",
        敌人: "小混混"
    },
    {
        名称: "灵果籽",
        描述: "击败果树获得，恢复速度提升",
        敌人: "果树",
    },
    {
        名称: "作者签名卡",
        描述: "挑战晓风获得，经验获取速度提升",
        敌人: "晓风",
    },
    {
        名称: "幻想草绳",
        描述: "击败草袋男孩获得，闪避率提升",
        敌人: "草袋男孩（中二病）",
    },
        {
        名称: "旧军壶",
        描述: "击败郊外流浪大叔获得，恢复速度提升",
        敌人: "流浪大叔"
    },

    {
        名称: "赤狼牙",
        描述: "击败红狼获得，攻击提升",
        敌人: "红狼",
    },

    {
        名称: "股市分析报告",
        描述: "击败金融分析师获得，投资成功率提升",
        敌人: "金融分析师",
    },

    {
        名称: "二锅头",
        描述: "击败县城醉汉获得，暴躁概率增加/饮酒恢复精力+5",
        敌人: "县城醉汉",
    },
    {
        名称: "蚊子腿",
        描述: "击败蚊女王获得，击败蚊子掉落生肉",
        敌人: "蚊女王",
    },
    {
        名称: "山岩之心",
        描述: "击败山脉山岭巨人获得，防御提升",
        敌人: "山岭巨人（稀有）",
    },

    {
        名称: "王者冠冕",
        描述: "挑战吾王获得，全属性提升",
        敌人: "吾王",
    },
    {
        名称: "虫壳",
        描述: "击败再生虫获得，生命提升",
        敌人: "再生虫",
    },
    {
        名称: "女贼王冠",
        描述: "击败贼女王获得，偷窃成功率提升",
        敌人: "贼女王",
    },

    {
        名称: "基因碎片",
        描述: "挑战基因计划获得，增加最大生命",
        敌人: "晓风基因计划",
    },

    {
        名称: "赤焰狐尾",
        描述: "击败火狐获得，每回合自动回复",
        敌人: "火狐（稀有）",
    },
    {
        名称: "大大徽章",
        描述: "击败陈晓（大大）获得，增加最大精力",
        敌人: "陈晓（大大）",
    },
    {
        名称: "加密光盘",
        描述: "击败卖片老板获得，增加最大防御",
        敌人: "卖片老板",
    },
    {
        名称: "千年树皮",
        描述: "击败古树获得，开局木材增加",
        敌人: "古树",
    },
    {
        名称: "走私团伙的粉末",
        描述: "击败走私团伙获得，走私团伙爆率提升",
        敌人: "走私团伙"
    },
    {
        名称: "街头项链",
        描述: "击败阿龙获得，市中心伤害加成",
        敌人: "阿龙"
    }
]

export const 默认藏品表 = 藏品表.map(藏品 => ({
    ...藏品,
    效果: {
        战斗胜利: (对局: 对局类型) => {
            if (对局.敌人.名称 === 藏品.敌人 && Math.random() * 100 < 1) {
                设置.藏品[藏品.名称] += 1;
                保存设置();
                对局.结果文本.push(`你获得了藏品「${藏品.名称}」*1（藏品系统暂未开启）`);
            }
        }
    }
}));