import { 存档 } from "../管理器/存档管理器";
import { 设置 } from "../管理器/设置管理器";

interface 藏品定义类型 {
	名称: string,
	描述: string | (() => string),
	效果?: Record<string, (a: any) => void>
}

export const 默认藏品表: 藏品定义类型[] = [
    {
        名称: "流浪牌香烟",
        描述: "击败县城的胡渣壮汉概率获得",
    },

    {
        名称: "老白干",
        描述: "击败县城的醉汉概率获得",
    },

    {
        名称: "西装",
        描述: "击败西装男概率获得",
    },

    {
        名称: "草袋",
        描述: "击败草袋男孩获得"
    },

    {
        名称: "西装",
        描述: "击败西装男获得"
    },

    {
        名称: "巨人之冠",
        描述: "击败西装男获得"
    }
]