export const 隐藏剧情 = [
    {
        名称: "比武大会",
        条件: "省城第30天，前往市中心第一次探索遇到，县城第37天结束，持续7天"
    },
    {
        名称: "奇怪的入口",
        条件: "省城前14天，城中村探索，有概率发现一处奇怪的入口，击败地下竞技场看守后，获得地下竞技场入场券，地下竞技场140天后关闭"
    },
    {
        名称: "租房中介",
        条件: "县城探索时，小概率遇到租房中介"
    },
    {
        名称: "隐者的试炼",
        条件: "试炼难度，雾天，山脉最后一天触发；选择坐下听他说后进入三问试炼，通过可获得永久属性与幸运石奖励，失败获得少量阅历"
    },
    {
        名称: "郊外白影",
        条件: "省城郊外探索时低概率听到白影传说；听过传说后，小雨天气在郊外探索有概率遭遇荒野幽灵"
    },
    {
        名称: "碧瑶线-隐藏剧情(真实一阶)",
        条件: "真实难度，碧瑶成为伙伴且好感至少5000，已击败两次皮衣男；第153~154天探索触发第一阶段，第159~160天探索触发第二阶段，击败阿胜并通关可达成隐藏结局【同行】"
    }
]
