import { Color } from 'cc';
import { 存档 } from '../管理器/存档管理器';
import type { 通用效果字段类型 } from '../管理器/钩子管理器';
import { 获取地区名称 } from './地区表';

interface 难度定义类型 {
  名称: string;
  说明: string;
  提示?: string;
  颜色?: Color;
  条件: boolean;
  效果?: 通用效果字段类型;
}

export const 默认难度表: 难度定义类型[] = [
  {
    名称: '普通',
    说明: '普通难度，怪物默认属性',
    条件: true,
    效果: {
      计算吸烟健康翻倍根数: (计算容器) => {
        if (存档.游戏难度 === '普通') {
          计算容器.初始值 = 13;
        }
      },
      计算喝酒健康损失概率增加: (计算容器) => {
        if (存档.游戏难度 === '普通') {
          计算容器.固定加成 = 1;
        }
      },
    }
  },
  {
    名称: '试炼',
    说明: '试炼难度，怪物1.5倍属性',
    颜色: new Color(33, 150, 243),
    效果: {
      计算吸烟健康翻倍根数: (计算容器) => {
        if (存档.游戏难度 === '试炼') {
          计算容器.初始值 = 11;
        }
      },
      计算喝酒健康损失概率增加: (计算容器) => {
        if (存档.游戏难度 === '试炼') {
          计算容器.固定加成 = 2;
        }
      },
      战斗敌人属性增强: (对局) => {
        if (存档.游戏难度 === '试炼' && !对局.是否PVP) {
          if (对局.敌人.生命 === 对局.敌人.最大生命) {
            对局.敌人.生命 = Math.floor(对局.敌人.生命 * 1.5);
          }

          对局.敌人.最大生命 = Math.floor(对局.敌人.最大生命 * 1.5);
          对局.敌人.攻击 = Math.floor(对局.敌人.攻击 * 1.5);
          对局.敌人.防御 = Math.floor(对局.敌人.防御 * 1.5);
        }
      },
    },
    条件: true,
  },
  {
    名称: '真实',
    说明: '真实难度，怪物2倍属性',
    颜色: new Color(255, 152, 0),
    效果: {
      计算吸烟健康翻倍根数: (计算容器) => {
        if (存档.游戏难度 === '真实') {
          计算容器.固定加成 = 9;
        }
      },
      计算喝酒健康损失概率增加: (计算容器) => {
        if (存档.游戏难度 === '真实') {
          计算容器.固定加成 = 4;
        }
      },
      战斗敌人属性增强: (对局) => {
        if (存档.游戏难度 === '真实' && !对局.是否PVP) {
          if (对局.敌人.生命 === 对局.敌人.最大生命) {
            对局.敌人.生命 = Math.floor(对局.敌人.生命 * 2);
          }

          对局.敌人.最大生命 = Math.floor(对局.敌人.最大生命 * 2);
          对局.敌人.攻击 = Math.floor(对局.敌人.攻击 * 2);
          对局.敌人.防御 = Math.floor(对局.敌人.防御 * 2);
        }
      },
    },
    条件: true,
  },
  {
    名称: '残酷',
    说明: '残酷难度，怪物3倍属性！应用精力曲线',
    提示: '默认开启',
    颜色: new Color(255, 0, 174),
    效果: {
      计算吸烟健康翻倍根数: (计算容器) => {
        if (存档.游戏难度 === '残酷') {
          计算容器.固定加成 = 7;
        }
      },
      计算喝酒健康损失概率增加: (计算容器) => {
        if (存档.游戏难度 === '残酷') {
          计算容器.固定加成 = 8;
        }
      },
      战斗敌人属性增强: (对局) => {
        if (存档.游戏难度 === '残酷' && !对局.是否PVP) {
          if (对局.敌人.生命 === 对局.敌人.最大生命) {
            对局.敌人.生命 = Math.floor(对局.敌人.生命 * 3);
          }

          对局.敌人.最大生命 = Math.floor(对局.敌人.最大生命 * 3);
          对局.敌人.攻击 = Math.floor(对局.敌人.攻击 * 3);
          对局.敌人.防御 = Math.floor(对局.敌人.防御 * 3);
        }
      },
    },
    条件: true,
  },
  {
    名称: '绝境',
    说明: '绝境难度，怪物3-5倍属性！应用精力曲线',
    提示: '默认开启',
    颜色: new Color(244, 67, 54),
    效果: {
      计算吸烟健康翻倍根数: (计算容器) => {
        if (存档.游戏难度 === '绝境') {
          计算容器.固定加成 = 5;
        }
      },
      计算喝酒健康损失概率增加: (计算容器) => {
        if (存档.游戏难度 === '绝境') {
          计算容器.固定加成 = 16;
        }
      },
      战斗敌人属性增强: (对局) => {
        if (存档.游戏难度 === '绝境' && !对局.是否PVP) {
          const 地区名称 = 获取地区名称();
          if (地区名称 === '荒野') {
            if (对局.敌人.生命 === 对局.敌人.最大生命) {
              对局.敌人.生命 = Math.floor(对局.敌人.生命 * 3);
            }

            对局.敌人.最大生命 = Math.floor(对局.敌人.最大生命 * 3);
            对局.敌人.攻击 = Math.floor(对局.敌人.攻击 * 3);
            对局.敌人.防御 = Math.floor(对局.敌人.防御 * 3);
          } else if (地区名称 === '县城') {
            if (对局.敌人.生命 === 对局.敌人.最大生命) {
              对局.敌人.生命 = Math.floor(对局.敌人.生命 * 4);
            }

            对局.敌人.最大生命 = Math.floor(对局.敌人.最大生命 * 4);
            对局.敌人.攻击 = Math.floor(对局.敌人.攻击 * 4);
            对局.敌人.防御 = Math.floor(对局.敌人.防御 * 4);
          } else {
            if (对局.敌人.生命 === 对局.敌人.最大生命) {
              对局.敌人.生命 = Math.floor(对局.敌人.生命 * 5);
            }

            对局.敌人.最大生命 = Math.floor(对局.敌人.最大生命 * 5);
            对局.敌人.攻击 = Math.floor(对局.敌人.攻击 * 5);
            对局.敌人.防御 = Math.floor(对局.敌人.防御 * 5);
          }
        }
      },
    },
    条件: true,
  },
];
