import { 抽取物品 } from "../方法函数/公共函数";
import { 存档 } from "../管理器/存档管理器";

interface 难度定义类型 {
	名称: string,
	说明: string | (() => string),
	提示?: string | (() => string),
	颜色?: string,
	效果?: Record<string, (x?) => any>
}

export const 难度表: 难度定义类型[] = [
	{
		名称: "普通",
		说明: "已选择，普通难度，怪物默认属性！难度较低。",
		颜色: "#4CAF50",
	},
	{
		名称: "试炼",
		说明: "已选择，试炼难度，怪物1.5倍属性！",
		颜色: "#2196F3",
		效果: {
			战斗初始化: (敌人) => {
				敌人.生命 = Math.floor(敌人.生命 * 1.5)
				敌人.最大生命 = Math.floor(敌人.最大生命 * 1.5)
				敌人.攻击 = Math.floor(敌人.攻击 * 1.5)
				敌人.防御 = Math.floor(敌人.防御 * 1.5)
			}
		}
	},
	{
		名称: "残酷",
		说明: "已选择，残酷难度，怪物2倍属性！",
		提示: "完成成就【一战成名】后解锁！",
		颜色: "#FF9800",
		效果: {
			战斗初始阿: (敌人) => {
				敌人.生命 = Math.floor(敌人.生命 * 2)
				敌人.最大生命 = Math.floor(敌人.最大生命 * 2)
				敌人.攻击 = Math.floor(敌人.攻击 * 2)
				敌人.防御 = Math.floor(敌人.防御 * 2)
			}
		}
	},
	{
		名称: "炼狱",
		说明: "已选择，炼狱难度，怪物3倍属性！",
		提示: "完成成就【一战之力】后解锁！",
		颜色: "#F44336",
		效果: {
			战斗初始阿: (敌人) => {
				敌人.生命 = Math.floor(敌人.生命 * 3)
				敌人.最大生命 = Math.floor(敌人.最大生命 * 3)
				敌人.攻击 = Math.floor(敌人.攻击 * 3)
				敌人.防御 = Math.floor(敌人.防御 * 3)
			}
		}
	},
]