import { 对局类型 } from "../场景脚本/战斗";
import { 存档 } from "../管理器/存档管理器";
import { 设置 } from "../管理器/设置管理器";
import { 获取地区名称 } from "./地区表";

interface 难度定义类型 {
	名称: string,
	说明: string,
	提示?: string,
	颜色?: string,
	条件: boolean,
	效果?: Record<string, (...参数: any) => any>,
}

export const 默认难度表: 难度定义类型[] = [
	{
		名称: "普通",
		说明: "已选择，普通难度，怪物默认属性",
		条件: true,
	},
	{
		名称: "试炼",
		说明: "已选择，试炼难度，怪物1.5倍属性",
		颜色: "#2196F3",
		效果: {
			战斗初始化: (对局: 对局类型) => {
				if(存档.游戏难度 === '试炼' && !对局.是否PVP){
					对局.敌人.生命 = Math.floor(对局.敌人.生命 * 1.5)
					对局.敌人.最大生命 = Math.floor(对局.敌人.最大生命 * 1.5)
					对局.敌人.攻击 = Math.floor(对局.敌人.攻击 * 1.5)
					对局.敌人.防御 = Math.floor(对局.敌人.防御 * 1.5)
				}
			}
		},
		条件: true,
	},
	{
		名称: "真实",
		说明: "已选择，真实难度，怪物2倍属性",
		提示: "完成成就【一试身手】后解锁！",
		颜色: "#FF9800",
		效果: {
			战斗初始化: (对局: 对局类型) => {
				if(存档.游戏难度 === '真实' && !对局.是否PVP){
					对局.敌人.生命 = Math.floor(对局.敌人.生命 * 2)
					对局.敌人.最大生命 = Math.floor(对局.敌人.最大生命 * 2)
					对局.敌人.攻击 = Math.floor(对局.敌人.攻击 * 2)
					对局.敌人.防御 = Math.floor(对局.敌人.防御 * 2)
				}
			}
		},
		get 条件() { return false },
	},
	{
		名称: "残酷",
		说明: "已选择，残酷难度，怪物3倍属性！应用精力曲线",
		提示: "完成成就【一试身手】后解锁！",
		颜色: "#FF9800",
		效果: {
			战斗初始化: (对局: 对局类型) => {
				if(存档.游戏难度 === '残酷' && !对局.是否PVP){
					对局.敌人.生命 = Math.floor(对局.敌人.生命 * 3)
					对局.敌人.最大生命 = Math.floor(对局.敌人.最大生命 * 3)
					对局.敌人.攻击 = Math.floor(对局.敌人.攻击 * 3)
					对局.敌人.防御 = Math.floor(对局.敌人.防御 * 3)
				}
			}
		},
		get 条件() { return false },
	},
	{
		名称: "焚天",
		说明: "已选择，焚天难度，怪物3-5倍属性（按地区递增）",
		提示: "完成成就【一战成名】后解锁！",
		颜色: "#F44336",
		效果: {
			战斗初始化: (对局: 对局类型) => {
				if(存档.游戏难度 === '焚天' && !对局.是否PVP){
					if(获取地区名称() === '荒野'){
						对局.敌人.生命 = Math.floor(对局.敌人.生命 * 3)
						对局.敌人.最大生命 = Math.floor(对局.敌人.最大生命 * 3)
						对局.敌人.攻击 = Math.floor(对局.敌人.攻击 * 3)
						对局.敌人.防御 = Math.floor(对局.敌人.防御 * 3)
					}
					else if(获取地区名称() === '县城'){
						对局.敌人.生命 = Math.floor(对局.敌人.生命 * 4)
						对局.敌人.最大生命 = Math.floor(对局.敌人.最大生命 * 4)
						对局.敌人.攻击 = Math.floor(对局.敌人.攻击 * 4)
						对局.敌人.防御 = Math.floor(对局.敌人.防御 * 4)
					}
					else {
						对局.敌人.生命 = Math.floor(对局.敌人.生命 * 5)
						对局.敌人.最大生命 = Math.floor(对局.敌人.最大生命 * 5)
						对局.敌人.攻击 = Math.floor(对局.敌人.攻击 * 5)
						对局.敌人.防御 = Math.floor(对局.敌人.防御 * 5)
					}
				}
			}
		},
		get 条件() { return false },
	},
]
