import { 存档 } from "../管理器/存档管理器";
import { 计算最大生命, 计算最大精力, 计算最大饥饿 } from "../方法函数/属性计算"

export interface 食物项目类型 {
	名称: string,
	描述: string,
	说明: string ,
	条件: boolean,
	显示: boolean,
	使用: (({提示, 食用成功}) => void),
}

export const 默认食物表: 食物项目类型[] = [
	{
		名称: "果子",
		get 描述() { return `※拥有：${存档.物品.果子}`; },
		get 说明() { return `※效果：饥饿+20。每食用7个恢复1点健康值。（再食用${7 - (存档.使用次数.果子 % 7)}个果子恢复）`; },
		get 条件() { return 存档.物品.果子 > 0; },
		使用: ({提示, 食用成功}) => {
			if (存档.物品.果子 <= 0) {
				提示("道具不足！");
				return
			}
			if (存档.饥饿 >= 计算最大饥饿()) {
				提示("已经吃不下了！");
				return
			}
			存档.物品.果子 -= 1;
			存档.饥饿 += 20;
			存档.使用次数.果子 += 1;

			if (存档.使用次数.果子 % 7 === 0) {
				存档.健康 += 1;
				食用成功("饥饿+20，健康值+1！");
			}
			食用成功(`饥饿+20！`);
		},
		显示: true
	},
	{
		名称: "熟肉",
		get 描述() { return `※拥有：${存档.物品.熟肉}`; },
		get 说明() { return "※效果：饥饿+70"; },
		get 条件() { return 存档.物品.熟肉 > 0; },
		使用: ({提示, 食用成功}) => {
			if (存档.物品.熟肉 <= 0) {
				提示("道具不足！");
				return
			}
			if (存档.饥饿 >= 计算最大饥饿()) {
				提示("已经吃不下了！");
				return
			}
			存档.物品.熟肉 -= 1;
			存档.饥饿 += 70;
			存档.使用次数.熟肉 += 1;
			食用成功("饥饿+70！");
		},
		显示: true
	},
	{
		名称: "伤药",
		get 描述() { return `※拥有：${存档.物品.伤药}`; },
		get 说明() { return `※效果：恢复${30 + 存档.使用次数.伤药}生命值，且每次使用恢复量永久提高1点`; },
		get 条件() { return 存档.物品.伤药 > 0; },
		使用: ({提示, 食用成功}) => {
			if (存档.物品.伤药 <= 0) {
				提示("道具不足！");
				return
			}

			const 最大生命 = 计算最大生命()
			if (存档.生命 >= 最大生命) {
				提示("生命已达最大值！");
				return
			}

			存档.物品.伤药 -= 1;
			const 恢复 = 30 + 存档.使用次数.伤药;
			存档.生命 += 恢复;
			if (存档.生命 > 最大生命) {
				存档.生命 = 最大生命;
			}
			存档.使用次数.伤药 += 1;
			食用成功(`Hp + ${恢复}`);
		},
		显示: true
	},
	{
		名称: "香烟",
		get 描述() { return `※拥有：${存档.物品.香烟}（你当前烟瘾为${存档.烟瘾率}%）`; },
		get 说明() {
			const 恢复率 = 1 / Math.pow(2, 存档.其他.当日抽烟数);
			return `※效果：减少1点健康。恢复全部状态的${(恢复率 * 100).toFixed(1)}%！解除烟瘾（每天重复使用效果递减）`;
		},
		get 条件() { return 存档.物品.香烟 > 0; },
		使用: ({提示, 食用成功}) => {
			if (存档.物品.香烟 <= 0) {
				提示("道具不足！");
				return
			}
			存档.健康 -= 1;
			存档.物品.香烟 -= 1;
			存档.烟瘾率 += 3

			const 恢复率 = 1 / Math.pow(2, 存档.其他.当日抽烟数);

			const 最大精力 = 计算最大精力()
			const 最大生命 = 计算最大生命()
			const 最大饥饿 = 计算最大饥饿()

			const 精力恢复 = Math.floor(最大精力 * 恢复率);
			const 生命恢复 = Math.floor(最大生命 * 恢复率);
			const 饥饿恢复 = Math.floor(最大饥饿 * 恢复率);

			存档.精力 = Math.min(存档.精力 + 精力恢复, 最大精力);
			存档.生命 = Math.min(存档.生命 + 生命恢复, 最大生命);
			存档.饥饿 = Math.min(存档.饥饿 + 饥饿恢复, 最大饥饿);

			存档.使用次数.香烟 += 1;
			存档.状态.烟瘾 = false;
			存档.物品.烟头 += 1;
			存档.其他.当日抽烟数 += 1;
			食用成功(`健康-1，精力+${精力恢复}/生命+${生命恢复}/饥饿+${饥饿恢复}！获得烟头*1`);
		},
		显示: true
	},
	{
		名称: "啤酒",
		get 描述() { return `※拥有：${存档.物品.啤酒}`; },
		get 说明() { return `※效果：恢复30精力，并获得一个【易拉罐】。10%开罐有奖！每天使用三次以上获得【暴躁】状态（伤害增加30%，战后一定几率消失）（今日已使用${存档.其他.当日喝啤酒数}）`; },
		get 条件() { return 存档.物品.啤酒 > 0; },
		使用: ({提示, 食用成功}) => {
			if (存档.物品.啤酒 <= 0) {
				提示("道具不足！");
				return
			}
			let 字符串 = "精力+30，获得【易拉罐】*1";
			存档.物品.啤酒 -= 1;
			存档.精力 += 30;
			存档.物品.易拉罐 += 1;
			存档.其他.当日喝啤酒数 += 1;
			if (存档.其他.当日喝啤酒数 >= 3) {
				存档.状态.暴躁 = true;
				字符串 += "，获得【暴躁】！";
			}
			if (Math.random() * 100 < 10) {
				if (Math.random() * 100 < 30) {
					存档.金钱 += 10;
					字符串 += "，恭喜获得1元大奖！";
				} else {
					存档.物品.啤酒 += 1;
					字符串 += "，恭喜再来一瓶！";
				}
			}
			食用成功(字符串);
		},
		显示: true
	},
	{
		名称: "干脆面",
		get 描述() { return `※拥有：${存档.物品.干脆面}`; },
		get 说明() { return `※效果：饥饿+40。20%再来一包！`; },
		get 条件() { return 存档.物品.干脆面 > 0; },
		使用: ({提示, 食用成功}) => {
			if (存档.物品.干脆面 <= 0) {
				提示("道具不足！");
				return
			}
			if (存档.饥饿 >= 计算最大饥饿()) {
				提示("已经吃不下了！");
				return
			}

			存档.物品.干脆面 -= 1;
			存档.饥饿 += 40;
			let 结果文本 = "饥饿+40！";

			if (Math.random() * 100 < 20) {
				存档.物品.干脆面 += 1;
				结果文本 += `恭喜中奖！再来一包！`;
			}

			存档.使用次数.干脆面 += 1;
			存档.状态.干饭王 = false;

			const 累计食用数 = 存档.使用次数.干脆面;
			if (累计食用数 % 20 === 0 && 累计食用数 > 0) {
				存档.最大饥饿 += Math.floor(0.05 * 计算最大饥饿())
				结果文本 += "累计食用20包！饥饿上限永久+5%！";
			}
			食用成功(结果文本);
		},
		get 显示() { return 存档.物品.干脆面 > 0; },
	},

	{
		名称: "维生素片",
		get 描述() { return `※拥有：${存档.物品.维生素片}`; },
		get 说明() { return `※效果：提升1点健康！`; },
		get 条件() { return 存档.物品.维生素片 > 0; },
		使用: ({提示, 食用成功}) => {
			if (存档.物品.维生素片 <= 0) {
				提示("道具不足！");
				return
			}
			存档.物品.维生素片 -= 1;
			存档.健康 += 1;
			食用成功("健康+1！");
		},
		get 显示() { return 存档.物品.维生素片 > 0; },
	},

	{
		名称: "精制香烟",
		get 描述() { return `※拥有：${存档.物品.精制香烟}（你当前烟瘾为${存档.烟瘾率}%）`; },
		get 说明() {
			const 恢复率 = 1 / Math.pow(2, 存档.其他.当日抽烟数);
			return `※效果：减少1点健康。恢复全部状态的${(恢复率 * 100).toFixed(1)}%！解除烟瘾（每天重复使用效果递减）【额外获得自信状态】`;
		},
		get 条件() { return 存档.物品.精制香烟 > 0; },
		使用: ({提示, 食用成功}) => {
			if (存档.物品.精制香烟 <= 0) {
				提示("道具不足！");
				return
			}
			存档.健康 -= 1;
			存档.物品.精制香烟 -= 1;
			存档.烟瘾率 += 3

			const 恢复率 = 1 / Math.pow(2, 存档.其他.当日抽烟数);

			const 最大精力 = 计算最大精力()
			const 最大生命 = 计算最大生命()
			const 最大饥饿 = 计算最大饥饿()

			const 精力恢复 = Math.floor(最大精力 * 恢复率);
			const 生命恢复 = Math.floor(最大生命 * 恢复率);
			const 饥饿恢复 = Math.floor(最大饥饿 * 恢复率);

			存档.精力 = Math.min(存档.精力 + 精力恢复, 最大精力);
			存档.生命 = Math.min(存档.生命 + 生命恢复, 最大生命);
			存档.饥饿 = Math.min(存档.饥饿 + 饥饿恢复, 最大饥饿);

			存档.使用次数.精制香烟 += 1;
			存档.状态.烟瘾 = false;
			存档.物品.烟头 += 1;
			存档.其他.当日抽烟数 += 1;

			存档.状态.自信 = true
			食用成功(`健康-1，精力+${精力恢复}/生命+${生命恢复}/饥饿+${饥饿恢复}！获得烟头*1！获得自信状态！`);
		},
		get 显示() { return 存档.物品.精制香烟 > 0; },
	},
]
